src/理论法.org
#+TITLE:      理论法（大文本测试）
#+date:       [2025-01-25 六 13:11]
#+filetags:   :法律:资源:


** 引入
五个科目：
1. 法理学
   法的本体、法的运行、法的演进和法与社会
2. 宪法学
   宪法理论、国家基本制度、公民基本权利与义务、国家机构、立法法
3. 中国法律史
   制度史+思想史
   （起点+节点）
4. 中特社法律
   基本原理、基本格局、重要保障
5. 司法制度和法律职业道德
   一个大帽子，五种人
   禁止性规定、义务性规定

* 法的本体
从八个角度看法是什么东西。
** 法的概念
“法是什么”
核心问题：法与道德是否存在概念上的必然联系。
*** 对核心问题的争议
- 实证主义立场：恶法亦法
  + 分析主义法学：权威性
    : 由权威制定的规范是法律
    * 包容性实证主义：道德可以成为法的效力条件
      奥斯丁、哈特、凯尔森
    * 排他性实证主义：不接受道德的介入
      明确分开法律与道德两者。
  + 法社会学和法现实主义：社会实效
    : 有社会实效，能被人们遵守的规范是法律
    但是，非官方组织的规范可以是法律吗。
    埃利希、庞德、霍姆斯
- 非实证主义立场：恶法非法。
  + 古典自然法学（传统自然法）
    : 以法的内容正确性（道德）定义法。
    亚里士多德、西塞罗
  + “第三条道路”
    : 同时以内容正确性与权威性或社会实效作为定义要素。
    阿列克西、德沃金

非实证主义关注高于实然法律的应然法律：“高级法”、自然法、神定法
高级法检验人定法的善恶。
实证主义认为应然与实然之间无必然联系。

*** 马克思主义关于法的本质
三层本质，逐级深入：
- 正式性
  法律由公权力制定或认可、保证实现、予以公布、体现国家意志
- 阶级性
  在阶级对立中体现统治阶级的意志
  意志是统治阶级的整体博弈权衡的结果
  也可以部分包含被统治阶级的意志
- 物质制约性
  法的内容受社会存在制约、由一定社会物质生活条件决定。

*** 国法
- 有国家强制力的国家法律，以及其延伸：
- 专门的立法机关的 /成文法/
- 法院判决中创建的 /判例法/
- 国家认可的 /不成文法/
- 其他执行国法职能的法，如 /教会法/

*** 法的特征
1. 调整人的行为的社会规范
   1) 不针对思想，故不能惩罚“思想犯”
      : 腹诽
   2) 针对社会中的交互行为
   3) 不同于技术规范与自然法则，法律以社会力为保证
   4) 类同的社会规范有道德规范、政治规范、宗教规范、习俗、纪律等
      : 道德、宗教不仅改变人的行为，也要改变人的思想
2. 由公权力制定或认可的具有特定形式的社会规范
   1) 制定：形成 /条文化/ 的逻辑结构
   2) 认可：国家认可道德、宗教、风俗、习惯等规范
      + 明示认可，由立法机关的普遍约束力
      + 默示认可，由司法机关的没有普遍约束力，“从习惯”“按政策办”
3. 具有 /普遍性/ 的社会规范
   1) 普遍有效性，国家权力之下具有约束
   2) 普遍平等对待性，人人平等
   3) 普遍一致性，内容与人类普遍要求相一致
4. 以 /权利义务/ 为内容的社会规范
   1) 实质是允许的利益与要求放弃的利益
   2) 自然法则与技术规范不以权利义务为内容
   3) 法律有权利义务对等，道德宗教等以义务为内容
5. 法以 /国家强制力/ 为后盾，通过法律 /程序/ 保证实现
   1) /凡规范都有保证自己实现的力量/
   2) 法律是 /最具有/ 外在强制性的社会规范
   3) 国家暴力是合法暴力，具有实体法与 /程序法/ 两方面要求
6. 法是 /可诉/  的规范体系
   因此可以依据法律提起诉讼、却不能依据道德、宗教提起诉讼。
*** 法的作用
作为一种规范，法对人的行为具有规范作用；
作为一种社会事物，法对社会具有社会作用。
**** 规范作用
根据其作用的主体与范围，分为五种功能：
1. 指引作用于特定主体本人的行为
   - 规范性指引：由规范性的法条法典产生
   - 个别性指引：由非规范性的判决书、合同产生
   - 选择指引：通过宣告 /权利/ 产生
   - 确定指引：通过设置 /义务/ 产生
2. 教育作用于一般人的行为
3. 评价作用于他人已发生的行为
   : 法院认定某行为构成犯罪。
4. 预测作用于人与人未发生的行为
   : 行为带来的结果是有预期的。
5. 强制作用于违法犯罪行为
   : 判决败诉，强制执行。
**** 社会作用
社会作用的三个领域、两个方向：
1. 社会经济生活领域、政治生活领域、思想文化领域
2. 政治职能（阶级统治）方向，社会职能（执行社会公共事务）方向

法律不是万能的。
- 法律以社会为基础，不可能超越社会需要
- 法律受其他社会规范以及社会条件和环境的制约
- 法律规制调整社会关系的能力是有限的
- 法律自身条件的制约“辞不尽意”
** 法的价值
*** 法的价值的含义
1. 价值体现了主客体间关系，法的价值取决于人。
2. 价值表明了正面意义，因负面意义不会是价值。
3. 价值兼有实然性与应然性，有对现实法律的认识与理想法律的追求。

*** 法的价值的种类
基本价值：秩序、自由、正义、人权。
法可以建立秩序、保护自由、实现正义、保障人权。
**** 秩序
1. “秩序”即社会秩序，这是由法律实现的状态。
2. 法律总是为一定的秩序服务，不会脱离秩序存在。
3. 秩序作为法的基本价值的原因：
   1) 社会统治建立的结果是产生了统治的秩序
   2) 秩序与法都要求人与人遵守相互行为规则
   3) 秩序是 /其他价值的基础/ ，如无秩序则自由无保障
4. 秩序本身又要 /合乎人性、符合常理/ ，受正义的规制
   那就不是为邪恶而服务。
**** 自由
自由分为积极自由（做任何事）与消极自由（不被强迫做事）。
1. “自由”即主体根据自己的意志目的而行动而不受外在强制限制。
   法以保障人的行动能力为己任。
2. 法以自由为 /最高价值目标/ 。法典若限制自由等于践踏人性。
   - 伤害原则：伤害别人的行为应受到法律的检查和干涉。
   - 道德主义原则：违背一个社群的道德准则的行为应受到法律的禁止。
   - 家长主义原则（父爱原则）：法律可以为人自身的福利幸福需要禁止自我伤害。
     这支持禁止自杀、禁止决斗、强制戒毒，国家可以此干预一些领域。
   - 冒犯原则：法律禁止令人愤怒、羞耻或惊恐的冒犯他人的行为。
     这与公序良俗原则相一致。
3. 自由是衡量真正法律的 /评价标准/ 。
4. 自由更是 /体现人性最深刻的需要/ 。
**** 正义
1. 主观的正义-个人的美德-“个人正义”。
   客观的正义-社会共同生活的正直状态规则-“社会正义”。
   社会正义有共识，法学主要涉及 /社会正义/ 。
2. 法与正义的关系
   1) 正义是 /内在于法律/ 中的某种东西：程序正义、形式正义
      只有在运用法律的时候才能显出法律的
   2) 适用法律的具体案件的裁判可能出现“直观的不正义”
   3) 法应与正义或实质的道德规准相一致，否则法就是不正义的
3. 法的正义价值涉及分配正义
   1) 分配正义即分配利益与负担，是共同体成员的权利与义务
   2) 分配正义准则：
      - 平等原则或无差别原则
      - 差别原则：按则贡献分配所得
        有缺陷的人可能无贡献，也不应以此剥夺其分配，维持人的价值与尊严
      - 个人需求原则：人的必然客观个人需求应予以满足
**** 人权
1. 人权既每个人应然的或实然的权利。
   人权是一种来自“人自身”的权利，只要是人就应当享有。
   人权必须有具体内容。
2. 人权在逻辑上先于国家和法，是法律与道德权利。根本上是一种道德权利。
3. 人权是法的源泉，可用于判断法律的善恶、好坏、进步与否。
4. 人权必须尽可能被法律化。
   作为道德权利的人权是虚拟的，人权法律化意味着人权实在化。
