public_html/理论法.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>理论法（大文本测试）</title>
<meta name="author" content="Pilrymage" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="./style.css" type="text/css"/>
<link rel="icon" href="favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="./index.html">Home</a></li>
    <li><a href="./about.html">About</a></li>
    <!-- <li><a href="./rss.xml">RSS</a></li> -->
    <li><a href="https://github.com/Pilrymage/">GitHub</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">理论法（大文本测试）</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org97c2926">引入</a></li>
</ul>
</li>
<li><a href="#org2d0a113">法的本体</a>
<ul>
<li><a href="#orgb97aba2">法的概念</a></li>
<li><a href="#org9bdf360">法的价值</a></li>
<li><a href="#org41d4acd">法的要素</a></li>
<li><a href="#org7d99872">法的渊源</a></li>
<li><a href="#org641c96a">法律部门与法律体系</a></li>
<li><a href="#orge060e59">法的效力</a></li>
<li><a href="#orge27490b">法律关系</a></li>
<li><a href="#org6e97dff">法律责任</a></li>
</ul>
</li>
<li><a href="#org052acd9">法的运行</a>
<ul>
<li><a href="#orgfbc53a1">法的制定和法的实施（宏观的法的运行）</a></li>
<li><a href="#orge81d9f8">法适用的一般原理与法律证成</a></li>
<li><a href="#orgb3a7271">法律解释</a></li>
<li><a href="#orge85cc35">法律推理</a></li>
<li><a href="#org1d7448b">法律漏洞的填补</a></li>
</ul>
</li>
<li><a href="#orgf2dfbfe">法的演进和法与社会</a>
<ul>
<li><a href="#orgdd070d3">法的起源</a></li>
<li><a href="#org7bbd440">法的发展与传统</a></li>
<li><a href="#org6df41a7">法的现代化</a></li>
<li><a href="#org2faeca5">法与社会、经济、政治、道德、宗教</a></li>
</ul>
</li>
<li><a href="#orgb9f718d">宪法基本理论</a>
<ul>
<li><a href="#org3c66628">宪法概述</a></li>
<li><a href="#orgf2b1414">宪法的制定</a></li>
<li><a href="#org9c60261">宪法的基本原则</a></li>
<li><a href="#orgb1cf131">宪法的基本功能</a></li>
<li><a href="#orgd41ee71">宪法的渊源与宪法典的结构</a></li>
<li><a href="#org4da005a">宪法规范与宪法效力</a></li>
<li><a href="#orgbb63ae7">宪法的实施及其保障</a></li>
</ul>
</li>
<li><a href="#org8b2f41e">国家的基本制度</a>
<ul>
<li><a href="#org0bbe340">国家的基本政治制度</a></li>
<li><a href="#org689a0da">国家的基本经济制度</a></li>
<li><a href="#orge422f65">国家的基本文化制度</a></li>
<li><a href="#org056eda9">国家的基本社会制度</a></li>
<li><a href="#org9981484">国家结构形式</a></li>
<li><a href="#org300a4df">国家标志</a></li>
<li><a href="#org2cd048d">民族区域自治制度</a></li>
<li><a href="#org8c33784">特别行政区制度</a></li>
<li><a href="#orgb3db105">基层群众自治制度</a></li>
<li><a href="#org37aad0a">人大代表选举制度</a></li>
</ul>
</li>
<li><a href="#org3309754">公民的基本权利与义务</a>
<ul>
<li><a href="#org2db33e7">公民基本权利与义务概述</a></li>
<li><a href="#org2616cac">我国公民的基本权利</a></li>
<li><a href="#org4a4c4e8">我国公民的基本义务</a></li>
</ul>
</li>
<li><a href="#org75ca0bf">国家机构</a>
<ul>
<li><a href="#org104e855">国家机构概述</a></li>
<li><a href="#orga346caf">全国人大、全国人大常委会与各委员会</a></li>
<li><a href="#org1d95d31">国家主席、国务院和中央军委</a></li>
<li><a href="#org46cb4f5">地方各级人大、人大常委会和地方各级人民政府</a></li>
<li><a href="#org7aa5acb">监察委、法院与检察院</a></li>
</ul>
</li>
<li><a href="#orgb97e590">立法法专题</a>
<ul>
<li><a href="#org51dee05">立法程序、权限与冲突裁决</a></li>
<li><a href="#orge90493a">立法的批准与备案、撤销和改变</a></li>
</ul>
</li>
<li><a href="#orga23331e">先秦时期的法律思想与制度</a>
<ul>
<li><a href="#orgd3d9d06">西周时期</a></li>
<li><a href="#orgadf511a">春秋战国时期</a></li>
</ul>
</li>
<li><a href="#org70d6cc7">秦汉至魏晋南北朝时期的法律思想与制度</a>
<ul>
<li><a href="#orgc772ef8">秦汉时期</a></li>
<li><a href="#orgd712db2">魏晋南北朝时期</a></li>
</ul>
</li>
<li><a href="#org9ee41aa">隋唐宋元时期的法律思想与制度</a>
<ul>
<li><a href="#orgd72da19">隋唐时期</a></li>
<li><a href="#org39da1ed">宋元时期</a></li>
</ul>
</li>
<li><a href="#org8421c8b">明清时期的法律思想与制度</a>
<ul>
<li><a href="#org9af4631">明至清中期</a></li>
<li><a href="#orgd2809ae">清末</a></li>
</ul>
</li>
<li><a href="#org84c8349">中华民国时期的法律思想与制度</a>
<ul>
<li><a href="#org8742685">民国初期、南京临时政府</a></li>
<li><a href="#org696aa11">北京政府和南京国民政府</a></li>
</ul>
</li>
<li><a href="#org08170dd"><span class="done _">✘</span> 中国特色社会主义法治建设基本原理</a></li>
<li><a href="#orge94d12b"><span class="done _">✘</span> 法治工作的基本格局</a></li>
<li><a href="#orgfbed650"><span class="done _">✘</span> 法治工作的重要保障</a></li>
<li><a href="#org6ca9bd3">司法制度和法律职业道德概述</a>
<ul>
<li><a href="#orgd2ac6de">中国特色社会主义司法制度概述</a></li>
<li><a href="#orgf54615a">法律职业道德概述</a></li>
</ul>
</li>
<li><a href="#orgafa0bbd">审判制度和法官职业道德</a>
<ul>
<li><a href="#org1c56353">审判制度概述</a></li>
<li><a href="#orgca896aa">法官职业道德</a></li>
</ul>
</li>
<li><a href="#org7669812">检察制度和检察官职业道德</a>
<ul>
<li><a href="#org9785ab8">检察制度概述</a></li>
<li><a href="#org910219c">检察官职业道德</a></li>
</ul>
</li>
<li><a href="#org3db64b9">律师制度和律师职业道德</a>
<ul>
<li><a href="#org1a4868a">律师制度</a></li>
<li><a href="#org5e7f219">律师事务所</a></li>
<li><a href="#org429f988">法律援助制度</a></li>
<li><a href="#orgea4fd6d">律师职业道德与执业行为规范</a></li>
</ul>
</li>
<li><a href="#orga441a8d">公证制度和公证员职业道德</a>
<ul>
<li><a href="#org103d07d">公证制度概述</a></li>
<li><a href="#orgce95e0c">公证员职业道德</a></li>
</ul>
</li>
<li><a href="#orga49e470">其他法律职业人员职业道德</a>
<ul>
<li><a href="#org9fd899a">法律顾问职业道德</a></li>
<li><a href="#org06ee0ec">仲裁员职业道德</a></li>
<li><a href="#org160b8de">行政机关中从事行政处罚决定审核、行政议、行政裁决的公务员职业道德</a></li>
</ul>
</div>
</div>
<div id="outline-container-org97c2926" class="outline-3">
<h3 id="org97c2926">引入</h3>
<div class="outline-text-3" id="text-org97c2926">
<p>
五个科目：
</p>
<ol class="org-ol">
<li>法理学
法的本体、法的运行、法的演进和法与社会</li>
<li>宪法学
宪法理论、国家基本制度、公民基本权利与义务、国家机构、立法法</li>
<li>中国法律史
制度史+思想史
（起点+节点）</li>
<li>中特社法律
基本原理、基本格局、重要保障</li>
<li>司法制度和法律职业道德
一个大帽子，五种人
禁止性规定、义务性规定</li>
</ol>
</div>
</div>
<div id="outline-container-org2d0a113" class="outline-2">
<h2 id="org2d0a113">法的本体</h2>
<div class="outline-text-2" id="text-org2d0a113">
<p>
从八个角度看法是什么东西。
</p>
</div>
<div id="outline-container-orgb97aba2" class="outline-3">
<h3 id="orgb97aba2">法的概念</h3>
<div class="outline-text-3" id="text-orgb97aba2">
<p>
“法是什么”
核心问题：法与道德是否存在概念上的必然联系。
</p>
</div>
<ul class="org-ul">
<li><a id="org426cf3e"></a>对核心问题的争议<br />
<div class="outline-text-4" id="text-org426cf3e">
<ul class="org-ul">
<li>实证主义立场：恶法亦法
<ul class="org-ul">
<li><p>
分析主义法学：权威性
</p>
<pre class="example">
由权威制定的规范是法律
</pre>

<ul class="org-ul">
<li>包容性实证主义：道德可以成为法的效力条件
奥斯丁、哈特、凯尔森</li>
<li>排他性实证主义：不接受道德的介入
明确分开法律与道德两者。</li>
</ul></li>
<li><p>
法社会学和法现实主义：社会实效
</p>
<pre class="example">
有社会实效，能被人们遵守的规范是法律
</pre>

<p>
但是，非官方组织的规范可以是法律吗。
埃利希、庞德、霍姆斯
</p></li>
</ul></li>
<li>非实证主义立场：恶法非法。
<ul class="org-ul">
<li><p>
古典自然法学（传统自然法）
</p>
<pre class="example">
以法的内容正确性（道德）定义法。
</pre>

<p>
亚里士多德、西塞罗
</p></li>
<li><p>
“第三条道路”
</p>
<pre class="example">
同时以内容正确性与权威性或社会实效作为定义要素。
</pre>

<p>
阿列克西、德沃金
</p></li>
</ul></li>
</ul>

<p>
非实证主义关注高于实然法律的应然法律：“高级法”、自然法、神定法
高级法检验人定法的善恶。
实证主义认为应然与实然之间无必然联系。
</p>
</div>
</li>
<li><a id="org21d1ebc"></a>马克思主义关于法的本质<br />
<div class="outline-text-4" id="text-org21d1ebc">
<p>
三层本质，逐级深入：
</p>
<ul class="org-ul">
<li>正式性
法律由公权力制定或认可、保证实现、予以公布、体现国家意志</li>
<li>阶级性
在阶级对立中体现统治阶级的意志
意志是统治阶级的整体博弈权衡的结果
也可以部分包含被统治阶级的意志</li>
<li>物质制约性
法的内容受社会存在制约、由一定社会物质生活条件决定。</li>
</ul>
</div>
</li>
<li><a id="org42d8527"></a>国法<br />
<div class="outline-text-4" id="text-org42d8527">
<ul class="org-ul">
<li>有国家强制力的国家法律，以及其延伸：</li>
<li>专门的立法机关的 <i>成文法</i></li>
<li>法院判决中创建的 <i>判例法</i></li>
<li>国家认可的 <i>不成文法</i></li>
<li>其他执行国法职能的法，如 <i>教会法</i></li>
</ul>
</div>
</li>
<li><a id="org282ef82"></a>法的特征<br />
<div class="outline-text-4" id="text-org282ef82">
<ol class="org-ol">
<li>调整人的行为的社会规范
<ol class="org-ol">
<li><p>
不针对思想，故不能惩罚“思想犯”
</p>
<pre class="example">
腹诽
</pre></li>
<li>针对社会中的交互行为</li>
<li>不同于技术规范与自然法则，法律以社会力为保证</li>
<li><p>
类同的社会规范有道德规范、政治规范、宗教规范、习俗、纪律等
</p>
<pre class="example">
道德、宗教不仅改变人的行为，也要改变人的思想
</pre></li>
</ol></li>
<li>由公权力制定或认可的具有特定形式的社会规范
<ol class="org-ol">
<li>制定：形成 <i>条文化</i> 的逻辑结构</li>
<li>认可：国家认可道德、宗教、风俗、习惯等规范
<ul class="org-ul">
<li>明示认可，由立法机关的普遍约束力</li>
<li>默示认可，由司法机关的没有普遍约束力，“从习惯”“按政策办”</li>
</ul></li>
</ol></li>
<li>具有 <i>普遍性</i> 的社会规范
<ol class="org-ol">
<li>普遍有效性，国家权力之下具有约束</li>
<li>普遍平等对待性，人人平等</li>
<li>普遍一致性，内容与人类普遍要求相一致</li>
</ol></li>
<li>以 <i>权利义务</i> 为内容的社会规范
<ol class="org-ol">
<li>实质是允许的利益与要求放弃的利益</li>
<li>自然法则与技术规范不以权利义务为内容</li>
<li>法律有权利义务对等，道德宗教等以义务为内容</li>
</ol></li>
<li>法以 <i>国家强制力</i> 为后盾，通过法律 <i>程序</i> 保证实现
<ol class="org-ol">
<li><i>凡规范都有保证自己实现的力量</i></li>
<li>法律是 <i>最具有</i> 外在强制性的社会规范</li>
<li>国家暴力是合法暴力，具有实体法与 <i>程序法</i> 两方面要求</li>
</ol></li>
<li>法是 <i>可诉</i>  的规范体系
因此可以依据法律提起诉讼、却不能依据道德、宗教提起诉讼。</li>
</ol>
</div>
</li>
<li><a id="orga59c8dc"></a>法的作用<br />
<div class="outline-text-4" id="text-orga59c8dc">
<p>
作为一种规范，法对人的行为具有规范作用；
作为一种社会事物，法对社会具有社会作用。
</p>
</div>
<ul class="org-ul">
<li><a id="org57ac4a4"></a>规范作用<br />
<div class="outline-text-5" id="text-org57ac4a4">
<p>
根据其作用的主体与范围，分为五种功能：
</p>
<ol class="org-ol">
<li>指引作用于特定主体本人的行为
<ul class="org-ul">
<li>规范性指引：由规范性的法条法典产生</li>
<li>个别性指引：由非规范性的判决书、合同产生</li>
<li>选择指引：通过宣告 <i>权利</i> 产生</li>
<li>确定指引：通过设置 <i>义务</i> 产生</li>
</ul></li>
<li>教育作用于一般人的行为</li>
<li><p>
评价作用于他人已发生的行为
</p>
<pre class="example">
法院认定某行为构成犯罪。
</pre></li>
<li><p>
预测作用于人与人未发生的行为
</p>
<pre class="example">
行为带来的结果是有预期的。
</pre></li>
<li><p>
强制作用于违法犯罪行为
</p>
<pre class="example">
判决败诉，强制执行。
</pre></li>
</ol>
</div>
</li>
<li><a id="org3bc0d4e"></a>社会作用<br />
<div class="outline-text-5" id="text-org3bc0d4e">
<p>
社会作用的三个领域、两个方向：
</p>
<ol class="org-ol">
<li>社会经济生活领域、政治生活领域、思想文化领域</li>
<li>政治职能（阶级统治）方向，社会职能（执行社会公共事务）方向</li>
</ol>

<p>
法律不是万能的。
</p>
<ul class="org-ul">
<li>法律以社会为基础，不可能超越社会需要</li>
<li>法律受其他社会规范以及社会条件和环境的制约</li>
<li>法律规制调整社会关系的能力是有限的</li>
<li>法律自身条件的制约“辞不尽意”</li>
</ul>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org9bdf360" class="outline-3">
<h3 id="org9bdf360">法的价值</h3>
<div class="outline-text-3" id="text-org9bdf360">
</div>
<ul class="org-ul">
<li><a id="orgb6e21f6"></a>法的价值的含义<br />
<div class="outline-text-4" id="text-orgb6e21f6">
<ol class="org-ol">
<li>价值体现了主客体间关系，法的价值取决于人。</li>
<li>价值表明了正面意义，因负面意义不会是价值。</li>
<li>价值兼有实然性与应然性，有对现实法律的认识与理想法律的追求。</li>
</ol>
</div>
</li>
<li><a id="org8b2218a"></a>法的价值的种类<br />
<div class="outline-text-4" id="text-org8b2218a">
<p>
基本价值：秩序、自由、正义、人权。
法可以建立秩序、保护自由、实现正义、保障人权。
</p>
</div>
<ul class="org-ul">
<li><a id="org928158f"></a>秩序<br />
<div class="outline-text-5" id="text-org928158f">
<ol class="org-ol">
<li>“秩序”即社会秩序，这是由法律实现的状态。</li>
<li>法律总是为一定的秩序服务，不会脱离秩序存在。</li>
<li>秩序作为法的基本价值的原因：
<ol class="org-ol">
<li>社会统治建立的结果是产生了统治的秩序</li>
<li>秩序与法都要求人与人遵守相互行为规则</li>
<li>秩序是 <i>其他价值的基础</i> ，如无秩序则自由无保障</li>
</ol></li>
<li>秩序本身又要 <i>合乎人性、符合常理</i> ，受正义的规制
那就不是为邪恶而服务。</li>
</ol>
</div>
</li>
<li><a id="org3f2b540"></a>自由<br />
<div class="outline-text-5" id="text-org3f2b540">
<p>
自由分为积极自由（做任何事）与消极自由（不被强迫做事）。
</p>
<ol class="org-ol">
<li>“自由”即主体根据自己的意志目的而行动而不受外在强制限制。
法以保障人的行动能力为己任。</li>
<li>法以自由为 <i>最高价值目标</i> 。法典若限制自由等于践踏人性。
<ul class="org-ul">
<li>伤害原则：伤害别人的行为应受到法律的检查和干涉。</li>
<li>道德主义原则：违背一个社群的道德准则的行为应受到法律的禁止。</li>
<li>家长主义原则（父爱原则）：法律可以为人自身的福利幸福需要禁止自我伤害。
这支持禁止自杀、禁止决斗、强制戒毒，国家可以此干预一些领域。</li>
<li>冒犯原则：法律禁止令人愤怒、羞耻或惊恐的冒犯他人的行为。
这与公序良俗原则相一致。</li>
</ul></li>
<li>自由是衡量真正法律的 <i>评价标准</i> 。</li>
<li>自由更是 <i>体现人性最深刻的需要</i> 。</li>
</ol>
</div>
</li>
<li><a id="org183315e"></a>正义<br />
<div class="outline-text-5" id="text-org183315e">
<ol class="org-ol">
<li>主观的正义-个人的美德-“个人正义”。
客观的正义-社会共同生活的正直状态规则-“社会正义”。
社会正义有共识，法学主要涉及 <i>社会正义</i> 。</li>
<li>法与正义的关系
<ol class="org-ol">
<li>正义是 <i>内在于法律</i> 中的某种东西：程序正义、形式正义
只有在运用法律的时候才能显出法律的</li>
<li>适用法律的具体案件的裁判可能出现“直观的不正义”</li>
<li>法应与正义或实质的道德规准相一致，否则法就是不正义的</li>
</ol></li>
<li>法的正义价值涉及分配正义
<ol class="org-ol">
<li>分配正义即分配利益与负担，是共同体成员的权利与义务</li>
<li>分配正义准则：
<ul class="org-ul">
<li>平等原则或无差别原则</li>
<li>差别原则：按则贡献分配所得
有缺陷的人可能无贡献，也不应以此剥夺其分配，维持人的价值与尊严</li>
<li>个人需求原则：人的必然客观个人需求应予以满足</li>
</ul></li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org1134a20"></a>人权<br />
<div class="outline-text-5" id="text-org1134a20">
<ol class="org-ol">
<li>人权既每个人应然的或实然的权利。
人权是一种来自“人自身”的权利，只要是人就应当享有。
人权必须有具体内容。</li>
<li>人权在逻辑上先于国家和法，是法律与道德权利。根本上是一种道德权利。</li>
<li>人权是法的源泉，可用于判断法律的善恶、好坏、进步与否。</li>
<li>人权必须尽可能被法律化。
作为道德权利的人权是虚拟的，人权法律化意味着人权实在化。</li>
</ol>
</div>
</li>
</ul>
</li>
