src/理论法.org
*** 法的价值的冲突及其解决
1. 法的价值体系：基本价值与非基本价值。不可能在特定条件下被同等地实现。
2. 法的价值冲突在事实层面发生。
   一部具体的法律或一个部门往往优先满足一种价值，兼顾其他价值。
3. 法的价值冲突解决原则
   1) 个案中的比例原则
      相同种类的价值
      与其他价值相比，哪一价值在具体案件下更具有优先性？
      价值会互相损害，受损更小的价值更具优先性。
      总之不能无限袒护或拒斥某种利益。
   2) 价值位阶原则
      不同种类的价值
      不考虑具体案件的情境下，讲价值之间的优先性关系。
      - 具体法的价值位阶
      - 具体法所属部门法的价值位阶
      - 在国家法体系中的法的价值位阶
** 法的要素
组成法律的不可或缺不可再分的组分。
*** 法律规则
以一定的逻辑结构形式具体规定人们的法律权利。
**** 法律规则的逻辑结构
法律规则均由三个部分构成：
1. 假定条件，法律规则预设的适用的时间空间人与行为
2. 行为模式，规定的具体行为方式，是法律规则的核心部分
   三个模式：可为模式、应为模式、勿为模式
3. 法律后果，人的实际行为符合或不符合模式时产生的相应效果
   合法后果，违法后果
**** 法律规则与语言
1. 一切法律规范必须以 /法律语句/ 来表达->语言
2. 法律人只能通过语言来理解并运用法律->语义
3. 规范语句和非规范语句。
   规范语句包含道义助动词：必须、应当、禁止、可以
   : 结婚的男女双方必须亲自到婚姻登记机关进行结婚登记。
   : 当事人协商一致，可以变更合同。
   非规范语句用于描述实然，是陈述句，没有道义助动词。
   : 公民以他的户籍所在地的居住地为住所。
**** 法律规则与法律条文
法典大多以条文为基本构成单位。
1. 规范性条文与非规范性条文。
   1) 规范性条文：规定法律规则或法律原则的条文。
   2) 非规范性条文：规定某些法律技术内容的条文。
      例如，法律术语、公布机关和生效时间等。
   规范性条文 /能约束人的行为/ ，非规范条文不能，也不是技术条文。
   规范总是能约束人的。
2. 法律规则与法律条文的关系
   1) 一个法律规则对应多个法律条文
   2) 一个法律规则对应不同法律文件的法律条文
   3) 一个条文表述不同的法律规则或要素
   4) 条文仅规定规则的某个要素或若干要素
**** 法律规则的种类
1. 按行为模式分类：
   1) 授权性规则：允许有权做什么事
   2) 义务性规则
      - 命令性规则：应当、必须做什么
      - 禁止性规则：禁止、不准做什么
2. 按规则内容的确定性程度不同：
   1) 确定性规则：不指向其他机关或其他规则
   2) 委任性规则：指向其他机关
      : 由国务院、中央军事委员会依据本法另行制定
   3) 准用性规则：指向其他规则
      : 适用《中华人民共和国公司法》的规定
3. 根据行为限定的范围或程度不同
   1) 强行性规则：具有强制性，不容许更改
      : 现役军人的配偶要求离婚须得军人同意
   2) 任意性规则：允许自行选择、协商行为
      : 合资企业的产品可以出口，也可以在中国市场销售
*** 法律原则
为法律规则提供基础、本源的价值准则。
**** 法律原则的种类
1. 公理性原则、政策性原则
   : 平等、诚实信用、等价有偿、无罪推定、罪刑法定
   : 依法治国、实行社会主义市场经济
2. 基本原则和具体原则
   1) 基本原则是法律体系或某一法律部门适用的，体现法的基本价值的原则。
      : 如宪法规定的各项原则
   2) 具体原则是在基本原则指导下适用于某一法律部门中特定情形的原则。
3. 实体性原则和程序性原则
   1) 实体性原则是直接涉及实体法问题的原则。
      : 宪法、民法、刑法、行政法规定的原则
   2) 程序性原则是直接涉及程序法问题（诉讼和非诉程序法）的原则。
      : 一事不再理原则、辩护原则、无罪推定原则、上诉不加刑原则
**** 法律原则与法律规则的区别
|          | 法律规则                           | 法律原则                     |
| 内容     | 具体规定着眼于共性，防止“自由裁量” | 笼统规定，同时关注共性和个性 |
| 适用范围 | 某一类型的行为                     | 通用于某类行为至法律体系     |
| 适用方式 | 全有或全无（排他性）               | 不同强度，或有冲突原则       |
|          | 使用法条不能同时应用多条           | 可以适用多条                 |
**** 法律原则的适用条件
1. /规则优先适用/ 用完所有法律规则才能用法律原则
2. 除非为了 /个案正义/ ，不得舍弃法律规则而直接适用法律原则
   适用原则的理由要大于适用规则
*** 法律概念
1. 法律概念是指 /任何/ 具有法律意义的概念。
   既包括专门法律意义的概念（法人、债权），也包括日常生活中具有法律意义的概念（故意、自然人）
2. /任何/ 法律规范均由法律概念组成。
3. 法律概念的意义并不完全取决于法律规范，具有一定程度的 /独立性/ 。
4. 法律概念分类：
   - 按表述清晰：确定性概念与不确定性概念
   - 按要素之间的关系：
     + 分类概念：不可细分的要素，使用连词相连
       累积式必要（和，且），选择式必要（或）
     + 类型概念：可分级的要素
   - 按概念的功能差异：
     + 描述性概念：用以描述事实的概念，有真假之分
       自然事实、社会事实、制度性事实
     + 评价性概念：包含价值判断的概念，没有真假之分
       : 贵重物品，淫秽物品
     + 基于对事实的确认来认定另一个事实存在
       : 罪责，推定，视为
*** 权利与义务
**** 权利与义务的含义
1. 法律权利：法律许可和保障主体可以自主决定做出某种行为
2. 法律义务
   1) 义务是应然行为，而非事实上己经履行的行为
      存在服兵役的义务不代表必须要实现。
   2) 义务是强制履行的
**** 权利与义务的分类
1. 基本权利义务（基于宪法）与普通权利义务（基于普通法律）
2. 绝对权利义务与相对权利义务
   1) 绝对权利可对任何人主张，绝对义务应对任何人履行
      : 所有权不可侵犯，不得侵犯他人的人格尊严
   2) 相对权利只能向特定主体主张，相对义务应当向特定主体履行
      : 合同中甲乙双方的义务
3. 个人权利义务、集体权利义务、国家权利义务

**** 权利与义务的相互联系
1. 结构依存，紧密联系，不可分割
2. 数量上看，两者总量相等
3. 两者经历了一个从浑然一体到分裂对立再到相对一致的过程。
4. 权利和义务代表了不同的法律精神， /地位有主次之分/ 。
   等级特权社会强调义务本位，民主法治社会重视权利本位。
** 法的渊源
*** 法的渊源的概念
1. 法的表现形式，承认法的约束力的资料。
2. 正式的法的渊源：正式的法的表现形式，具有明文规定的法律效力
   可直接用作法律决定的大前提——判决依据。
3. 非正式的法的渊源：非正式的法的表现形式，不具有明文规定的法律效力
   但具有法律说服力，可作为大前提的准则来源——判决参照。
*** 当代中国法的正式渊源
八类正式渊源
1. 宪法
   制定机关：1954 年第一届全国人大第一次会议
   制定主体：人民
   : 我国宪法不能作为判决的依据。
2. 法律（狭义）
   制定机关：全国人大及其常委会
   1) 基本法律由全国人大制定修改：刑法等。
      基本法律以外的其他法律由常委会制定和修改：文物保护法等。
   2) 法律保留
      宪法和法律规定一些事项只能做法律规定，不得做行政规定，除非法律明确授权。
      : 《立法法》规定法律保留。很多。
      /尚未制定法律/ 的法律保留，全国人大及常委会可 /授权国务院/ 制定行政法规。
      /绝对法律保留：有关政治权利和自由、司法制度、罪与刑的事项。/
   3) 全国人大及常委会作出的规范性文件也是“法律”的法的渊源。
3. 行政法规
   制定机关：国务院。仅次于宪法和法律。
   “条例”“规定”“办法”“暂行条例”“暂行规定”（全国人大及常委会授权暂行）
   国务院各部门和地方人民政府的规章不得称条例。
4. 行政规章
   1) 部门规章
      制定机关：国务院各部委央行审计署直属管理机构
   2) 地方政府规章
      制定机关：设区的市、自治州以上的地方各级人民政府
5. 地方性法规
   1) 设区的市、自治州以上的地方各级人大及常委会
      “条例”“规则”“规定”“办法”
   2) 就本行政区域实际情况具体规定，或地方性事务的地方性法规
   3) 设区的市、自治州只能就城乡建设环境保护历史文化保护制定地方法规
      省、自治区、直辖市不受此限
6. 自治条例
   1) 制定机关：自治区、自治州、自治县的人大（不包括常委会）
      “条例”“规定”“变通规定”“变通办法”
   2) 依照当地民族的特点作出变通规定
      “基宪民专”不得违背基本原则、
      不得变通宪法、民族区域自治法及专门就民族自治地方所作的规定
7. 国际条约、国际惯例
   1) /我国缔结或参加的/ 国际条约、国际惯例作为法的渊源
   2) 《缔结条约程序法》《民用航空法》
8. 其他的法的正式渊源
   1) 经济特区的规范性文件，由全国人大授权的经济特区的人大及常委会制定
   2) 特别行政区法律，特别行政区立法会
   3) 中央军委制定的军事法规，军内的军事规章
*** 正式的法的渊源的效力原则
aka 法律效力等级、或法律效力位阶
1. 不同位阶冲突
   1) 宪法是核心，上位法高于下位法
   2) 第一等级：宪法（根本法）
      第二等级：法律、国际公约
      第三等级：行政法规
      第四等级：地方性法规、自治条例、单行条例、行政规章
2. 同一位阶冲突
   1) 特别法优先原则
      对特定人法、特定事法、特定空间法、特定时间法
   2) 后法优先/新法优先原则
3. 位阶交叉冲突
   1) 自治条例和单行条例作变通，优先适用自治条例和单行条例
   2) 经济特区的变通规定，优先适用经济特区法规
   3) 地方性法规规章之间不一致
      + 同一机关新规与旧规不一致，由制定机关裁决
      + 地方性法规与部门规章不一致，国务院提出意见
        全国人大常委会裁决
      + 部门规章与地方政府规章不一致，国务院裁决
      + 授权制定法规与法律规定不一致，由全国人大常委会裁决
*** 当代中国法的非正式渊源
非正式渊源：习惯、判例、政策
1. 习惯：指社会习惯。
   : 处理民事纠纷、应当依照法律；法律没有规定的，可以适用习惯，
   : 但是不得违背公序良俗。（《民法典》）
2. 判例：英美法系的判例作为正式渊源。
   任何判例都在一定程度上消除了语言的模糊性和歧义性，
   任何判例都是法官针对具体案件事实对概括的制定法进行解释而得到的一种结果。
   最高法、最高检的指导性案例应由各级人民法院参照。
3. 政策：不是指道德或伦理原则，不包括法定政策或法律政策（正式渊源）。
   国家政策、中共与国家或政府有关的政策。


- 禁止拒绝裁判原则：法官不得以正式渊源没有规定为由拒绝受理案件。
  此时有义务适用非正式渊源。
- 正式渊源不能提供明确答案时适用：
  + 正式渊源完全不能提供大前提
  + 正式渊源会造成不正义
  + 正式渊源会产生数种解释而不确定
** 法律部门与法律体系
*** 法律部门
1. 法律部门——部门法用于调整同一类社会关系。
2. 法律部门名称不需吻合其规范性法律文件。
3. 部门法以调整对象划分。
4. 公法、私法与社会法 乌尔比安
   社会法介于公法和私法之间：社会保障法。
5. 公法私法划分标准
   1) 公共当局主体论
      至少有一方是国家或其他公共当局大法的昖法
   2) 主从关系论
      调整平等地位的主体之间关系的法是私法
   3) 强制规范论
      公法是强制性规范的总称
   4) 利益论
      调整公共利益的为公法
   5) 折中论
      公共当局主体论与主从关系论结合
