public_html/理论法.html
<li><a id="org8ecf2e6"></a>法的价值的冲突及其解决<br />
<div class="outline-text-4" id="text-org8ecf2e6">
<ol class="org-ol">
<li>法的价值体系：基本价值与非基本价值。不可能在特定条件下被同等地实现。</li>
<li>法的价值冲突在事实层面发生。
一部具体的法律或一个部门往往优先满足一种价值，兼顾其他价值。</li>
<li>法的价值冲突解决原则
<ol class="org-ol">
<li>个案中的比例原则
相同种类的价值
与其他价值相比，哪一价值在具体案件下更具有优先性？
价值会互相损害，受损更小的价值更具优先性。
总之不能无限袒护或拒斥某种利益。</li>
<li>价值位阶原则
不同种类的价值
不考虑具体案件的情境下，讲价值之间的优先性关系。
<ul class="org-ul">
<li>具体法的价值位阶</li>
<li>具体法所属部门法的价值位阶</li>
<li>在国家法体系中的法的价值位阶</li>
</ul></li>
</ol></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org41d4acd" class="outline-3">
<h3 id="org41d4acd">法的要素</h3>
<div class="outline-text-3" id="text-org41d4acd">
<p>
组成法律的不可或缺不可再分的组分。
</p>
</div>
<ul class="org-ul">
<li><a id="orgd207267"></a>法律规则<br />
<div class="outline-text-4" id="text-orgd207267">
<p>
以一定的逻辑结构形式具体规定人们的法律权利。
</p>
</div>
<ul class="org-ul">
<li><a id="org492bd19"></a>法律规则的逻辑结构<br />
<div class="outline-text-5" id="text-org492bd19">
<p>
法律规则均由三个部分构成：
</p>
<ol class="org-ol">
<li>假定条件，法律规则预设的适用的时间空间人与行为</li>
<li>行为模式，规定的具体行为方式，是法律规则的核心部分
三个模式：可为模式、应为模式、勿为模式</li>
<li>法律后果，人的实际行为符合或不符合模式时产生的相应效果
合法后果，违法后果</li>
</ol>
</div>
</li>
<li><a id="org46d9b6f"></a>法律规则与语言<br />
<div class="outline-text-5" id="text-org46d9b6f">
<ol class="org-ol">
<li>一切法律规范必须以 <i>法律语句</i> 来表达-&gt;语言</li>
<li>法律人只能通过语言来理解并运用法律-&gt;语义</li>
<li><p>
规范语句和非规范语句。
规范语句包含道义助动词：必须、应当、禁止、可以
</p>
<pre class="example">
结婚的男女双方必须亲自到婚姻登记机关进行结婚登记。
当事人协商一致，可以变更合同。
</pre>

<p>
非规范语句用于描述实然，是陈述句，没有道义助动词。
</p>
<pre class="example">
公民以他的户籍所在地的居住地为住所。
</pre></li>
</ol>
</div>
</li>
<li><a id="org9cf838b"></a>法律规则与法律条文<br />
<div class="outline-text-5" id="text-org9cf838b">
<p>
法典大多以条文为基本构成单位。
</p>
<ol class="org-ol">
<li><p>
规范性条文与非规范性条文。
</p>
<ol class="org-ol">
<li>规范性条文：规定法律规则或法律原则的条文。</li>
<li>非规范性条文：规定某些法律技术内容的条文。
例如，法律术语、公布机关和生效时间等。</li>
</ol>
<p>
规范性条文 <i>能约束人的行为</i> ，非规范条文不能，也不是技术条文。
规范总是能约束人的。
</p></li>
<li>法律规则与法律条文的关系
<ol class="org-ol">
<li>一个法律规则对应多个法律条文</li>
<li>一个法律规则对应不同法律文件的法律条文</li>
<li>一个条文表述不同的法律规则或要素</li>
<li>条文仅规定规则的某个要素或若干要素</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org3e03324"></a>法律规则的种类<br />
<div class="outline-text-5" id="text-org3e03324">
<ol class="org-ol">
<li>按行为模式分类：
<ol class="org-ol">
<li>授权性规则：允许有权做什么事</li>
<li>义务性规则
<ul class="org-ul">
<li>命令性规则：应当、必须做什么</li>
<li>禁止性规则：禁止、不准做什么</li>
</ul></li>
</ol></li>
<li>按规则内容的确定性程度不同：
<ol class="org-ol">
<li>确定性规则：不指向其他机关或其他规则</li>
<li><p>
委任性规则：指向其他机关
</p>
<pre class="example">
由国务院、中央军事委员会依据本法另行制定
</pre></li>
<li><p>
准用性规则：指向其他规则
</p>
<pre class="example">
适用《中华人民共和国公司法》的规定
</pre></li>
</ol></li>
<li>根据行为限定的范围或程度不同
<ol class="org-ol">
<li><p>
强行性规则：具有强制性，不容许更改
</p>
<pre class="example">
现役军人的配偶要求离婚须得军人同意
</pre></li>
<li><p>
任意性规则：允许自行选择、协商行为
</p>
<pre class="example">
合资企业的产品可以出口，也可以在中国市场销售
</pre></li>
</ol></li>
</ol>
</div>
</li>
</ul>
</li>
<li><a id="orgcb99b81"></a>法律原则<br />
<div class="outline-text-4" id="text-orgcb99b81">
<p>
为法律规则提供基础、本源的价值准则。
</p>
</div>
<ul class="org-ul">
<li><a id="org0214ad6"></a>法律原则的种类<br />
<div class="outline-text-5" id="text-org0214ad6">
<ol class="org-ol">
<li><p>
公理性原则、政策性原则
</p>
<pre class="example">
平等、诚实信用、等价有偿、无罪推定、罪刑法定
依法治国、实行社会主义市场经济
</pre></li>
<li>基本原则和具体原则
<ol class="org-ol">
<li><p>
基本原则是法律体系或某一法律部门适用的，体现法的基本价值的原则。
</p>
<pre class="example">
如宪法规定的各项原则
</pre></li>
<li>具体原则是在基本原则指导下适用于某一法律部门中特定情形的原则。</li>
</ol></li>
<li>实体性原则和程序性原则
<ol class="org-ol">
<li><p>
实体性原则是直接涉及实体法问题的原则。
</p>
<pre class="example">
宪法、民法、刑法、行政法规定的原则
</pre></li>
<li><p>
程序性原则是直接涉及程序法问题（诉讼和非诉程序法）的原则。
</p>
<pre class="example">
一事不再理原则、辩护原则、无罪推定原则、上诉不加刑原则
</pre></li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org6a1d009"></a>法律原则与法律规则的区别<br />
<div class="outline-text-5" id="text-org6a1d009">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">法律规则</td>
<td class="org-left">法律原则</td>
</tr>

<tr>
<td class="org-left">内容</td>
<td class="org-left">具体规定着眼于共性，防止“自由裁量”</td>
<td class="org-left">笼统规定，同时关注共性和个性</td>
</tr>

<tr>
<td class="org-left">适用范围</td>
<td class="org-left">某一类型的行为</td>
<td class="org-left">通用于某类行为至法律体系</td>
</tr>

<tr>
<td class="org-left">适用方式</td>
<td class="org-left">全有或全无（排他性）</td>
<td class="org-left">不同强度，或有冲突原则</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">使用法条不能同时应用多条</td>
<td class="org-left">可以适用多条</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org0715fe3"></a>法律原则的适用条件<br />
<div class="outline-text-5" id="text-org0715fe3">
<ol class="org-ol">
<li><i>规则优先适用</i> 用完所有法律规则才能用法律原则</li>
<li>除非为了 <i>个案正义</i> ，不得舍弃法律规则而直接适用法律原则
适用原则的理由要大于适用规则</li>
</ol>
</div>
</li>
</ul>
</li>
<li><a id="orgfc49da6"></a>法律概念<br />
<div class="outline-text-4" id="text-orgfc49da6">
<ol class="org-ol">
<li>法律概念是指 <i>任何</i> 具有法律意义的概念。
既包括专门法律意义的概念（法人、债权），也包括日常生活中具有法律意义的概念（故意、自然人）</li>
<li><i>任何</i> 法律规范均由法律概念组成。</li>
<li>法律概念的意义并不完全取决于法律规范，具有一定程度的 <i>独立性</i> 。</li>
<li>法律概念分类：
<ul class="org-ul">
<li>按表述清晰：确定性概念与不确定性概念</li>
<li>按要素之间的关系：
<ul class="org-ul">
<li>分类概念：不可细分的要素，使用连词相连
累积式必要（和，且），选择式必要（或）</li>
<li>类型概念：可分级的要素</li>
</ul></li>
<li>按概念的功能差异：
<ul class="org-ul">
<li>描述性概念：用以描述事实的概念，有真假之分
自然事实、社会事实、制度性事实</li>
<li><p>
评价性概念：包含价值判断的概念，没有真假之分
</p>
<pre class="example">
贵重物品，淫秽物品
</pre></li>
<li><p>
基于对事实的确认来认定另一个事实存在
</p>
<pre class="example">
罪责，推定，视为
</pre></li>
</ul></li>
</ul></li>
</ol>
</div>
</li>
<li><a id="orgaa9e78c"></a>权利与义务<br />
<ul class="org-ul">
<li><a id="orge06e7bf"></a>权利与义务的含义<br />
<div class="outline-text-5" id="text-orge06e7bf">
<ol class="org-ol">
<li>法律权利：法律许可和保障主体可以自主决定做出某种行为</li>
<li>法律义务
<ol class="org-ol">
<li>义务是应然行为，而非事实上己经履行的行为
存在服兵役的义务不代表必须要实现。</li>
<li>义务是强制履行的</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="orgef6f110"></a>权利与义务的分类<br />
<div class="outline-text-5" id="text-orgef6f110">
<ol class="org-ol">
<li>基本权利义务（基于宪法）与普通权利义务（基于普通法律）</li>
<li>绝对权利义务与相对权利义务
<ol class="org-ol">
<li><p>
绝对权利可对任何人主张，绝对义务应对任何人履行
</p>
<pre class="example">
所有权不可侵犯，不得侵犯他人的人格尊严
</pre></li>
<li><p>
相对权利只能向特定主体主张，相对义务应当向特定主体履行
</p>
<pre class="example">
合同中甲乙双方的义务
</pre></li>
</ol></li>
<li>个人权利义务、集体权利义务、国家权利义务</li>
</ol>
</div>
</li>
<li><a id="orgf374030"></a>权利与义务的相互联系<br />
<div class="outline-text-5" id="text-orgf374030">
<ol class="org-ol">
<li>结构依存，紧密联系，不可分割</li>
<li>数量上看，两者总量相等</li>
<li>两者经历了一个从浑然一体到分裂对立再到相对一致的过程。</li>
<li>权利和义务代表了不同的法律精神， <i>地位有主次之分</i> 。
等级特权社会强调义务本位，民主法治社会重视权利本位。</li>
</ol>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org7d99872" class="outline-3">
<h3 id="org7d99872">法的渊源</h3>
<div class="outline-text-3" id="text-org7d99872">
</div>
<ul class="org-ul">
<li><a id="orgec89dc9"></a>法的渊源的概念<br />
<div class="outline-text-4" id="text-orgec89dc9">
<ol class="org-ol">
<li>法的表现形式，承认法的约束力的资料。</li>
<li>正式的法的渊源：正式的法的表现形式，具有明文规定的法律效力
可直接用作法律决定的大前提——判决依据。</li>
<li>非正式的法的渊源：非正式的法的表现形式，不具有明文规定的法律效力
但具有法律说服力，可作为大前提的准则来源——判决参照。</li>
</ol>
</div>
</li>
<li><a id="orgac32764"></a>当代中国法的正式渊源<br />
<div class="outline-text-4" id="text-orgac32764">
<p>
八类正式渊源
</p>
<ol class="org-ol">
<li><p>
宪法
制定机关：1954 年第一届全国人大第一次会议
制定主体：人民
</p>
<pre class="example">
我国宪法不能作为判决的依据。
</pre></li>
<li>法律（狭义）
制定机关：全国人大及其常委会
<ol class="org-ol">
<li>基本法律由全国人大制定修改：刑法等。
基本法律以外的其他法律由常委会制定和修改：文物保护法等。</li>
<li><p>
法律保留
宪法和法律规定一些事项只能做法律规定，不得做行政规定，除非法律明确授权。
</p>
<pre class="example">
《立法法》规定法律保留。很多。
</pre>

<p>
<i>尚未制定法律</i> 的法律保留，全国人大及常委会可 <i>授权国务院</i> 制定行政法规。
<i>绝对法律保留：有关政治权利和自由、司法制度、罪与刑的事项。</i>
</p></li>
<li>全国人大及常委会作出的规范性文件也是“法律”的法的渊源。</li>
</ol></li>
<li>行政法规
制定机关：国务院。仅次于宪法和法律。
“条例”“规定”“办法”“暂行条例”“暂行规定”（全国人大及常委会授权暂行）
国务院各部门和地方人民政府的规章不得称条例。</li>
<li>行政规章
<ol class="org-ol">
<li>部门规章
制定机关：国务院各部委央行审计署直属管理机构</li>
<li>地方政府规章
制定机关：设区的市、自治州以上的地方各级人民政府</li>
</ol></li>
<li>地方性法规
<ol class="org-ol">
<li>设区的市、自治州以上的地方各级人大及常委会
“条例”“规则”“规定”“办法”</li>
<li>就本行政区域实际情况具体规定，或地方性事务的地方性法规</li>
<li>设区的市、自治州只能就城乡建设环境保护历史文化保护制定地方法规
省、自治区、直辖市不受此限</li>
</ol></li>
<li>自治条例
<ol class="org-ol">
<li>制定机关：自治区、自治州、自治县的人大（不包括常委会）
“条例”“规定”“变通规定”“变通办法”</li>
<li>依照当地民族的特点作出变通规定
“基宪民专”不得违背基本原则、
不得变通宪法、民族区域自治法及专门就民族自治地方所作的规定</li>
</ol></li>
<li>国际条约、国际惯例
<ol class="org-ol">
<li><i>我国缔结或参加的</i> 国际条约、国际惯例作为法的渊源</li>
<li>《缔结条约程序法》《民用航空法》</li>
</ol></li>
<li>其他的法的正式渊源
<ol class="org-ol">
<li>经济特区的规范性文件，由全国人大授权的经济特区的人大及常委会制定</li>
<li>特别行政区法律，特别行政区立法会</li>
<li>中央军委制定的军事法规，军内的军事规章</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org4ffaeb7"></a>正式的法的渊源的效力原则<br />
<div class="outline-text-4" id="text-org4ffaeb7">
<p>
aka 法律效力等级、或法律效力位阶
</p>
<ol class="org-ol">
<li>不同位阶冲突
<ol class="org-ol">
<li>宪法是核心，上位法高于下位法</li>
<li>第一等级：宪法（根本法）
第二等级：法律、国际公约
第三等级：行政法规
第四等级：地方性法规、自治条例、单行条例、行政规章</li>
</ol></li>
<li>同一位阶冲突
<ol class="org-ol">
<li>特别法优先原则
对特定人法、特定事法、特定空间法、特定时间法</li>
<li>后法优先/新法优先原则</li>
</ol></li>
<li>位阶交叉冲突
<ol class="org-ol">
<li>自治条例和单行条例作变通，优先适用自治条例和单行条例</li>
<li>经济特区的变通规定，优先适用经济特区法规</li>
<li>地方性法规规章之间不一致
<ul class="org-ul">
<li>同一机关新规与旧规不一致，由制定机关裁决</li>
<li>地方性法规与部门规章不一致，国务院提出意见
全国人大常委会裁决</li>
<li>部门规章与地方政府规章不一致，国务院裁决</li>
<li>授权制定法规与法律规定不一致，由全国人大常委会裁决</li>
</ul></li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org587167c"></a>当代中国法的非正式渊源<br />
<div class="outline-text-4" id="text-org587167c">
<p>
非正式渊源：习惯、判例、政策
</p>
<ol class="org-ol">
<li><p>
习惯：指社会习惯。
</p>
<pre class="example">
处理民事纠纷、应当依照法律；法律没有规定的，可以适用习惯，
但是不得违背公序良俗。（《民法典》）
</pre></li>
<li>判例：英美法系的判例作为正式渊源。
任何判例都在一定程度上消除了语言的模糊性和歧义性，
任何判例都是法官针对具体案件事实对概括的制定法进行解释而得到的一种结果。
最高法、最高检的指导性案例应由各级人民法院参照。</li>
<li>政策：不是指道德或伦理原则，不包括法定政策或法律政策（正式渊源）。
国家政策、中共与国家或政府有关的政策。</li>
</ol>


<ul class="org-ul">
<li>禁止拒绝裁判原则：法官不得以正式渊源没有规定为由拒绝受理案件。
此时有义务适用非正式渊源。</li>
<li>正式渊源不能提供明确答案时适用：
<ul class="org-ul">
<li>正式渊源完全不能提供大前提</li>
<li>正式渊源会造成不正义</li>
<li>正式渊源会产生数种解释而不确定</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org641c96a" class="outline-3">
<h3 id="org641c96a">法律部门与法律体系</h3>
<div class="outline-text-3" id="text-org641c96a">
</div>
<ul class="org-ul">
<li><a id="orga79c3b4"></a>法律部门<br />
<div class="outline-text-4" id="text-orga79c3b4">
<ol class="org-ol">
<li>法律部门——部门法用于调整同一类社会关系。</li>
<li>法律部门名称不需吻合其规范性法律文件。</li>
<li>部门法以调整对象划分。</li>
<li>公法、私法与社会法 乌尔比安
社会法介于公法和私法之间：社会保障法。</li>
<li>公法私法划分标准
<ol class="org-ol">
<li>公共当局主体论
至少有一方是国家或其他公共当局大法的昖法</li>
<li>主从关系论
调整平等地位的主体之间关系的法是私法</li>
<li>强制规范论
公法是强制性规范的总称</li>
<li>利益论
调整公共利益的为公法</li>
<li>折中论
公共当局主体论与主从关系论结合</li>
</ol></li>
</ol>
</div>
</li>
