src/理论法.org
*** 法律体系
1. /一国全部现行/ 法律规范按 /不同法律部门/ 形成的有机整体
2. 七部门三层级
   1. 宪法、民商法、行政法、经济法、社会法、刑法、诉讼与非诉讼程序法
   2. 法律，行政法规，地方性法规自治条例和单行条例
*** 当代中国的七大部门法
**** 宪法
1. 调整国家与公民关系：公法
2. 两类基本规范
   - 构成和组织不同国家机关的规范（授予公权力）
   - 赋予宪法权利的规范（授予公民权利约束公权力）
**** 行政法
1. 宪法的实施和动态部分：公法主要部分
2. 三类行政法
   - 授予行政权的规范
   - 约束行政行为的规范
   - 监督行政行为的规范
3. 行政法是行政法律规范，行政法规是法的正式渊源之一（可能有其他部门法）。
**** 民商法
1. 民法是私法的一般法核心法：私人自治
   商法是私法的特殊法，强调效率和效益
2. 由特殊法优先，商法有规定则优先适用商法
**** 经济法
1. 国家对经济活动进行干预、维护市场秩序的法律，公私相互渗透
2. 两类
   - 创造平等竞争环境，维护市场秩序的法律
     : 反垄断，反不正当竞争
   - 国家宏观调控和经济管理的法律
     : 财政、金融
3. 经济是广泛复杂的，决定了不可能有一部经济法典。
   经济法部门由大量单行法律、法规、规章组成。
**** 社会法
1. 有关劳动关系、社会保障和社会福利关系的法律规范，公私兼具
   社会化的法，保障人的尊严
2. 劳动用工、劳动保护、劳动安全、工资福利、社会公益事业发展和管理、社会保险等
**** 刑法
1. 规定犯罪和刑罚的法律规范，刑法典和刑法修正案
2. 刑法部门的调整方法最严厉
**** 诉讼与非诉讼程序法
1. 民诉、刑诉、行政诉讼法、人民调解法、仲裁法，等等
2. 保证实体法的公正实施
** 法的效力
*** 法的效力的含义
1. 效力即法的约束力，让人们服从法律的力量
2. 来自于法律、道德、社会
*** 法的效力范围
**** 规范性与非规范性
1. 规范性法律文件：对不特定主体反复适用，如民刑法
2. 非规范性法律文件：对特定主体适用，如判决书、合同
**** 对人效力、空间效力与时间效力
1. 对人效力：适用于哪些人，四个原则：
   1) 属人主义：只适用本国公民
      : 我只管我的人，不管他们去了谁的地盘
      : 外国人即使在我的地盘上我也不管
   2) 属地主义：适用于管辖地区内的所有人
      : 我只管我的地盘，谁在我地盘上都要服我管
      : 如果我的人不在我地盘上，我就不管
   3) 保护主义：任何侵害本国利益的人都要受到追究
      : 虽远必诛
   4) 原则是属地主义为主、属人主义、保护主义相结合。
      “沾边就管”
2. 空间效力：一国法律适用于该国主权范围所及的全部领域。
3. 时间效力
   1) 生效时间
      - 自法律公布之日起生效
      - 该法律规定其具体生效时间
      - 法律公布后符合一定条件时生效
   2) 终止生效：明示的废止、默示的废止
   3) 法的溯及力：能否管到法律生效前的行为
      - 法律不溯及既往原则
      - 有利原则：从旧兼从轻
      - 在某些有关战争、基本人权和民事权利的法律中，法律有溯及力。
** 法律关系
*** 法律关系的概念
- 性质和特征
  1. 法律关系是根据 /法律规范/ 建立的社会关系
     没有法律规范就没有法律关系，例如婚姻法
  2. 法律关系体现意志性，破坏法律关系即违背国家意志
  3. 法律关系是 /特定法律关系主体/ 之间的权利义务关系
- 种类：四个分类方式
  1. 调整性：因主体间合法行为产生（买卖关系）不受制裁
     保护性：因主体间违法行为产生（抢劫关系）应受制裁
  2. 横向平权：主体间地位平等（合同）
     纵向隶属：主体间地位不平等（行政处罚）
  3. 单向：权利人仅享权利、义务人仅享义务（赠与关系）
     双向：一方权利对应一方义务（买卖）
     多向：3个或 3 个以上相关法律关系（行政人事调动）
  4. 第一性主：处于支配地位的法律关系（债法）
     第二性从：由第一性法律产生的法律关系（债法触发诉讼法）
     一切相关的法律关系均有主次之分。
  
*** 法律关系的主体
- 法律关系主体有以下几种：
  1. 公民（自然人），包括中国公民、境内居住外国公民和无国籍人
  2. 机构和组织（法人）：国家机关、企事业组织和外资企业、政党和社会团体
  3. 国家：国家机关或授权的组织代表国家，或作为一个整体成为主体
- 权利能力和行为能力
  1. 权利能力/权义能力
     能参与一定的法律关系、享有一定权利承担一定义务的法律资格。
     1) 一般权利能力和特殊权利能力（如国家机关行使职权）
     2) 民事权利能力、政治权利能力、等等细分。
  2. 行为能力
     主体能通过自己的行为取得权利履行义务的能力。
     1) 公民行为能力有完全与不完全之分，法人的行为能力总是有限的。
     2) 公民有权利能力不等于有行为能力，反之亦然。
        法人的行为能力和权利能力同时产生、同时消灭。
*** 法律关系的内容
法律关系主体之间的法律权利和法律义务。
与法律规范规定的权利义务不同，前者是正在履行的、适用且仅适用于有关主体。
后者是有待实现的，适用于不特定主体。
*** 法律关系的客体
法律关系主体之间的权利义务指向的对象。
包括：物、人身、精神产品、行为后果。
*** 法律关系的产生变更和消灭的条件
两个条件：法律规范，法律事实。
法律事实由法律规范规定、引起法律关系产生变更和消灭。包括两类：
- 法律行为：意思表示，作为与不作为
- 法律事件：客观事实，天灾人祸等，不以人的意志转移
** 法律责任
*** 法律责任的概念
- 法律责任的概念
  即行为应当承担的法律上的不利后果，
  包括违法和违约引起的过错责任以及法律特别规定引起的无过错责任。
- 法律责任的特征：法定性、国家强制性。
- 法律责任的本质
  1) 道义责任论：责任以道义为前提，本质是对违法者的道义责难。
  2) 社会责任论：社会作为利益互动系统，本质是对合法利益系统的维护。
  3) 规范责任论：法律作为规范系统，本质是对行为的否定性规范评价。
- 法律责任与权力权利义务的关系
  1) 权力：（1）责任通过权力落实（2）责任约束权力行使
  2) 权利义务：（1）权利义务先于责任（2）责任是权利义务成为事实的保证


*** 法律责任的竞合
- 法律责任的竞合
  一个法律行为同时引起两种以上彼此冲突的法律责任
  三个特征：（1）数个法律责任的主体为同一主体
  （2）责任主体实施了一个行为（一个事实）（3）数个法律责任之间相互冲突
  择一重责。
- 竞合发生的原因
  （1）法中存在不同类型的法律责任
  （2）某法同时符合两个以上的构成要件
  （3）该行为产生多种后果

*** 归责与免责
- 归责原则
  1. 责任法定原则
     须明确规定责任、以实体法和程序法追责、禁止擅断责任和法外责罚
  2. 公正原则
     法律面前人人平等，定性与定量公正
  3. 效益原则
     追求法律责任效益最大化，法律有威慑且责任适度。
  4. 责任自负
     谁违法谁负责，反对株连（例外：连带责任）
     违法责任应追究，无责必不被追究
     独立主体自主选择行为，自己承担后果。
- 免责条件
  1. 分为法定免除条件和意定免除条件
     即公法上的免除条件和私法上的免除条件。
  2. 我国六个免除条件
     1) 不诉免责
     2) 时效免责
     3) 自愿协议免费
     4) 自首立功免责
     5) 正当防卫紧急避险不可抗力免责
     6) 人道主义免责
*** 法律制裁
特定国家机关对违法者依其法律责任而实施的强制性惩罚措施。
法律责任可以 /补偿/ 承担，否则以 /惩罚/ 方式承担，进入法律制裁。
* 法的运行
** 法的制定和法的实施（宏观的法的运行）
*** 法的制定（立法）
1. 立法的定义
   - 制定修改废止规范性法律文件
   - 第一次分配
   - 立法权：国家权力体系最重要、最核心的权力
   - 狭义立法：最高权力机关及常设机关的立法活动
2. 立法体制
   主要是立法权限的划分。分为一元制、二元制。
   我国立法体制是 /中央统一领导、一定程度分权、多级并存、多类结合。/
   1) 最重要的立宪权和立法权属于中央
      整个立法由中央和地方多方面行使。
   2) 多级并存即存在不同主体制定法律、有效力高低之分
      多类结合即多个国家机关享有相应的立法权，产生各类不同的法律文件。
3. 立法原则
   合宪性与合法性、科学立法、民主立法，（依法立法）
4. 立法程序
   1) 法律议案的提出
      享有法律议案提案权的机关或个人向立法机关提出制定修改废止法律正式提案。
   2) 法律案审议：三种可能的结果为提付表决、搁置、终止审议。
   3) 法律的表决和通过
      公开表决：举手表决、起立表决、口头表决、行进表决、记名投票表决
      : 行进表决：同意的往前走一步
      秘密表决：无记名投票
   4) 法律的公布（两报一网）
      全国人大常委会公报（标准文本）、中国人大网等。
5. 立法技术
   1) 预测技术（立法的后果）
   2) 规划技术（立法计划）
   3) 表达技术（法律规范术语）
   4) 以上技术体现在《立法法》等中。
*** 法的实施
1. 法的实施与法的实现
   包括执法、司法、守法和法律监督等环节。
2. 司法与执法的区别
   司法是司法机关的严格法律适用，只在案件发生时实现。（被动性）
   执法是国家行政机关对社会的全面管理、是持续发生且主动的。
   司法公正、司法平等、司法合法、司法机关独立行使职权、司法责任
3. 守法
   全体人民守法。分消极守法与积极守法。
   积极守法：行义务
   消极守法：不违法
4. 法律监督
   狭义：特定国家机关对立法司法执法的合法性监督。
   广义：所有国家机关社会组织和公民对各种法律活动的合法性监督。
   主体和对象：所有国家机关、政党、社会团体、社会组织、大众传媒和公民
   内容：监督对象行为合法性
   依据、方式：宪法和法律
   按主体分为国家法律监督和社会法律监督。
   只有国家机关才能进行国家法律监督。
** 法适用的一般原理与法律证成
*** 法适用的目标
法的适用即司法。司法的目标是为了得到一个 /合理的法律决定/ 。
1. 合理的法律决定具有可预测性和正当性。应严格依法、不能缺德。
2. 可预测性与正当性之间存在一定的 /紧张关系/ 。
   这是形式法治与实质法治之间的紧张关系的体现。
   正当性是主观的，人人不一样的。
3. 首先理当崇尚法律的 /可预测性/ 。
*** 法适用的步骤
1. 具体步骤
   确认案件事实（小前提），寻找法律规范（大前提），推导法律决定（结论）
2. 实际法律活动，这三步具有融合性，在规范与事实之间来回确认。
3. 必须以该国的整个法律体系为基础，掌握法律字面含义和背后含义。
*** 内部证成与外部证成的区分
法律证成是指给一个决定提供充足理由的活动或者过程。
- 内部证成：从相关前提逻辑地推导出法律决定。
- 外部证成：对法律决定依赖的前提的证成。

外部证成是证明条件的成立，保证内部证成前提正当。
** 法律解释
*** 法律解释的含义与特点
1. 对法律语言文字的意义揭示、说明和选择的活动。
2. 特点
   - 对象特定
   - 与具体案件相关
   - 实践性、目的性（应然的证成）
