public_html/理论法.html
<li><a id="orge3eb20c"></a>法律体系<br />
<div class="outline-text-4" id="text-orge3eb20c">
<ol class="org-ol">
<li><i>一国全部现行</i> 法律规范按 <i>不同法律部门</i> 形成的有机整体</li>
<li>七部门三层级
<ol class="org-ol">
<li>宪法、民商法、行政法、经济法、社会法、刑法、诉讼与非诉讼程序法</li>
<li>法律，行政法规，地方性法规自治条例和单行条例</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org7827423"></a>当代中国的七大部门法<br />
<ul class="org-ul">
<li><a id="org6d9b3b4"></a>宪法<br />
<div class="outline-text-5" id="text-org6d9b3b4">
<ol class="org-ol">
<li>调整国家与公民关系：公法</li>
<li>两类基本规范
<ul class="org-ul">
<li>构成和组织不同国家机关的规范（授予公权力）</li>
<li>赋予宪法权利的规范（授予公民权利约束公权力）</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org882aa20"></a>行政法<br />
<div class="outline-text-5" id="text-org882aa20">
<ol class="org-ol">
<li>宪法的实施和动态部分：公法主要部分</li>
<li>三类行政法
<ul class="org-ul">
<li>授予行政权的规范</li>
<li>约束行政行为的规范</li>
<li>监督行政行为的规范</li>
</ul></li>
<li>行政法是行政法律规范，行政法规是法的正式渊源之一（可能有其他部门法）。</li>
</ol>
</div>
</li>
<li><a id="orgadc208b"></a>民商法<br />
<div class="outline-text-5" id="text-orgadc208b">
<ol class="org-ol">
<li>民法是私法的一般法核心法：私人自治
商法是私法的特殊法，强调效率和效益</li>
<li>由特殊法优先，商法有规定则优先适用商法</li>
</ol>
</div>
</li>
<li><a id="org4ecd426"></a>经济法<br />
<div class="outline-text-5" id="text-org4ecd426">
<ol class="org-ol">
<li>国家对经济活动进行干预、维护市场秩序的法律，公私相互渗透</li>
<li>两类
<ul class="org-ul">
<li><p>
创造平等竞争环境，维护市场秩序的法律
</p>
<pre class="example">
反垄断，反不正当竞争
</pre></li>
<li><p>
国家宏观调控和经济管理的法律
</p>
<pre class="example">
财政、金融
</pre></li>
</ul></li>
<li>经济是广泛复杂的，决定了不可能有一部经济法典。
经济法部门由大量单行法律、法规、规章组成。</li>
</ol>
</div>
</li>
<li><a id="org395a331"></a>社会法<br />
<div class="outline-text-5" id="text-org395a331">
<ol class="org-ol">
<li>有关劳动关系、社会保障和社会福利关系的法律规范，公私兼具
社会化的法，保障人的尊严</li>
<li>劳动用工、劳动保护、劳动安全、工资福利、社会公益事业发展和管理、社会保险等</li>
</ol>
</div>
</li>
<li><a id="org9561efe"></a>刑法<br />
<div class="outline-text-5" id="text-org9561efe">
<ol class="org-ol">
<li>规定犯罪和刑罚的法律规范，刑法典和刑法修正案</li>
<li>刑法部门的调整方法最严厉</li>
</ol>
</div>
</li>
<li><a id="org66de41a"></a>诉讼与非诉讼程序法<br />
<div class="outline-text-5" id="text-org66de41a">
<ol class="org-ol">
<li>民诉、刑诉、行政诉讼法、人民调解法、仲裁法，等等</li>
<li>保证实体法的公正实施</li>
</ol>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orge060e59" class="outline-3">
<h3 id="orge060e59">法的效力</h3>
<div class="outline-text-3" id="text-orge060e59">
</div>
<ul class="org-ul">
<li><a id="orge7b6776"></a>法的效力的含义<br />
<div class="outline-text-4" id="text-orge7b6776">
<ol class="org-ol">
<li>效力即法的约束力，让人们服从法律的力量</li>
<li>来自于法律、道德、社会</li>
</ol>
</div>
</li>
<li><a id="org76c97c5"></a>法的效力范围<br />
<ul class="org-ul">
<li><a id="org720864d"></a>规范性与非规范性<br />
<div class="outline-text-5" id="text-org720864d">
<ol class="org-ol">
<li>规范性法律文件：对不特定主体反复适用，如民刑法</li>
<li>非规范性法律文件：对特定主体适用，如判决书、合同</li>
</ol>
</div>
</li>
<li><a id="orgc3b3f26"></a>对人效力、空间效力与时间效力<br />
<div class="outline-text-5" id="text-orgc3b3f26">
<ol class="org-ol">
<li>对人效力：适用于哪些人，四个原则：
<ol class="org-ol">
<li><p>
属人主义：只适用本国公民
</p>
<pre class="example">
我只管我的人，不管他们去了谁的地盘
外国人即使在我的地盘上我也不管
</pre></li>
<li><p>
属地主义：适用于管辖地区内的所有人
</p>
<pre class="example">
我只管我的地盘，谁在我地盘上都要服我管
如果我的人不在我地盘上，我就不管
</pre></li>
<li><p>
保护主义：任何侵害本国利益的人都要受到追究
</p>
<pre class="example">
虽远必诛
</pre></li>
<li>原则是属地主义为主、属人主义、保护主义相结合。
“沾边就管”</li>
</ol></li>
<li>空间效力：一国法律适用于该国主权范围所及的全部领域。</li>
<li>时间效力
<ol class="org-ol">
<li>生效时间
<ul class="org-ul">
<li>自法律公布之日起生效</li>
<li>该法律规定其具体生效时间</li>
<li>法律公布后符合一定条件时生效</li>
</ul></li>
<li>终止生效：明示的废止、默示的废止</li>
<li>法的溯及力：能否管到法律生效前的行为
<ul class="org-ul">
<li>法律不溯及既往原则</li>
<li>有利原则：从旧兼从轻</li>
<li>在某些有关战争、基本人权和民事权利的法律中，法律有溯及力。</li>
</ul></li>
</ol></li>
</ol>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orge27490b" class="outline-3">
<h3 id="orge27490b">法律关系</h3>
<div class="outline-text-3" id="text-orge27490b">
</div>
<ul class="org-ul">
<li><a id="org3c0c439"></a>法律关系的概念<br />
<div class="outline-text-4" id="text-org3c0c439">
<ul class="org-ul">
<li>性质和特征
<ol class="org-ol">
<li>法律关系是根据 <i>法律规范</i> 建立的社会关系
没有法律规范就没有法律关系，例如婚姻法</li>
<li>法律关系体现意志性，破坏法律关系即违背国家意志</li>
<li>法律关系是 <i>特定法律关系主体</i> 之间的权利义务关系</li>
</ol></li>
<li>种类：四个分类方式
<ol class="org-ol">
<li>调整性：因主体间合法行为产生（买卖关系）不受制裁
保护性：因主体间违法行为产生（抢劫关系）应受制裁</li>
<li>横向平权：主体间地位平等（合同）
纵向隶属：主体间地位不平等（行政处罚）</li>
<li>单向：权利人仅享权利、义务人仅享义务（赠与关系）
双向：一方权利对应一方义务（买卖）
多向：3个或 3 个以上相关法律关系（行政人事调动）</li>
<li>第一性主：处于支配地位的法律关系（债法）
第二性从：由第一性法律产生的法律关系（债法触发诉讼法）
一切相关的法律关系均有主次之分。</li>
</ol></li>
</ul>
</div>
</li>
<li><a id="orgfae115c"></a>法律关系的主体<br />
<div class="outline-text-4" id="text-orgfae115c">
<ul class="org-ul">
<li>法律关系主体有以下几种：
<ol class="org-ol">
<li>公民（自然人），包括中国公民、境内居住外国公民和无国籍人</li>
<li>机构和组织（法人）：国家机关、企事业组织和外资企业、政党和社会团体</li>
<li>国家：国家机关或授权的组织代表国家，或作为一个整体成为主体</li>
</ol></li>
<li>权利能力和行为能力
<ol class="org-ol">
<li>权利能力/权义能力
能参与一定的法律关系、享有一定权利承担一定义务的法律资格。
<ol class="org-ol">
<li>一般权利能力和特殊权利能力（如国家机关行使职权）</li>
<li>民事权利能力、政治权利能力、等等细分。</li>
</ol></li>
<li>行为能力
主体能通过自己的行为取得权利履行义务的能力。
<ol class="org-ol">
<li>公民行为能力有完全与不完全之分，法人的行为能力总是有限的。</li>
<li>公民有权利能力不等于有行为能力，反之亦然。
法人的行为能力和权利能力同时产生、同时消灭。</li>
</ol></li>
</ol></li>
</ul>
</div>
</li>
<li><a id="orga090f45"></a>法律关系的内容<br />
<div class="outline-text-4" id="text-orga090f45">
<p>
法律关系主体之间的法律权利和法律义务。
与法律规范规定的权利义务不同，前者是正在履行的、适用且仅适用于有关主体。
后者是有待实现的，适用于不特定主体。
</p>
</div>
</li>
<li><a id="orgab49f10"></a>法律关系的客体<br />
<div class="outline-text-4" id="text-orgab49f10">
<p>
法律关系主体之间的权利义务指向的对象。
包括：物、人身、精神产品、行为后果。
</p>
</div>
</li>
<li><a id="org78e2820"></a>法律关系的产生变更和消灭的条件<br />
<div class="outline-text-4" id="text-org78e2820">
<p>
两个条件：法律规范，法律事实。
法律事实由法律规范规定、引起法律关系产生变更和消灭。包括两类：
</p>
<ul class="org-ul">
<li>法律行为：意思表示，作为与不作为</li>
<li>法律事件：客观事实，天灾人祸等，不以人的意志转移</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org6e97dff" class="outline-3">
<h3 id="org6e97dff">法律责任</h3>
<div class="outline-text-3" id="text-org6e97dff">
</div>
<ul class="org-ul">
<li><a id="org3330ef9"></a>法律责任的概念<br />
<div class="outline-text-4" id="text-org3330ef9">
<ul class="org-ul">
<li>法律责任的概念
即行为应当承担的法律上的不利后果，
包括违法和违约引起的过错责任以及法律特别规定引起的无过错责任。</li>
<li>法律责任的特征：法定性、国家强制性。</li>
<li>法律责任的本质
<ol class="org-ol">
<li>道义责任论：责任以道义为前提，本质是对违法者的道义责难。</li>
<li>社会责任论：社会作为利益互动系统，本质是对合法利益系统的维护。</li>
<li>规范责任论：法律作为规范系统，本质是对行为的否定性规范评价。</li>
</ol></li>
<li>法律责任与权力权利义务的关系
<ol class="org-ol">
<li>权力：（1）责任通过权力落实（2）责任约束权力行使</li>
<li>权利义务：（1）权利义务先于责任（2）责任是权利义务成为事实的保证</li>
</ol></li>
</ul>
</div>
</li>
<li><a id="org82cbbbb"></a>法律责任的竞合<br />
<div class="outline-text-4" id="text-org82cbbbb">
<ul class="org-ul">
<li>法律责任的竞合
一个法律行为同时引起两种以上彼此冲突的法律责任
三个特征：（1）数个法律责任的主体为同一主体
（2）责任主体实施了一个行为（一个事实）（3）数个法律责任之间相互冲突
择一重责。</li>
<li>竞合发生的原因
（1）法中存在不同类型的法律责任
（2）某法同时符合两个以上的构成要件
（3）该行为产生多种后果</li>
</ul>
</div>
</li>
<li><a id="org0f5a90c"></a>归责与免责<br />
<div class="outline-text-4" id="text-org0f5a90c">
<ul class="org-ul">
<li>归责原则
<ol class="org-ol">
<li>责任法定原则
须明确规定责任、以实体法和程序法追责、禁止擅断责任和法外责罚</li>
<li>公正原则
法律面前人人平等，定性与定量公正</li>
<li>效益原则
追求法律责任效益最大化，法律有威慑且责任适度。</li>
<li>责任自负
谁违法谁负责，反对株连（例外：连带责任）
违法责任应追究，无责必不被追究
独立主体自主选择行为，自己承担后果。</li>
</ol></li>
<li>免责条件
<ol class="org-ol">
<li>分为法定免除条件和意定免除条件
即公法上的免除条件和私法上的免除条件。</li>
<li>我国六个免除条件
<ol class="org-ol">
<li>不诉免责</li>
<li>时效免责</li>
<li>自愿协议免费</li>
<li>自首立功免责</li>
<li>正当防卫紧急避险不可抗力免责</li>
<li>人道主义免责</li>
</ol></li>
</ol></li>
</ul>
</div>
</li>
<li><a id="org6a099ac"></a>法律制裁<br />
<div class="outline-text-4" id="text-org6a099ac">
<p>
特定国家机关对违法者依其法律责任而实施的强制性惩罚措施。
法律责任可以 <i>补偿</i> 承担，否则以 <i>惩罚</i> 方式承担，进入法律制裁。
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org052acd9" class="outline-2">
<h2 id="org052acd9">法的运行</h2>
<div class="outline-text-2" id="text-org052acd9">
</div>
<div id="outline-container-orgfbc53a1" class="outline-3">
<h3 id="orgfbc53a1">法的制定和法的实施（宏观的法的运行）</h3>
<div class="outline-text-3" id="text-orgfbc53a1">
</div>
<ul class="org-ul">
<li><a id="org57c6ee9"></a>法的制定（立法）<br />
<div class="outline-text-4" id="text-org57c6ee9">
<ol class="org-ol">
<li>立法的定义
<ul class="org-ul">
<li>制定修改废止规范性法律文件</li>
<li>第一次分配</li>
<li>立法权：国家权力体系最重要、最核心的权力</li>
<li>狭义立法：最高权力机关及常设机关的立法活动</li>
</ul></li>
<li>立法体制
主要是立法权限的划分。分为一元制、二元制。
我国立法体制是 <i>中央统一领导、一定程度分权、多级并存、多类结合。</i>
<ol class="org-ol">
<li>最重要的立宪权和立法权属于中央
整个立法由中央和地方多方面行使。</li>
<li>多级并存即存在不同主体制定法律、有效力高低之分
多类结合即多个国家机关享有相应的立法权，产生各类不同的法律文件。</li>
</ol></li>
<li>立法原则
合宪性与合法性、科学立法、民主立法，（依法立法）</li>
<li>立法程序
<ol class="org-ol">
<li>法律议案的提出
享有法律议案提案权的机关或个人向立法机关提出制定修改废止法律正式提案。</li>
<li>法律案审议：三种可能的结果为提付表决、搁置、终止审议。</li>
<li><p>
法律的表决和通过
公开表决：举手表决、起立表决、口头表决、行进表决、记名投票表决
</p>
<pre class="example">
行进表决：同意的往前走一步
</pre>

<p>
秘密表决：无记名投票
</p></li>
<li>法律的公布（两报一网）
全国人大常委会公报（标准文本）、中国人大网等。</li>
</ol></li>
<li>立法技术
<ol class="org-ol">
<li>预测技术（立法的后果）</li>
<li>规划技术（立法计划）</li>
<li>表达技术（法律规范术语）</li>
<li>以上技术体现在《立法法》等中。</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org0b6dd1c"></a>法的实施<br />
<div class="outline-text-4" id="text-org0b6dd1c">
<ol class="org-ol">
<li>法的实施与法的实现
包括执法、司法、守法和法律监督等环节。</li>
<li>司法与执法的区别
司法是司法机关的严格法律适用，只在案件发生时实现。（被动性）
执法是国家行政机关对社会的全面管理、是持续发生且主动的。
司法公正、司法平等、司法合法、司法机关独立行使职权、司法责任</li>
<li>守法
全体人民守法。分消极守法与积极守法。
积极守法：行义务
消极守法：不违法</li>
<li>法律监督
狭义：特定国家机关对立法司法执法的合法性监督。
广义：所有国家机关社会组织和公民对各种法律活动的合法性监督。
主体和对象：所有国家机关、政党、社会团体、社会组织、大众传媒和公民
内容：监督对象行为合法性
依据、方式：宪法和法律
按主体分为国家法律监督和社会法律监督。
只有国家机关才能进行国家法律监督。</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orge81d9f8" class="outline-3">
<h3 id="orge81d9f8">法适用的一般原理与法律证成</h3>
<div class="outline-text-3" id="text-orge81d9f8">
</div>
<ul class="org-ul">
<li><a id="org683c0c0"></a>法适用的目标<br />
<div class="outline-text-4" id="text-org683c0c0">
<p>
法的适用即司法。司法的目标是为了得到一个 <i>合理的法律决定</i> 。
</p>
<ol class="org-ol">
<li>合理的法律决定具有可预测性和正当性。应严格依法、不能缺德。</li>
<li>可预测性与正当性之间存在一定的 <i>紧张关系</i> 。
这是形式法治与实质法治之间的紧张关系的体现。
正当性是主观的，人人不一样的。</li>
<li>首先理当崇尚法律的 <i>可预测性</i> 。</li>
</ol>
</div>
</li>
<li><a id="orga4e045a"></a>法适用的步骤<br />
<div class="outline-text-4" id="text-orga4e045a">
<ol class="org-ol">
<li>具体步骤
确认案件事实（小前提），寻找法律规范（大前提），推导法律决定（结论）</li>
<li>实际法律活动，这三步具有融合性，在规范与事实之间来回确认。</li>
<li>必须以该国的整个法律体系为基础，掌握法律字面含义和背后含义。</li>
</ol>
</div>
</li>
<li><a id="org4d3fa13"></a>内部证成与外部证成的区分<br />
<div class="outline-text-4" id="text-org4d3fa13">
<p>
法律证成是指给一个决定提供充足理由的活动或者过程。
</p>
<ul class="org-ul">
<li>内部证成：从相关前提逻辑地推导出法律决定。</li>
<li>外部证成：对法律决定依赖的前提的证成。</li>
</ul>

<p>
外部证成是证明条件的成立，保证内部证成前提正当。
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgb3a7271" class="outline-3">
<h3 id="orgb3a7271">法律解释</h3>
<div class="outline-text-3" id="text-orgb3a7271">
</div>
<ul class="org-ul">
<li><a id="org2e23531"></a>法律解释的含义与特点<br />
<div class="outline-text-4" id="text-org2e23531">
<ol class="org-ol">
<li>对法律语言文字的意义揭示、说明和选择的活动。</li>
<li>特点
<ul class="org-ul">
<li>对象特定</li>
<li>与具体案件相关</li>
<li>实践性、目的性（应然的证成）</li>
</ul></li>
</ol>
</div>
</li>
