src/理论法.org
*** 法律解释的种类：正式解释与非正式解释
1. 正式解释（法定解释、有权解释）
   具有法律上约束力的解释，来自立法、司法和行政解释
   比如一个特定的法学家团体的解释作为法定解释。
2. 非正式解释（学理解释）
   不具有法律约束力的解释

所有法律都是可以解释的。
*** 法律解释的方法与位阶
法律解释的方法是约定俗成的。
1. 文义（语法、文法、文理）解释。字面解释法条
2. 体系（逻辑、系统）解释。把法条放在整部法律、整个法律体系中理解其含义。
3. 立法者（主观）的目的解释。依据立法资料，尊重立法人的意志。
4. 历史解释。依据历史事实。
5. 比较解释。依据外国判例和判例学说。
6. 客观目的解释。依据社会共同伦理道德需要，让社会满意的解释。
运用不同解释方法可能得出完全不同的解释结果，因此使用不同立法解释方法的位阶。
这一位阶并不固定。有可能直接采用客观目的解释。
*** 当代中国的法律解释体制
/一元多级/ 的法律解释体制。
一元：法律解释权属于全国人大常委会。
多级：存在其他类型的法定法律解释。
1. 法律本身需要明确或补充的，全国人大常委会进行解释
2. 法院具体应用法律的问题，最高法进行解释
3. 检察院具体应用法律的问题，最高检进行解释
4. 非审判和检察工作中具体应用法律的问题，国务院及其主管部门进行解释
5. 地方性法规条文本身需要明确或补充的，制定的省区市人大常委会进行解释
   地方性法规具体应用的问题，省市区人民政府主管部门进行解释
** 法律推理
从一定的前提推导出法律决定的过程中，必须遵循的推论规则。
1. 法律推理以法律以及法学中的理或理由为基础
2. 法律推理受现行法律的约束
3. 法律推理是一种寻求正当性证明的推理


- 演绎推理
  三段论，现行法律拘束
- 归纳推理
  不完全归纳推理
- 类比推理
  相似性论证，类比先例
- 反向推理
  从法条适用的情形推断出不适用法条的情形
- 当然推理
  若较强的规范有效，则较弱的规范更加有效。
  举轻以明重，举重以明轻
  依赖于实质判断。
- 设证推理
  从事实推定出前提。经验推定与规范推定

** 法律漏洞的填补
*** 法律漏洞的概念
1. 法律漏洞违反了立法计划（立法目的）。
2. 法律漏洞性质：属于法内空间，是法律不合目的的缺失状态。
3. 产生原因：立法者的理性有限，且“禁止拒绝裁判原则”
4. 判断：确定立法计划或规范目的，使用历史解释和目的论解释
*** 法律漏洞的分类
1. 是否规定
   - 全部漏洞：一方面的法律没有任何规定
   - 部分漏洞：己规定但不完全
2. 表现形态
   - 明显漏洞：应积极规定却未规定
   - 隐藏漏洞：己规定但没有对应设例外做规定
3. 产生时间
   - 自始漏洞（法律制定时己经存在）
     明知漏洞：有意将漏洞保留给其他主体解释
     不明知漏洞：疏忽、认知限制、误认己规定
   - 嗣后漏洞（法律制定、实施后产生）因为法律相对于社会现实的滞后
*** 法律漏洞的填补方法
目的论扩张解决明显漏洞（词不达意），涵盖案件；
目的论收缩解决隐藏漏洞（言过其实），排除案件。
目的论扩张或收缩不是扩张解释或限缩解释。
* 法的演进和法与社会
** 法的起源
*** 法的起源的各种学说及其与法的本质学说的关系
1. 神创说：神学政治的奥古斯丁
2. 暴力说：法家的荀子
3. 契约说：17、18 世纪古典自然法学者
4. 发展说：人的能力发展需要和精神发展产生了法。黑格尔、萨维尼
5. 合理管理说：基于社会的合理性管理需要。法社会学家
6. 马克思主义法学：法起源于一定社会经济基础。
   法是随着生产力的发展、社会经济的发展、私有制和阶级的产生、国家的出现而产生的
   法的起源的各种学说与法的本质学说之间存在内在的一致和对应的关系。

*** 法产生的一般规律
1. 个别调整到规范性调整
   一般规范性调整到法的调整
2. 习惯到习惯法再到制定法
3. 法与宗教规范、道德规范的浑然一体到法与二者分离、相对独立地发展
** 法的发展与传统
*** 法的发展
1. 法的历史类型
   奴隶制法、封建制法、资本主义法、社会主义法
   : 身份到契约的运动（梅因）不合理走向合理、实质理性走向形式理性（韦伯）
2. 法的继承与法的移植
   - 法的继承：不同历史时代的法律制度之间的延续和继受
   - 法的移植：一国对同时代其他国家、地区和国际法律制度的吸收和借鉴
   : 1804 法国民法典继承了古罗马法
   : 1900 德国民法典继承了古罗马法和日耳曼法
*** 法的传统
1. 法的传统是指特定国家和民族世代相传、辗转相承的有关法的 /观念+制度/ 的总和。
2. 法律意识延续法律传统。前者包括法律心理和法律思想（论文、著作）
3. 中国和西方的传统法律文化
   1) 中华法系
      | 礼法结合、德主刑辅 | 等级有序、家庭本位 |
      | 以刑为主、民刑不分 | 重视调解、无讼是求 |
   2) 西方法律传统文化
      | 法律受宗教影响较大     |
      | 强调个体的价值和地位   |
      | 私法文化相对发达       |
      | 以正义为法律的价值取向 |
*** 法系
1. /凡属同一传统/ 的法律就构成一个法系。
   : 大陆法系、英美法系、伊斯兰法系、中华法系、印度法系
   : 威格摩尔五大法系
2. 民法法系和普通法系
   1) 民法法系（大陆法系、罗马德意志法系、法典法系）
      基于古罗马法、《法国民法典》。分法国法和德国法
   2) 普通法系（普通法法系、英国法系、判例法系、英美法系）
      基于英国普通法、以判例法为法的主要表现形式。分英国法和美国法
   : 大陆法系、英美法系、伊斯兰法系是活法系、其余为死法系。
** 法的现代化
*** 法的现代化的标志
1. 现代化源于工业化、法的现代化指法的现代性因素不断增加。
2. 法的现代化的四个内涵：
   1) 法与道德分离
   2) 法的形式化
   3) 对现代价值的体现和保护
   4) 法具有形式合理性
      形式先行，不以实质合理为核心
3. 现代化的类型
   1) 内发型：自下而上，缓慢渐进（英国等）
   2) 外源型：自上而下，迅速突然（日本、印度、俄国）
*** 当代中国的法的现代化
以 1902 收回领事裁判权为契机，外源性的法的现代化（清末修律）
1) 被动接受到主动选择
2) 模仿民法法系到建立有中国特色的社会主义法律制度
3) 启动形式：立法主导型
   司法主导型：如英美法系
4) 法律制度变革在前、法律观念更新在后，斗争激烈
** 法与社会、经济、政治、道德、宗教
*** 法与社会的一般理论
1. 法以社会为基础，社会物质条件最终决定法律的本质
2. 法对社会调整，首先通过调和社会各种冲突的利益来实现
   法律不是万能的，某些社会领域中法律控制不是唯一或最佳手段
   : 法律暴政：否定其他选项，固守一隅
*** 法与经济
1. 法由经济基础决定，法不得不服从经济条件
2. 法与科学技术
   - 科技对法律提出了新问题
     事实认定、法律适用和法律推理受现代科学技术影响
   - 运用法律管理科技活动
     积极促进科技经济一体化，科技成果商品化
*** 法与政治
1. 法与政治都属于上层建筑，两者相互作用、相辅相成。
2. 法与政策
   法与执政党政策在内容和实质方面存在联系，也有很大区别。
3. 法与国家
   法与国家权力构成相互依存、相互支撑的关系，也存在紧张或冲突关系。
   近现代法治的实质和精义在于控权，对权力在形式和实质上的合法性的强调。
*** 法与道德
1. 法与道德的联系
   - 本质与必然联系：肯定说的自然法、否定说的分析实证主义法学派
   - 内容上联系：近代以前重合度极高，近现代“法律是最低限度的道德”
   - 功能上联系：古代强调道德的主要地位，近现代强调法律调整的突出作用
2. 法与道德的区别
   1) 生成方式：法是自觉建构的人造物、道德是自发和非建构的
   2) 表现形式：法以国家机关规范性文件表现、道德存在于内心的舆论
   3) 调整范围：道德调整范围与法律广、比法律深
   4) 内容结构：法律明确而具体、道德则无特定具体形式
   5) 实施方式：法以国家强制度形成外在强制、道德靠信念和舆论得以实施
*** 法与宗教
1. 宗教推动立法、影响司法、提高守法自觉性。反过来也会妨碍司法公正
2. 法对宗教的影响
   1) 政教合一的国家里，法可以保护国教、破坏异教
   2) 近现代政教分离而国家里，法对宗教之争持中立态度，保障宗教信仰自由
   3) 法对本国宗教政策的规定。中国现行宗教政策
      宗教信仰自由、加强宗教事务管理、积极引导宗教与社会主义建设相结合
* 宪法基本理论
** 宪法概述
1. 宪法词源与用法
   国家根本法的定义在 19 世纪 80 年代。见郑观应《盛世危言》
   “宪法”与“法律”并用：
   “本宪法以法律的形式确认了中国各族人民奋斗的成果”中“法律”指广义法律规范
2. 宪法的基本特征
   1) 内容上，规定一个国家最根本最核心的问题
   2) 法律效力上，具有最高法律效力
      - 宪法是制定普通法律的依据
      - 任何普通法律不得与宪法的内容原则和精神相违背
      - 宪法是一切国家机关社会团体和全体公民的最高行为准则
   3) 制定和修改上，宪法比普通法律更加严格
      须由全国人大常委或 1/5 以上全国人大代表提议，
      由全国人大 2/3 以上绝对多数通过。
      : 对比普通法律只需要 30 名以上人大代表提议，1/2 相对多数通过。
   4) 宪法是公民权利的保障书，是民主事实法律化的基本形式。
      : 如 1918 苏俄宪法、1919 魏玛宪法。确认保障民主事实
3. 宪法的概念和本质
   规定国家的根本制度和根本任务、集中体现各政治力量对比关系、保障公民基本权力
4. 宪法的分类
   - 英国学者蒲莱士提出的两套标准
     + 成文与不成文宪法（是否具有统一的法典形式）
       * 1787 美国宪法（第一部成文宪法）,1791 法国宪法（大陆第一部成文宪法）
         社会契约论推动形成成文宪法。
       * 英国、新西兰、以色列、沙特阿拉伯等不成文宪法。如英国：
         - 宪法惯例、宪法判例
         - 1628《权利请愿书》1679《人身保护法》1689《权利法案》
         - 1701《王位继承法》1911《国会法》1918《国民参政法》
         - 1928《男女选举平等法》1969《人民代表法》等宪法性文件
     + 刚性与柔性宪法（效力及制定，修改）
       成文宪法国家往往是刚性宪法的国家，反之亦然。
   - 民定、钦定、协定宪法
     + 民定宪法由民意机关或全民公决制定。 /法国 1793 宪法/ （罗伯斯庇尔，雅各宾派）
     + 钦定宪法由君主或以君主名义制定和颁布。
       /法国 1814 宪法/ （波旁王朝）、意大利 1848 宪法（君主制到 1970 年）、
       日本 1889 明治宪法（另一部是战后民定昭和宪法）、中国 1908 《钦定宪法大纲》
     + 协定宪法由君主与国民代表机关协商制定。
       英国 1215《大宪章》（“未经国会同意不能随意征税”）、
       /法国 1830 宪法/ （君主立宪制）

** 宪法的制定
*** 近代意义宪法的产生
马法学认为奴隶社会和封建社会不可能产生宪法，而是资产革命的产物。
1. 经济原因：资本主义商品经济普遍化发展
2. 政治原因：资产阶级革命胜利、普选制议会制为核心的民主制度
3. 思想原因：启蒙思想家的民主自由平等人权法治理论
