public_html/理论法.html
<li><a id="orgd6276d0"></a>法律解释的种类：正式解释与非正式解释<br />
<div class="outline-text-4" id="text-orgd6276d0">
<ol class="org-ol">
<li>正式解释（法定解释、有权解释）
具有法律上约束力的解释，来自立法、司法和行政解释
比如一个特定的法学家团体的解释作为法定解释。</li>
<li>非正式解释（学理解释）
不具有法律约束力的解释</li>
</ol>

<p>
所有法律都是可以解释的。
</p>
</div>
</li>
<li><a id="org28cfd28"></a>法律解释的方法与位阶<br />
<div class="outline-text-4" id="text-org28cfd28">
<p>
法律解释的方法是约定俗成的。
</p>
<ol class="org-ol">
<li>文义（语法、文法、文理）解释。字面解释法条</li>
<li>体系（逻辑、系统）解释。把法条放在整部法律、整个法律体系中理解其含义。</li>
<li>立法者（主观）的目的解释。依据立法资料，尊重立法人的意志。</li>
<li>历史解释。依据历史事实。</li>
<li>比较解释。依据外国判例和判例学说。</li>
<li>客观目的解释。依据社会共同伦理道德需要，让社会满意的解释。</li>
</ol>
<p>
运用不同解释方法可能得出完全不同的解释结果，因此使用不同立法解释方法的位阶。
这一位阶并不固定。有可能直接采用客观目的解释。
</p>
</div>
</li>
<li><a id="orgbd50fe2"></a>当代中国的法律解释体制<br />
<div class="outline-text-4" id="text-orgbd50fe2">
<p>
<i>一元多级</i> 的法律解释体制。
一元：法律解释权属于全国人大常委会。
多级：存在其他类型的法定法律解释。
</p>
<ol class="org-ol">
<li>法律本身需要明确或补充的，全国人大常委会进行解释</li>
<li>法院具体应用法律的问题，最高法进行解释</li>
<li>检察院具体应用法律的问题，最高检进行解释</li>
<li>非审判和检察工作中具体应用法律的问题，国务院及其主管部门进行解释</li>
<li>地方性法规条文本身需要明确或补充的，制定的省区市人大常委会进行解释
地方性法规具体应用的问题，省市区人民政府主管部门进行解释</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orge85cc35" class="outline-3">
<h3 id="orge85cc35">法律推理</h3>
<div class="outline-text-3" id="text-orge85cc35">
<p>
从一定的前提推导出法律决定的过程中，必须遵循的推论规则。
</p>
<ol class="org-ol">
<li>法律推理以法律以及法学中的理或理由为基础</li>
<li>法律推理受现行法律的约束</li>
<li>法律推理是一种寻求正当性证明的推理</li>
</ol>


<ul class="org-ul">
<li>演绎推理
三段论，现行法律拘束</li>
<li>归纳推理
不完全归纳推理</li>
<li>类比推理
相似性论证，类比先例</li>
<li>反向推理
从法条适用的情形推断出不适用法条的情形</li>
<li>当然推理
若较强的规范有效，则较弱的规范更加有效。
举轻以明重，举重以明轻
依赖于实质判断。</li>
<li>设证推理
从事实推定出前提。经验推定与规范推定</li>
</ul>
</div>
</div>
<div id="outline-container-org1d7448b" class="outline-3">
<h3 id="org1d7448b">法律漏洞的填补</h3>
<div class="outline-text-3" id="text-org1d7448b">
</div>
<ul class="org-ul">
<li><a id="orge61ae47"></a>法律漏洞的概念<br />
<div class="outline-text-4" id="text-orge61ae47">
<ol class="org-ol">
<li>法律漏洞违反了立法计划（立法目的）。</li>
<li>法律漏洞性质：属于法内空间，是法律不合目的的缺失状态。</li>
<li>产生原因：立法者的理性有限，且“禁止拒绝裁判原则”</li>
<li>判断：确定立法计划或规范目的，使用历史解释和目的论解释</li>
</ol>
</div>
</li>
<li><a id="orgb2f6206"></a>法律漏洞的分类<br />
<div class="outline-text-4" id="text-orgb2f6206">
<ol class="org-ol">
<li>是否规定
<ul class="org-ul">
<li>全部漏洞：一方面的法律没有任何规定</li>
<li>部分漏洞：己规定但不完全</li>
</ul></li>
<li>表现形态
<ul class="org-ul">
<li>明显漏洞：应积极规定却未规定</li>
<li>隐藏漏洞：己规定但没有对应设例外做规定</li>
</ul></li>
<li>产生时间
<ul class="org-ul">
<li>自始漏洞（法律制定时己经存在）
明知漏洞：有意将漏洞保留给其他主体解释
不明知漏洞：疏忽、认知限制、误认己规定</li>
<li>嗣后漏洞（法律制定、实施后产生）因为法律相对于社会现实的滞后</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org8a5cebd"></a>法律漏洞的填补方法<br />
<div class="outline-text-4" id="text-org8a5cebd">
<p>
目的论扩张解决明显漏洞（词不达意），涵盖案件；
目的论收缩解决隐藏漏洞（言过其实），排除案件。
目的论扩张或收缩不是扩张解释或限缩解释。
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgf2dfbfe" class="outline-2">
<h2 id="orgf2dfbfe">法的演进和法与社会</h2>
<div class="outline-text-2" id="text-orgf2dfbfe">
</div>
<div id="outline-container-orgdd070d3" class="outline-3">
<h3 id="orgdd070d3">法的起源</h3>
<div class="outline-text-3" id="text-orgdd070d3">
</div>
<ul class="org-ul">
<li><a id="orgb72cc55"></a>法的起源的各种学说及其与法的本质学说的关系<br />
<div class="outline-text-4" id="text-orgb72cc55">
<ol class="org-ol">
<li>神创说：神学政治的奥古斯丁</li>
<li>暴力说：法家的荀子</li>
<li>契约说：17、18 世纪古典自然法学者</li>
<li>发展说：人的能力发展需要和精神发展产生了法。黑格尔、萨维尼</li>
<li>合理管理说：基于社会的合理性管理需要。法社会学家</li>
<li>马克思主义法学：法起源于一定社会经济基础。
法是随着生产力的发展、社会经济的发展、私有制和阶级的产生、国家的出现而产生的
法的起源的各种学说与法的本质学说之间存在内在的一致和对应的关系。</li>
</ol>
</div>
</li>
<li><a id="orgacc022c"></a>法产生的一般规律<br />
<div class="outline-text-4" id="text-orgacc022c">
<ol class="org-ol">
<li>个别调整到规范性调整
一般规范性调整到法的调整</li>
<li>习惯到习惯法再到制定法</li>
<li>法与宗教规范、道德规范的浑然一体到法与二者分离、相对独立地发展</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org7bbd440" class="outline-3">
<h3 id="org7bbd440">法的发展与传统</h3>
<div class="outline-text-3" id="text-org7bbd440">
</div>
<ul class="org-ul">
<li><a id="org1df49e5"></a>法的发展<br />
<div class="outline-text-4" id="text-org1df49e5">
<ol class="org-ol">
<li><p>
法的历史类型
奴隶制法、封建制法、资本主义法、社会主义法
</p>
<pre class="example">
身份到契约的运动（梅因）不合理走向合理、实质理性走向形式理性（韦伯）
</pre></li>
<li><p>
法的继承与法的移植
</p>
<ul class="org-ul">
<li>法的继承：不同历史时代的法律制度之间的延续和继受</li>
<li>法的移植：一国对同时代其他国家、地区和国际法律制度的吸收和借鉴</li>
</ul>
<pre class="example">
1804 法国民法典继承了古罗马法
1900 德国民法典继承了古罗马法和日耳曼法
</pre></li>
</ol>
</div>
</li>
<li><a id="orgef6b7cf"></a>法的传统<br />
<div class="outline-text-4" id="text-orgef6b7cf">
<ol class="org-ol">
<li>法的传统是指特定国家和民族世代相传、辗转相承的有关法的 <i>观念+制度</i> 的总和。</li>
<li>法律意识延续法律传统。前者包括法律心理和法律思想（论文、著作）</li>
<li>中国和西方的传统法律文化
<ol class="org-ol">
<li><p>
中华法系
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">礼法结合、德主刑辅</td>
<td class="org-left">等级有序、家庭本位</td>
</tr>

<tr>
<td class="org-left">以刑为主、民刑不分</td>
<td class="org-left">重视调解、无讼是求</td>
</tr>
</tbody>
</table></li>
<li><p>
西方法律传统文化
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">法律受宗教影响较大</td>
</tr>

<tr>
<td class="org-left">强调个体的价值和地位</td>
</tr>

<tr>
<td class="org-left">私法文化相对发达</td>
</tr>

<tr>
<td class="org-left">以正义为法律的价值取向</td>
</tr>
</tbody>
</table></li>
</ol></li>
</ol>
</div>
</li>
<li><a id="orgf93eae0"></a>法系<br />
<div class="outline-text-4" id="text-orgf93eae0">
<ol class="org-ol">
<li><p>
<i>凡属同一传统</i> 的法律就构成一个法系。
</p>
<pre class="example">
大陆法系、英美法系、伊斯兰法系、中华法系、印度法系
威格摩尔五大法系
</pre></li>
<li><p>
民法法系和普通法系
</p>
<ol class="org-ol">
<li>民法法系（大陆法系、罗马德意志法系、法典法系）
基于古罗马法、《法国民法典》。分法国法和德国法</li>
<li>普通法系（普通法法系、英国法系、判例法系、英美法系）
基于英国普通法、以判例法为法的主要表现形式。分英国法和美国法</li>
</ol>
<pre class="example">
大陆法系、英美法系、伊斯兰法系是活法系、其余为死法系。
</pre></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org6df41a7" class="outline-3">
<h3 id="org6df41a7">法的现代化</h3>
<div class="outline-text-3" id="text-org6df41a7">
</div>
<ul class="org-ul">
<li><a id="org3d24402"></a>法的现代化的标志<br />
<div class="outline-text-4" id="text-org3d24402">
<ol class="org-ol">
<li>现代化源于工业化、法的现代化指法的现代性因素不断增加。</li>
<li>法的现代化的四个内涵：
<ol class="org-ol">
<li>法与道德分离</li>
<li>法的形式化</li>
<li>对现代价值的体现和保护</li>
<li>法具有形式合理性
形式先行，不以实质合理为核心</li>
</ol></li>
<li>现代化的类型
<ol class="org-ol">
<li>内发型：自下而上，缓慢渐进（英国等）</li>
<li>外源型：自上而下，迅速突然（日本、印度、俄国）</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org609fb76"></a>当代中国的法的现代化<br />
<div class="outline-text-4" id="text-org609fb76">
<p>
以 1902 收回领事裁判权为契机，外源性的法的现代化（清末修律）
</p>
<ol class="org-ol">
<li>被动接受到主动选择</li>
<li>模仿民法法系到建立有中国特色的社会主义法律制度</li>
<li>启动形式：立法主导型
司法主导型：如英美法系</li>
<li>法律制度变革在前、法律观念更新在后，斗争激烈</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org2faeca5" class="outline-3">
<h3 id="org2faeca5">法与社会、经济、政治、道德、宗教</h3>
<div class="outline-text-3" id="text-org2faeca5">
</div>
<ul class="org-ul">
<li><a id="org8821b2e"></a>法与社会的一般理论<br />
<div class="outline-text-4" id="text-org8821b2e">
<ol class="org-ol">
<li>法以社会为基础，社会物质条件最终决定法律的本质</li>
<li><p>
法对社会调整，首先通过调和社会各种冲突的利益来实现
法律不是万能的，某些社会领域中法律控制不是唯一或最佳手段
</p>
<pre class="example">
法律暴政：否定其他选项，固守一隅
</pre></li>
</ol>
</div>
</li>
<li><a id="orgb0cc951"></a>法与经济<br />
<div class="outline-text-4" id="text-orgb0cc951">
<ol class="org-ol">
<li>法由经济基础决定，法不得不服从经济条件</li>
<li>法与科学技术
<ul class="org-ul">
<li>科技对法律提出了新问题
事实认定、法律适用和法律推理受现代科学技术影响</li>
<li>运用法律管理科技活动
积极促进科技经济一体化，科技成果商品化</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org713c3fe"></a>法与政治<br />
<div class="outline-text-4" id="text-org713c3fe">
<ol class="org-ol">
<li>法与政治都属于上层建筑，两者相互作用、相辅相成。</li>
<li>法与政策
法与执政党政策在内容和实质方面存在联系，也有很大区别。</li>
<li>法与国家
法与国家权力构成相互依存、相互支撑的关系，也存在紧张或冲突关系。
近现代法治的实质和精义在于控权，对权力在形式和实质上的合法性的强调。</li>
</ol>
</div>
</li>
<li><a id="org5cff137"></a>法与道德<br />
<div class="outline-text-4" id="text-org5cff137">
<ol class="org-ol">
<li>法与道德的联系
<ul class="org-ul">
<li>本质与必然联系：肯定说的自然法、否定说的分析实证主义法学派</li>
<li>内容上联系：近代以前重合度极高，近现代“法律是最低限度的道德”</li>
<li>功能上联系：古代强调道德的主要地位，近现代强调法律调整的突出作用</li>
</ul></li>
<li>法与道德的区别
<ol class="org-ol">
<li>生成方式：法是自觉建构的人造物、道德是自发和非建构的</li>
<li>表现形式：法以国家机关规范性文件表现、道德存在于内心的舆论</li>
<li>调整范围：道德调整范围与法律广、比法律深</li>
<li>内容结构：法律明确而具体、道德则无特定具体形式</li>
<li>实施方式：法以国家强制度形成外在强制、道德靠信念和舆论得以实施</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org585bf97"></a>法与宗教<br />
<div class="outline-text-4" id="text-org585bf97">
<ol class="org-ol">
<li>宗教推动立法、影响司法、提高守法自觉性。反过来也会妨碍司法公正</li>
<li>法对宗教的影响
<ol class="org-ol">
<li>政教合一的国家里，法可以保护国教、破坏异教</li>
<li>近现代政教分离而国家里，法对宗教之争持中立态度，保障宗教信仰自由</li>
<li>法对本国宗教政策的规定。中国现行宗教政策
宗教信仰自由、加强宗教事务管理、积极引导宗教与社会主义建设相结合</li>
</ol></li>
</ol>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb9f718d" class="outline-2">
<h2 id="orgb9f718d">宪法基本理论</h2>
<div class="outline-text-2" id="text-orgb9f718d">
</div>
<div id="outline-container-org3c66628" class="outline-3">
<h3 id="org3c66628">宪法概述</h3>
<div class="outline-text-3" id="text-org3c66628">
<ol class="org-ol">
<li>宪法词源与用法
国家根本法的定义在 19 世纪 80 年代。见郑观应《盛世危言》
“宪法”与“法律”并用：
“本宪法以法律的形式确认了中国各族人民奋斗的成果”中“法律”指广义法律规范</li>
<li>宪法的基本特征
<ol class="org-ol">
<li>内容上，规定一个国家最根本最核心的问题</li>
<li>法律效力上，具有最高法律效力
<ul class="org-ul">
<li>宪法是制定普通法律的依据</li>
<li>任何普通法律不得与宪法的内容原则和精神相违背</li>
<li>宪法是一切国家机关社会团体和全体公民的最高行为准则</li>
</ul></li>
<li><p>
制定和修改上，宪法比普通法律更加严格
须由全国人大常委或 1/5 以上全国人大代表提议，
由全国人大 2/3 以上绝对多数通过。
</p>
<pre class="example">
对比普通法律只需要 30 名以上人大代表提议，1/2 相对多数通过。
</pre></li>
<li><p>
宪法是公民权利的保障书，是民主事实法律化的基本形式。
</p>
<pre class="example">
如 1918 苏俄宪法、1919 魏玛宪法。确认保障民主事实
</pre></li>
</ol></li>
<li>宪法的概念和本质
规定国家的根本制度和根本任务、集中体现各政治力量对比关系、保障公民基本权力</li>
<li>宪法的分类
<ul class="org-ul">
<li>英国学者蒲莱士提出的两套标准
<ul class="org-ul">
<li>成文与不成文宪法（是否具有统一的法典形式）
<ul class="org-ul">
<li>1787 美国宪法（第一部成文宪法）,1791 法国宪法（大陆第一部成文宪法）
社会契约论推动形成成文宪法。</li>
<li>英国、新西兰、以色列、沙特阿拉伯等不成文宪法。如英国：
<ul class="org-ul">
<li>宪法惯例、宪法判例</li>
<li>1628《权利请愿书》1679《人身保护法》1689《权利法案》</li>
<li>1701《王位继承法》1911《国会法》1918《国民参政法》</li>
<li>1928《男女选举平等法》1969《人民代表法》等宪法性文件</li>
</ul></li>
</ul></li>
<li>刚性与柔性宪法（效力及制定，修改）
成文宪法国家往往是刚性宪法的国家，反之亦然。</li>
</ul></li>
<li>民定、钦定、协定宪法
<ul class="org-ul">
<li>民定宪法由民意机关或全民公决制定。 <i>法国 1793 宪法</i> （罗伯斯庇尔，雅各宾派）</li>
<li>钦定宪法由君主或以君主名义制定和颁布。
<i>法国 1814 宪法</i> （波旁王朝）、意大利 1848 宪法（君主制到 1970 年）、
日本 1889 明治宪法（另一部是战后民定昭和宪法）、中国 1908 《钦定宪法大纲》</li>
<li>协定宪法由君主与国民代表机关协商制定。
英国 1215《大宪章》（“未经国会同意不能随意征税”）、
<i>法国 1830 宪法</i> （君主立宪制）</li>
</ul></li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orgf2b1414" class="outline-3">
<h3 id="orgf2b1414">宪法的制定</h3>
<div class="outline-text-3" id="text-orgf2b1414">
</div>
<ul class="org-ul">
<li><a id="orgf2e86c3"></a>近代意义宪法的产生<br />
<div class="outline-text-4" id="text-orgf2e86c3">
<p>
马法学认为奴隶社会和封建社会不可能产生宪法，而是资产革命的产物。
</p>
<ol class="org-ol">
<li>经济原因：资本主义商品经济普遍化发展</li>
<li>政治原因：资产阶级革命胜利、普选制议会制为核心的民主制度</li>
<li>思想原因：启蒙思想家的民主自由平等人权法治理论</li>
</ol>
</div>
</li>
