src/理论法.org
*** 宪法制定的具体要求
1. 制宪主体：国民。
   制宪权概念的提出：法国大革命的西耶斯。只有国民才享有制宪权
   人民作为制宪主体是现代宪法发展的基本特点。
   : 资产阶级的有产者才是国民才有民主，而社会主义只看政治立场。
2. 制宪权与修宪权
   修宪权源于制宪权，受到制宪权的约束。
   制宪权、修宪权属于 /根源性/ 的国家权力，可以创造其他国家权力。
3. 制宪程序
   1. 设主制宪机关。包括宪法起草机关、宪法通过机关
   2. 提出宪法草案
   3. 通过宪法草案。要求宪法通过机关绝对多数赞成
   4. 公布宪法
4. 我国宪法归定
   - 制宪主体：人民
   - 宪法起草机关：1953 中国宪法起草委员会，主席毛泽东
   - 制宪机关：1954 第一届全国人大一次会议。通过 1954 宪法
   - 宪法公布：1954 宪法由全国大人公告发布，自通过之日起生效
*** 中国宪法的历史发展
1. 旧中国宪法的历史发展
   - 清政府 1908《钦定宪法大纲》是中国第一部宪法。
     辛亥革命时补定《宪法重大信条十九条》是清政府最后一部宪法。
   - 中华民国南京临时政府的 1912《中华民国临时约法》
     1913“天坛宪草”1914“袁记约法”1923“贿选宪法”
     1925《中华民国宪法草案》1931《中华民国训政时期约法》
     1936“五五宪草”1946《中华民国宪法》
     《中华苏维埃共和国宪法大纲》《陕甘宁边区施政纲领》《陕甘宁边区宪法原则》
2. 新中国宪法的历史发展
   * 历史发展
     1) 《中国人民政治协商会议共同纲领》起临时宪法作用
     2) 1954 宪法在共同纲领基础上制定
     3) 1975 宪法
     4) 1978 宪法
     5) 1982 宪法，现行
     即原定 1954 宪法，经历了 3 次全面修改、7次部分修改。
   * 现行 1982 宪法
     - 四项基本原则
     - 恢复国家主席
     - 法律面前人人平等
     - 发展多种经济形式
     - 特别行政区制度
     - 首次明确规定了 /修宪提案权/
   * 1982 宪法的 5 次修改
     1) 1988 第一次宪法修正案，土地使用权转让与私营经济
     2) 1993 修正案
        - 国营“服从国家统一安排”变国有“有权自主经营”
        - 家庭联产承包责任
        - 社会主义市场经济
        - 社会主义初级阶段、中国特色社会主义、改革开放
        - 县级人大任期
        - 多党合作政治协商制度
     3) 1999 修正案
        - 依法治国
        - 邓小平理论
        - 改掉镇压反革命活动
        - 非公有制经济
        - 家庭承包经营
        - 所有制经济与分配方式
     4) 2004 修正案
        - 三个代表
        - 乡镇人大
        - 鼓励支持非公有制经济
        - 尊重和保障人权
        - 公民合法私有财产不受侵犯，国家依法征收私有财产
        - 戒严改为紧急状态
        - 国家依法征收土地
        - 社会保障制度
          : 仅与经济状态相关
        - 统一战线的社会主义事业建设者
          : 原来是劳动者和爱国者（港澳台胞）
          : 建设者：个体私营的企业家领军人物“资本家”（梁稳根）
        - 国旗国徽首都+国歌
        - 国家主席职权：进行国事活动
          : 原本：接受外国使节
        - 特别行政区全国人大代表
        - 政治文明
     5) 2018 修正案
        - 科学发展观、习思想
        - 社会主义法治
        - 贯彻新发展理念
        - 社会文明生态文明
        - 和谐美丽现代化强国
        - 实现中华民族伟大复兴
        - 革命建设改革
        - 统一战线的伟大复兴的爱国者
          : 在文化上支持团结的也是统一战线
        - 民族和谐
        - 和平发展道路、互利共赢战略、人类命运共同体
        - 本质特征共产党领导
        - 宪法和法律委员会
        - 设区的市的人大制定地方性法规
          : 在其他法里有此法律但后来提升到宪法高度，老法新高度
        - 宪法宣誓
          : 老法新高度
        - 国家主席连任
        - 从政府分出监察委员会
        - 社会主义核心价值观
*** 宪法的发展趋势
1. 强调保障人权
2. 行政权力的强化及限制
3. 建立违宪审查制度
4. 同国际法相结合
** 宪法的基本原则
*** 人民主权原则
1. （卢梭）资产阶级民主的首要原则。社会主义国家“一切权力属于人民”
2. 人民主权原则在宪法中的体现
   1) 直接表述，如第 1 条第 1 款。
   2) 规定人民主权具体实现形式与途径
   3) 宪法对公民基本权利和义务的规定
*** 基本人权原则
1. “天赋人权”学说的产物
2. 人权原则表述方式
   1) 宪法文本直接规定人权
   2) 宪法文本规定公民的具体权利义务而非人权字样
   3) 宪法文本同时出现人权与基本权利的表述，通过宪法解释其具体内涵
      中国宪法也是这一种。
*** 法治原则
1. 洛克、潘恩。如法国 1791 宪法的序言《人权宣言》明确阐述
2. 我国宪法第 5 条第 1 款“建设社会主义法治国家”
*** 权力制约原则
1. 在资本主义国家宪法中，权力制约表现为分权原则。
   在社会主义国家宪法中，权力制约表现为监督原则，如巴黎公社
2. 在我国宪法中的体现
   - 人民对国家权力活动进行监督
   - 公民对国家机关及其公务员的监督
   - 不同国家机关之间、国家机关内部不同的监督
** 宪法的基本功能
1. 宪法的一般功能
   即宪法内容和原则应当在社会生活中产生的实际效果。
   1) 确认功能
      - 确认经济基础
      - 确认国家权力归属
      - 确认国家法制统一原则
        : 只有一部宪法。不像美国每个州都一个宪法
      - 确认社会共同体的基本价值目标与原则
   2) 保障功能
      - 宪法保障民主制度和人权
      - 人权保障是最核心的内容
   3) 限制功能
      - 宪法是授权法也是限制法，限制公权力活动
        : “黄金规定”
      - 限制国家权力是人权保障的必要基础
   4) 协调功能
      以合理的机制平衡利益。
2. 宪法在社会主义法治国家建设中的作用
   1. 立法中的作用
      - 确立了法律体系基本目标
      - 确立了立法统一基础
      - 建立了科学的法律体系
      - 规定了解决法律体系内部冲突的基本机制
      - 构建了立法体制发展与完善的基础与依据
   2. 执法中的作用
      - 宪法是执法的基础
      - 宪法意识和宪法思维对执法有引领作用
   3. 司法中的作用
      - 宪法是审判权和检察权的来源
      - 宪法和法律规定了司法机关进行活动的基本原则
      - 法官和检察官的宪法意识
   4. 守法中的作用
      守法首先要遵守宪法。
** 宪法的渊源与宪法典的结构
*** 宪法的渊源
宪法的渊源主要有宪法典、宪法性法律、宪法惯例、宪法判例、国际条约和国际习惯等。
各国不同的宪法渊源取决于本国历史传统和现实政治状况。
1. 宪法典
   : 中国现行宪法即宪法典。
2. 宪法性法律：由多部而非一部法律文书表现出来的宪法。
   - 不成文宪法国家的宪法性法律，制定和修改的机关、程序等同于普通法律。
   - 成文宪法国家的宪法性法律，是 /为实施宪法而制定/ 的规定宪法内容的法律。
   : 部门法意义上的宪法如组织法、选举法、立法法等，包括中国。
3. 宪法惯例：宪法条文无明确规定，但在实际政治生活中已经存在，
   与宪法具有同等效力的习惯或传统。
   : 中国如：以宪法修正案修改宪法，以全国人大公告的方式公布宪法修正案，等等。
4. 宪法判例：宪法条文无明文规定，而由司法机关形成的具有宪法效力的判例。
   : 因为司法文书只能以宪法说理，不能作为正式判决依据。
5. 国际条约：一国确认国际条约成为国内法的渊源以及宪法的渊源。
   : 我国只规定了和平共处五项原则。
*** 宪法典的结构
序言、正文、附则
1. 序言
   写在宪法条文前的陈述性表述，表达本国宪法发展的历史、国家的基本政策。
   - 历史发展的叙述
   - 国家的根本任务
   - 国家的基本国策
   - 宪法的根本法地位和最高法律效力
2. 正文
   具体规定宪法基本制度和权力体系的安排。
   - 总纲、公民基本的权利和义务、国家机构、国旗国歌国徽首都
   - 82 宪法将公民基本权利义务置于国家机构之前。
3. 附则
   对特定事项作用的临时条款。
** 宪法规范与宪法效力
*** 宪法规范
1. 主要特点：根本性、最高性、原则性、纲领性、稳定性
2. 宪法规范分类
   1) 确认性规范
   2) 禁止性规范
   3) 权利性规范和义务性规范
   4) 程序性规范
*** 宪法效力
1. 宪法效力的来源
   最高法律效力来源于宪法具有正当性基础， 是社会共同体的基本规则。
2. 宪法效力的表现
   1) 宪法效力具有最高性与直接性
   2) 宪法对人的适用
      - 适用于所有中国公民。
        以出生地主义和血统主义相结合和确定国籍，一人一国籍。
      - 适用于华侨。
      - 外国人和法人在一定的条件下也能成为某些基本权利的主体。
   3) 宪法对领土的效力。其效力及于中国所有领域。

** 宪法的实施及其保障
*** 宪法实施
宪法实族包括宪法的遵守、宪法的适用、宪法实施的保障。
宪法遵守是宪法实施最基本的要求。
宪法实施的主要特点：
1. 广泛性和综合性
2. 最高性和原则性
3. 直接性和间接性
   1) 实施方式的直接间接。宪法的实施的间接性更突出。其他法律以直接性更多。
   2) 宪法制裁的直接间接。
      直接制裁适用国家机关的违宪行为，间接制裁则通过具体法律追究法律责任。
4. 宪法实施的保障
   1) 政治保障
   2) 社会保障
   3) 法律保障
*** 宪法修改
1. 世界各国的宪法修改
   1) 全面修改
   2) 部分修改
   常规程序一般包括提案、先决投票、起草和公布修宪草案、通过和公布五个阶段。
2. 我国的宪法修改
   “三明文”“三惯例”
   - 全国人大修宪（全国人大修宪）
   - 人常五一提案（人大常委会或 1/5 以上全国人大代表）
   - 绝对多数通过（2/3 多数通过）
   - 中央建议（中共中央修宪建议）
   - 公告形式（公布宪法修正案）
   - 用修正案（的形式修改宪法）
   我国宪法总共 3 次全面修改、7次部分修改。
*** 宪法解释
   特定主体对宪法内容含义及界限所作的说明。
   1) 宪法解释的机关
      - 代议机关：英国
        我国宪法解释权由全国大人常委会行使。
      - 司法机关：美国
        法院“不告不理”，附带性审查原则
        : 附带性审查：只有在审理案件时检查所适用的法律是否违宪。
      - 专门机关：法国德国
        宪法法院、宪法委员会等专门成立的机关解释宪法。
        司法积极主义原则
        奥地利规范法学派：汉斯·凯尔森。
   2) 宪法解释的方法
      - 统一解释
      - 逻辑解释
      - 补充解释
      - 扩大解释
*** 宪法监督
1. 宪法监督的体制
   1) 普通司法机关作为宪法监督机关
   2) 代议机关作为宪法监督机关
   3) 专门机关作为宪法监督机关，起源于 1799 年法国宪法设立的护法元老院
2. 宪法监督的方式
   1) 事先审查和事后审查
      在宪法生效前后进行合宪性审查请求。
   2) 附带性审查和宪法控诉
      - /附带性审查/ 对规范性法律文件进行合宪性审查，以争讼事件为前提。
      - /宪法控诉/ 是当公民个人的宪法权利受的侵害后向宪法法院提出控诉。
3. 我国的宪法监督制度
   1) 我国属于代议机关作为宪法监督机关的模式，由 1954 宪法确立。
   2) 采取事先审查与事后审查相结合。批准备案
