public_html/理论法.html
<li><a id="org2ed3fd9"></a>宪法制定的具体要求<br />
<div class="outline-text-4" id="text-org2ed3fd9">
<ol class="org-ol">
<li><p>
制宪主体：国民。
制宪权概念的提出：法国大革命的西耶斯。只有国民才享有制宪权
人民作为制宪主体是现代宪法发展的基本特点。
</p>
<pre class="example">
资产阶级的有产者才是国民才有民主，而社会主义只看政治立场。
</pre></li>
<li>制宪权与修宪权
修宪权源于制宪权，受到制宪权的约束。
制宪权、修宪权属于 <i>根源性</i> 的国家权力，可以创造其他国家权力。</li>
<li>制宪程序
<ol class="org-ol">
<li>设主制宪机关。包括宪法起草机关、宪法通过机关</li>
<li>提出宪法草案</li>
<li>通过宪法草案。要求宪法通过机关绝对多数赞成</li>
<li>公布宪法</li>
</ol></li>
<li>我国宪法归定
<ul class="org-ul">
<li>制宪主体：人民</li>
<li>宪法起草机关：1953 中国宪法起草委员会，主席毛泽东</li>
<li>制宪机关：1954 第一届全国人大一次会议。通过 1954 宪法</li>
<li>宪法公布：1954 宪法由全国大人公告发布，自通过之日起生效</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org0d4d697"></a>中国宪法的历史发展<br />
<div class="outline-text-4" id="text-org0d4d697">
<ol class="org-ol">
<li>旧中国宪法的历史发展
<ul class="org-ul">
<li>清政府 1908《钦定宪法大纲》是中国第一部宪法。
辛亥革命时补定《宪法重大信条十九条》是清政府最后一部宪法。</li>
<li>中华民国南京临时政府的 1912《中华民国临时约法》
1913“天坛宪草”1914“袁记约法”1923“贿选宪法”
1925《中华民国宪法草案》1931《中华民国训政时期约法》
1936“五五宪草”1946《中华民国宪法》
《中华苏维埃共和国宪法大纲》《陕甘宁边区施政纲领》《陕甘宁边区宪法原则》</li>
</ul></li>
<li>新中国宪法的历史发展
<ul class="org-ul">
<li><p>
历史发展
</p>
<ol class="org-ol">
<li>《中国人民政治协商会议共同纲领》起临时宪法作用</li>
<li>1954 宪法在共同纲领基础上制定</li>
<li>1975 宪法</li>
<li>1978 宪法</li>
<li>1982 宪法，现行</li>
</ol>
<p>
即原定 1954 宪法，经历了 3 次全面修改、7次部分修改。
</p></li>
<li>现行 1982 宪法
<ul class="org-ul">
<li>四项基本原则</li>
<li>恢复国家主席</li>
<li>法律面前人人平等</li>
<li>发展多种经济形式</li>
<li>特别行政区制度</li>
<li>首次明确规定了 <i>修宪提案权</i></li>
</ul></li>
<li>1982 宪法的 5 次修改
<ol class="org-ol">
<li>1988 第一次宪法修正案，土地使用权转让与私营经济</li>
<li>1993 修正案
<ul class="org-ul">
<li>国营“服从国家统一安排”变国有“有权自主经营”</li>
<li>家庭联产承包责任</li>
<li>社会主义市场经济</li>
<li>社会主义初级阶段、中国特色社会主义、改革开放</li>
<li>县级人大任期</li>
<li>多党合作政治协商制度</li>
</ul></li>
<li>1999 修正案
<ul class="org-ul">
<li>依法治国</li>
<li>邓小平理论</li>
<li>改掉镇压反革命活动</li>
<li>非公有制经济</li>
<li>家庭承包经营</li>
<li>所有制经济与分配方式</li>
</ul></li>
<li>2004 修正案
<ul class="org-ul">
<li>三个代表</li>
<li>乡镇人大</li>
<li>鼓励支持非公有制经济</li>
<li>尊重和保障人权</li>
<li>公民合法私有财产不受侵犯，国家依法征收私有财产</li>
<li>戒严改为紧急状态</li>
<li>国家依法征收土地</li>
<li><p>
社会保障制度
</p>
<pre class="example">
仅与经济状态相关
</pre></li>
<li><p>
统一战线的社会主义事业建设者
</p>
<pre class="example">
原来是劳动者和爱国者（港澳台胞）
建设者：个体私营的企业家领军人物“资本家”（梁稳根）
</pre></li>
<li>国旗国徽首都+国歌</li>
<li><p>
国家主席职权：进行国事活动
</p>
<pre class="example">
原本：接受外国使节
</pre></li>
<li>特别行政区全国人大代表</li>
<li>政治文明</li>
</ul></li>
<li>2018 修正案
<ul class="org-ul">
<li>科学发展观、习思想</li>
<li>社会主义法治</li>
<li>贯彻新发展理念</li>
<li>社会文明生态文明</li>
<li>和谐美丽现代化强国</li>
<li>实现中华民族伟大复兴</li>
<li>革命建设改革</li>
<li><p>
统一战线的伟大复兴的爱国者
</p>
<pre class="example">
在文化上支持团结的也是统一战线
</pre></li>
<li>民族和谐</li>
<li>和平发展道路、互利共赢战略、人类命运共同体</li>
<li>本质特征共产党领导</li>
<li>宪法和法律委员会</li>
<li><p>
设区的市的人大制定地方性法规
</p>
<pre class="example">
在其他法里有此法律但后来提升到宪法高度，老法新高度
</pre></li>
<li><p>
宪法宣誓
</p>
<pre class="example">
老法新高度
</pre></li>
<li>国家主席连任</li>
<li>从政府分出监察委员会</li>
<li>社会主义核心价值观</li>
</ul></li>
</ol></li>
</ul></li>
</ol>
</div>
</li>
<li><a id="orgdaf15c1"></a>宪法的发展趋势<br />
<div class="outline-text-4" id="text-orgdaf15c1">
<ol class="org-ol">
<li>强调保障人权</li>
<li>行政权力的强化及限制</li>
<li>建立违宪审查制度</li>
<li>同国际法相结合</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org9c60261" class="outline-3">
<h3 id="org9c60261">宪法的基本原则</h3>
<div class="outline-text-3" id="text-org9c60261">
</div>
<ul class="org-ul">
<li><a id="orgd685452"></a>人民主权原则<br />
<div class="outline-text-4" id="text-orgd685452">
<ol class="org-ol">
<li>（卢梭）资产阶级民主的首要原则。社会主义国家“一切权力属于人民”</li>
<li>人民主权原则在宪法中的体现
<ol class="org-ol">
<li>直接表述，如第 1 条第 1 款。</li>
<li>规定人民主权具体实现形式与途径</li>
<li>宪法对公民基本权利和义务的规定</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org90da59a"></a>基本人权原则<br />
<div class="outline-text-4" id="text-org90da59a">
<ol class="org-ol">
<li>“天赋人权”学说的产物</li>
<li>人权原则表述方式
<ol class="org-ol">
<li>宪法文本直接规定人权</li>
<li>宪法文本规定公民的具体权利义务而非人权字样</li>
<li>宪法文本同时出现人权与基本权利的表述，通过宪法解释其具体内涵
中国宪法也是这一种。</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="orgcfd90a1"></a>法治原则<br />
<div class="outline-text-4" id="text-orgcfd90a1">
<ol class="org-ol">
<li>洛克、潘恩。如法国 1791 宪法的序言《人权宣言》明确阐述</li>
<li>我国宪法第 5 条第 1 款“建设社会主义法治国家”</li>
</ol>
</div>
</li>
<li><a id="org99ca6ef"></a>权力制约原则<br />
<div class="outline-text-4" id="text-org99ca6ef">
<ol class="org-ol">
<li>在资本主义国家宪法中，权力制约表现为分权原则。
在社会主义国家宪法中，权力制约表现为监督原则，如巴黎公社</li>
<li>在我国宪法中的体现
<ul class="org-ul">
<li>人民对国家权力活动进行监督</li>
<li>公民对国家机关及其公务员的监督</li>
<li>不同国家机关之间、国家机关内部不同的监督</li>
</ul></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgb1cf131" class="outline-3">
<h3 id="orgb1cf131">宪法的基本功能</h3>
<div class="outline-text-3" id="text-orgb1cf131">
<ol class="org-ol">
<li>宪法的一般功能
即宪法内容和原则应当在社会生活中产生的实际效果。
<ol class="org-ol">
<li>确认功能
<ul class="org-ul">
<li>确认经济基础</li>
<li>确认国家权力归属</li>
<li><p>
确认国家法制统一原则
</p>
<pre class="example">
只有一部宪法。不像美国每个州都一个宪法
</pre></li>
<li>确认社会共同体的基本价值目标与原则</li>
</ul></li>
<li>保障功能
<ul class="org-ul">
<li>宪法保障民主制度和人权</li>
<li>人权保障是最核心的内容</li>
</ul></li>
<li>限制功能
<ul class="org-ul">
<li><p>
宪法是授权法也是限制法，限制公权力活动
</p>
<pre class="example">
“黄金规定”
</pre></li>
<li>限制国家权力是人权保障的必要基础</li>
</ul></li>
<li>协调功能
以合理的机制平衡利益。</li>
</ol></li>
<li>宪法在社会主义法治国家建设中的作用
<ol class="org-ol">
<li>立法中的作用
<ul class="org-ul">
<li>确立了法律体系基本目标</li>
<li>确立了立法统一基础</li>
<li>建立了科学的法律体系</li>
<li>规定了解决法律体系内部冲突的基本机制</li>
<li>构建了立法体制发展与完善的基础与依据</li>
</ul></li>
<li>执法中的作用
<ul class="org-ul">
<li>宪法是执法的基础</li>
<li>宪法意识和宪法思维对执法有引领作用</li>
</ul></li>
<li>司法中的作用
<ul class="org-ul">
<li>宪法是审判权和检察权的来源</li>
<li>宪法和法律规定了司法机关进行活动的基本原则</li>
<li>法官和检察官的宪法意识</li>
</ul></li>
<li>守法中的作用
守法首先要遵守宪法。</li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-orgd41ee71" class="outline-3">
<h3 id="orgd41ee71">宪法的渊源与宪法典的结构</h3>
<div class="outline-text-3" id="text-orgd41ee71">
</div>
<ul class="org-ul">
<li><a id="orgad97624"></a>宪法的渊源<br />
<div class="outline-text-4" id="text-orgad97624">
<p>
宪法的渊源主要有宪法典、宪法性法律、宪法惯例、宪法判例、国际条约和国际习惯等。
各国不同的宪法渊源取决于本国历史传统和现实政治状况。
</p>
<ol class="org-ol">
<li><p>
宪法典
</p>
<pre class="example">
中国现行宪法即宪法典。
</pre></li>
<li><p>
宪法性法律：由多部而非一部法律文书表现出来的宪法。
</p>
<ul class="org-ul">
<li>不成文宪法国家的宪法性法律，制定和修改的机关、程序等同于普通法律。</li>
<li>成文宪法国家的宪法性法律，是 <i>为实施宪法而制定</i> 的规定宪法内容的法律。</li>
</ul>
<pre class="example">
部门法意义上的宪法如组织法、选举法、立法法等，包括中国。
</pre></li>
<li><p>
宪法惯例：宪法条文无明确规定，但在实际政治生活中已经存在，
与宪法具有同等效力的习惯或传统。
</p>
<pre class="example">
中国如：以宪法修正案修改宪法，以全国人大公告的方式公布宪法修正案，等等。
</pre></li>
<li><p>
宪法判例：宪法条文无明文规定，而由司法机关形成的具有宪法效力的判例。
</p>
<pre class="example">
因为司法文书只能以宪法说理，不能作为正式判决依据。
</pre></li>
<li><p>
国际条约：一国确认国际条约成为国内法的渊源以及宪法的渊源。
</p>
<pre class="example">
我国只规定了和平共处五项原则。
</pre></li>
</ol>
</div>
</li>
<li><a id="org6d9f62c"></a>宪法典的结构<br />
<div class="outline-text-4" id="text-org6d9f62c">
<p>
序言、正文、附则
</p>
<ol class="org-ol">
<li>序言
写在宪法条文前的陈述性表述，表达本国宪法发展的历史、国家的基本政策。
<ul class="org-ul">
<li>历史发展的叙述</li>
<li>国家的根本任务</li>
<li>国家的基本国策</li>
<li>宪法的根本法地位和最高法律效力</li>
</ul></li>
<li>正文
具体规定宪法基本制度和权力体系的安排。
<ul class="org-ul">
<li>总纲、公民基本的权利和义务、国家机构、国旗国歌国徽首都</li>
<li>82 宪法将公民基本权利义务置于国家机构之前。</li>
</ul></li>
<li>附则
对特定事项作用的临时条款。</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org4da005a" class="outline-3">
<h3 id="org4da005a">宪法规范与宪法效力</h3>
<div class="outline-text-3" id="text-org4da005a">
</div>
<ul class="org-ul">
<li><a id="orgb710664"></a>宪法规范<br />
<div class="outline-text-4" id="text-orgb710664">
<ol class="org-ol">
<li>主要特点：根本性、最高性、原则性、纲领性、稳定性</li>
<li>宪法规范分类
<ol class="org-ol">
<li>确认性规范</li>
<li>禁止性规范</li>
<li>权利性规范和义务性规范</li>
<li>程序性规范</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org64996ca"></a>宪法效力<br />
<div class="outline-text-4" id="text-org64996ca">
<ol class="org-ol">
<li>宪法效力的来源
最高法律效力来源于宪法具有正当性基础， 是社会共同体的基本规则。</li>
<li>宪法效力的表现
<ol class="org-ol">
<li>宪法效力具有最高性与直接性</li>
<li>宪法对人的适用
<ul class="org-ul">
<li>适用于所有中国公民。
以出生地主义和血统主义相结合和确定国籍，一人一国籍。</li>
<li>适用于华侨。</li>
<li>外国人和法人在一定的条件下也能成为某些基本权利的主体。</li>
</ul></li>
<li>宪法对领土的效力。其效力及于中国所有领域。</li>
</ol></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgbb63ae7" class="outline-3">
<h3 id="orgbb63ae7">宪法的实施及其保障</h3>
<div class="outline-text-3" id="text-orgbb63ae7">
</div>
<ul class="org-ul">
<li><a id="org21a310b"></a>宪法实施<br />
<div class="outline-text-4" id="text-org21a310b">
<p>
宪法实族包括宪法的遵守、宪法的适用、宪法实施的保障。
宪法遵守是宪法实施最基本的要求。
宪法实施的主要特点：
</p>
<ol class="org-ol">
<li>广泛性和综合性</li>
<li>最高性和原则性</li>
<li>直接性和间接性
<ol class="org-ol">
<li>实施方式的直接间接。宪法的实施的间接性更突出。其他法律以直接性更多。</li>
<li>宪法制裁的直接间接。
直接制裁适用国家机关的违宪行为，间接制裁则通过具体法律追究法律责任。</li>
</ol></li>
<li>宪法实施的保障
<ol class="org-ol">
<li>政治保障</li>
<li>社会保障</li>
<li>法律保障</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org3aa0176"></a>宪法修改<br />
<div class="outline-text-4" id="text-org3aa0176">
<ol class="org-ol">
<li><p>
世界各国的宪法修改
</p>
<ol class="org-ol">
<li>全面修改</li>
<li>部分修改</li>
</ol>
<p>
常规程序一般包括提案、先决投票、起草和公布修宪草案、通过和公布五个阶段。
</p></li>
<li><p>
我国的宪法修改
“三明文”“三惯例”
</p>
<ul class="org-ul">
<li>全国人大修宪（全国人大修宪）</li>
<li>人常五一提案（人大常委会或 1/5 以上全国人大代表）</li>
<li>绝对多数通过（2/3 多数通过）</li>
<li>中央建议（中共中央修宪建议）</li>
<li>公告形式（公布宪法修正案）</li>
<li>用修正案（的形式修改宪法）</li>
</ul>
<p>
我国宪法总共 3 次全面修改、7次部分修改。
</p></li>
</ol>
</div>
</li>
<li><a id="org1f8944d"></a>宪法解释<br />
<div class="outline-text-4" id="text-org1f8944d">
<p>
特定主体对宪法内容含义及界限所作的说明。
</p>
<ol class="org-ol">
<li>宪法解释的机关
<ul class="org-ul">
<li>代议机关：英国
我国宪法解释权由全国大人常委会行使。</li>
<li><p>
司法机关：美国
法院“不告不理”，附带性审查原则
</p>
<pre class="example">
附带性审查：只有在审理案件时检查所适用的法律是否违宪。
</pre></li>
<li>专门机关：法国德国
宪法法院、宪法委员会等专门成立的机关解释宪法。
司法积极主义原则
奥地利规范法学派：汉斯·凯尔森。</li>
</ul></li>
<li>宪法解释的方法
<ul class="org-ul">
<li>统一解释</li>
<li>逻辑解释</li>
<li>补充解释</li>
<li>扩大解释</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org79b6063"></a>宪法监督<br />
<div class="outline-text-4" id="text-org79b6063">
<ol class="org-ol">
<li>宪法监督的体制
<ol class="org-ol">
<li>普通司法机关作为宪法监督机关</li>
<li>代议机关作为宪法监督机关</li>
<li>专门机关作为宪法监督机关，起源于 1799 年法国宪法设立的护法元老院</li>
</ol></li>
<li>宪法监督的方式
<ol class="org-ol">
<li>事先审查和事后审查
在宪法生效前后进行合宪性审查请求。</li>
<li>附带性审查和宪法控诉
<ul class="org-ul">
<li><i>附带性审查</i> 对规范性法律文件进行合宪性审查，以争讼事件为前提。</li>
<li><i>宪法控诉</i> 是当公民个人的宪法权利受的侵害后向宪法法院提出控诉。</li>
</ul></li>
</ol></li>
<li>我国的宪法监督制度
<ol class="org-ol">
<li>我国属于代议机关作为宪法监督机关的模式，由 1954 宪法确立。</li>
<li>采取事先审查与事后审查相结合。批准备案</li>
</ol></li>
</ol>
</div>
</li>
