src/理论法.org
*** 宪法宣誓
1. 宪法宣誓的概念
   我国 18 宪法修正案规定：宣誓人员为国家工作人员、
   宣誓应当在就职时进行、宣誓应当公开进行、宣誓具体制度由法律规定
2. 宣誓主体：国家工作人员
   宣誓仪式的组织：谁产生谁组织
   宣誓方式
3. 宪法宣誓的功能
* 国家的基本制度
** 国家的基本政治制度
*** 我国的国家性质与政权组织形式
- 国家性质：社会主义
- 根本制度：社会主义制度
- 根本政治制度：人民代表大会制度
*** 我国人民民主专政的主要特色
主要特色：中国共产党领导的多党合作和政治协商制度、爱国统一战线
1. 中国共产党领导的多党合作和政治协商制度
   在根本上区别于西方两党制和多党制，有别于其他社会主义国家的政党制。
   - 中共是执政党，民主党派是亲密友党、参政党
   - 政治基础：坚持中共领导、坚持四项基本原则
     基本方针：长期共存、互相监督、肝胆相照、荣辱与共
   - 领导方式：政治领导。各民主党派有政治自由、组织独立、法律地位平等
2. 爱国统一战线
   1. 劳动者、建设者、爱国者、爱国者的政治联盟
   2. 主要任务：建设、回归、世界和平
   3. 组织形式：中国人民政治协商会议“政协”
      政协不是国家机关，也不同于一般的人民团体。
      : 国家机关是全国人大及其派生的机关。政协比人大出现得还要早
      : 人民团体以群众性为主，受党领导。政协不同于此。
      : 全国人大召开会议时，全国政协委员列席。
*** ✘ 中国共产党的领导是中国特色社会主义最本质的特征
*** 我国的人民代表大会制度
1. 政权组织形式概述
   资本主义：二元君主立宪、议会君主立宪、总统、议会共和、委员会、半总统半议会
   社会主义：人民代表制
   实现社会主义民主的基本形式：人民代表大会制度
2. 我国人民代表制度的基本内容
   1) 人民主权，正当性的来源
   2) 全国和地方人大、人民掌握和行使国家权力的组织形式
   3) 人大代表由人民选举、受人民监督
      : 谁产生我，我就受谁监督
   4) 各级人大的国家权力机关、其他国家机关都由人大产生
  
** 国家的基本经济制度
自德国魏玛宪法以来，经济制度便成为现代宪法的重要内容之一。
*** 社会主义市场经济体制
93 修正案“国家实行社会主义市场经济”
1. 社会主义公有制是我国经济制度的基础
   国家财产包括：
   - 主要部分“国家挖矿开公司”
     + 国有自然资源
       * 绝对全民所有：矿藏、水流、海域、城市的土地
       * 可全民可集体：森林、草原、农村和城市郊区的土地
       * 绝对集体所有：农村宅基地、自留地、自留山
         : 所谓以家庭为生产单位的集体经济组织形式。
     + 国有企业 
       * 93 年以前称国营经济
       * 93 年修正案后称国有经济
   - 重要部分：国家机关、事业单位、部队等全民单位的财产
2. 非公有制经济是社会主义市场经济的重要组成部分。
   包括：劳动者个体经济和私营经济，以及外商投资。
*** 国家保护社会主义公共财产和公民合法私有财产
1. 公共财产
   社会主义的公共财产神圣不可侵犯。
2. 私有财产
   公民的合法的私有财产不受侵犯。
   非公有制经济财产权同样不可侵犯。
** 国家的基本文化制度
*** 文化制度在各国宪法中的表现
1. 资产阶级宪法，1919 德国魏玛宪法规定了公民的 /文化权利/ ，
   还规定了国家的 /基本文化政策/ ，第一次比较全国系统地规定了文化制度
2. 社会主义宪法一般宣布社会主义文化是大众文化。
3. 二战以后，世界各国宪法分为资本主义、社会主义和民族民主主义的文化制度。
   : 民族民主主义：如南美洲。
*** 我国宪法关于基本文化制度的规定
现行宪法明确规定了国家发展教、科、文、道德教育。
1. 教育事业
2. 科学事业
3. 文学艺术及其他文化事业
4. 公民道德教育
** 国家的基本社会制度
*** 基本社会制度的概念
- 广义：基本政治、经济、文化制度等总和
- 中义：相对于政治、经济、文化、生态而言的制度体系
- 狭义：社保
*** 我国现行宪法对基本社会制度的规定
六方面：
- 社会保障制度
- 医疗卫生事业
- 劳动保障制度
- 人才培养制度
- 计划生育制度
- 社会秩序及安全维护制度
** 国家结构形式
*** 我国的国家结构形式
1. 现代国家的结构形式：单一制或联邦制。
2. 我国的单一制的国家结构形式
   1) 一宪：我国只有一套以宪法为基础的法律体系。
   2) 一体系：我国只有一套中央国家机关体系。
   3) 一籍：中国是一个统一的国际法主体，具有统一的中国国籍
   4) 央统地：中央人民政府领导其下的地方行政区域。
3. 特点：
   建立民族区域自治制度解决单一制下民族问题
   建立特别行政区制度解决单一制历史遗留问题
*** 我国现行的行政区域划分
1. 行政区划是一种有目的的国家活动、属于国家内政。
   必须有宪法和法律以及有关法规的授权。
2. 全国分为省、自治区、直辖市，设一些特别行政区。
   省/自治区分为自治州/县/自治县/市
   直辖市和较大的市分为区/县
   - 自治州分为县/自治县
   - 县/自治县分为乡/民族乡/镇
3. 三种行政区划：普通行政区划、民族自治地方区划、特别行政区划。
*** 行政区域变更的法律程序
1. 行政区划争议处理由民政部处理。
2. 行政区域变更法律予
   - 全国人大：批准省自治区直辖市特别行政区
   - 省级政府：乡民族乡镇
   - 其他县级以上由国务院审批
** 国家标志
*** 国家标志
国家象征、代表国家的主权、独立和尊严。
*** 国旗、国歌、国徽和首都
1. 《宪法》第四章明确规定国家标志，并且规定了下位法。
   - 每日升挂国旗：两门五委两央两高出入境外哨
   - 工作日升挂国旗
   - 学校除寒暑假和休息日外应当每日升挂国旗。有条件的幼儿园
     公共文化体育设施
   - 很多地方应当升挂
2. 下列场合应当奏唱国歌
   - 人大政协开闭幕
   - 宪法宣誓、升国旗、机关重大庆典
   - 国家公祭、重大外交、体育
3. 应当悬挂国徽
   - 各级大人常委会、人民政府、军委、监察委
   - 国务院驻港澳
   - 网站首页
** 民族区域自治制度
*** 民族区域自治制度的概念
以少数民族聚居区为基础、实行民族自治。
这是同时民族自治且区域自治。
: 高考加分：少数民族聚居地的少民。
*** 民族自治地方的自治机关
1. 自治地方：自治区、自治州、自治县
   : 民族乡不是民族自治地方。
2. 自治地方：自治地方的人大和人民政府。
   人大常委会、法院等都不是自治机关。
3. 自治地方主席州长县长（政府）由当地民族公民担任。
   其人大常委会只需满足主任或副主任的民族限制。
*** 民族自治地方的自治权
1. 民族自治地方有权制定自治条例和单行条例。而不包括人大常委会
   : 涉及民族特点的只定民族自治法规、涉地方特点的只定地方性法规。
2. 上级国家机关指示不适合民族自治地方情况的，可上报变通执行或停止执行。
3. 民族自治地方的财政是一级财政，由自治机关管理，同时享受上级财政照顾。
   预备费可高于一般地区、自行安排使用收入超收与支出结余。
   自治州县减税或免税、报省级政府批准。
4. 经国务院批准，可以进行边境贸易。
5. 自治区州可以和国外进行教科文卫体的交流。
6. 组织维护治安的公安部队
7. 使用本民族的语言文字
** 特别行政区制度
特别行政区内的制度由全国人大以法律规定。
*** 特别行政区的概念和特点
1. 概念：地方行政区域单位
2. 特点
   1) 高度自治权
      行政管理权、自治范围内立法、独立司法权、国务院授权对外权限
      : 在非政治领域以“中国香港”“中国澳门”的名义参与会议、建立关系
   2) 保持原有资本主义制度和生活方式50年不变
   3) 特区行政机关和立法机关由该地永久性居民依法组成。
   4) 特区原有法律除殖民统治性质的法律以外基本不变
*** 中央与特别行政区的关系
特区直辖于中央人民政府。
- 全国人大：制定修改特区基本法
- 全国人大常委会：解释基本法
   : 2016香港四议员宣誓事件，使得常委会解释基本法第107条
- 中央人民政府：管理特别行政区的外交事务、任免特区行政长官
*** 特别行政区国家机关
1. 特区公职人员就职宣誓（就职的法定条件、必经程序）
   1) 宣誓主体：行政长官、主要官员、行政会议成员、立法会议员、各级法院法官、
    其他司法人员、宣誓拥护基本法，效忠特区、（澳门）效忠中华人民共和国
   2) 所作宣誓无效、则丧失就任公职的资格、不得重新安排宣誓
   3) 必须在法律规定的监誓人面前进行
2. 特别行政区行政长官
   1) 特首：年满40周岁、居住连续满20年、（香港特首）在外国无居留权
   2) 特首经选举或协商产生，中央人民政府任命、任期5年，可连任一次
3. 特区行政机关
   1) 香港：司局处署，澳门：司局厅处。主要官员由行政长官提名
   2) 特区职权
4. 立法机关：立法会
   1) 立法权。法律由行政长官签署公友方有法律效力、报全国人大常委会备案。
      备案不影响法律生效。
      人大常委在征询基本法委员会的意见后可将法律发回，一经发回立即失效。
      不同于撤销或修改，且没有溯及力。
      : 立法会有八成中国人
   2) 财政权，财政预算案
      - 地方政府，收入全部上交给国家
      - 自治机关，上交大头，留下自治经济的小头，国家转移支付
      - 特区，不上交，只把预算案报备不需报批
   3) 监督权，可弹劾行政长官，报请中央人民政府决定。
5. 司法机关
   1) 司法组织系统
      香港：终审法院、高等法院、区域法院、裁判署法庭和其他专门法庭
      : 检察机关属于行政机关
      : 因为香港是英美法系
      : 有首席大法官而无院长
      澳门：检察院、法院（终审法院、中级法院、初级法院、行政法院）
      : 法院又有行政法院这个行政机关
   2) 特区法官由当地 /独立委员会/ 推荐、行政长官任命
      澳门检察官经检察长提名、行政长官任命
      香港终审法院法官和高等法院首席法官由在外国无居留权的香港永久性居民担任
      任免由行政长官征得立法会同意，报全国人大常委会备案。
      : 因为这些法官都是外国人，英美法系判例法系法官
      澳门终审法官的免职由行政长官根据立法会议成员组成的审议委员会建议决定，
      任免须报全国人大常委会备案。

*** 特别行政区的法律制度
1. 特区基本法
   1) 特区基本法根据我国宪法、由全国人大制定。
      反映了包括港澳同胞在内的全国人民的意志和利益。
   2) 基本法地位仅低于宪法。
2. 予以保留的原有法律。
3. 特区制定的法
4. 特区基本法附件三所列举的法律
   : 全国性法律一般不在特区实施，例外是附件三以及国务院发布命令在特区实施的。
   1) 附件三很多
   2) 澳门与香港附件三基本相同
      : 澳门有两个法律不同：驻军的特区名称，以及领海声明（香港是港口）
