public_html/理论法.html
<li><a id="org652fe1d"></a>宪法宣誓<br />
<div class="outline-text-4" id="text-org652fe1d">
<ol class="org-ol">
<li>宪法宣誓的概念
我国 18 宪法修正案规定：宣誓人员为国家工作人员、
宣誓应当在就职时进行、宣誓应当公开进行、宣誓具体制度由法律规定</li>
<li>宣誓主体：国家工作人员
宣誓仪式的组织：谁产生谁组织
宣誓方式</li>
<li>宪法宣誓的功能</li>
</ol>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org8b2f41e" class="outline-2">
<h2 id="org8b2f41e">国家的基本制度</h2>
<div class="outline-text-2" id="text-org8b2f41e">
</div>
<div id="outline-container-org0bbe340" class="outline-3">
<h3 id="org0bbe340">国家的基本政治制度</h3>
<div class="outline-text-3" id="text-org0bbe340">
</div>
<ul class="org-ul">
<li><a id="orgcabe632"></a>我国的国家性质与政权组织形式<br />
<div class="outline-text-4" id="text-orgcabe632">
<ul class="org-ul">
<li>国家性质：社会主义</li>
<li>根本制度：社会主义制度</li>
<li>根本政治制度：人民代表大会制度</li>
</ul>
</div>
</li>
<li><a id="orgf368065"></a>我国人民民主专政的主要特色<br />
<div class="outline-text-4" id="text-orgf368065">
<p>
主要特色：中国共产党领导的多党合作和政治协商制度、爱国统一战线
</p>
<ol class="org-ol">
<li>中国共产党领导的多党合作和政治协商制度
在根本上区别于西方两党制和多党制，有别于其他社会主义国家的政党制。
<ul class="org-ul">
<li>中共是执政党，民主党派是亲密友党、参政党</li>
<li>政治基础：坚持中共领导、坚持四项基本原则
基本方针：长期共存、互相监督、肝胆相照、荣辱与共</li>
<li>领导方式：政治领导。各民主党派有政治自由、组织独立、法律地位平等</li>
</ul></li>
<li>爱国统一战线
<ol class="org-ol">
<li>劳动者、建设者、爱国者、爱国者的政治联盟</li>
<li>主要任务：建设、回归、世界和平</li>
<li><p>
组织形式：中国人民政治协商会议“政协”
政协不是国家机关，也不同于一般的人民团体。
</p>
<pre class="example">
国家机关是全国人大及其派生的机关。政协比人大出现得还要早
人民团体以群众性为主，受党领导。政协不同于此。
全国人大召开会议时，全国政协委员列席。
</pre></li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org7daf968"></a><span class="done _">✘</span> 中国共产党的领导是中国特色社会主义最本质的特征<br /></li>
<li><a id="org89cc585"></a>我国的人民代表大会制度<br />
<div class="outline-text-4" id="text-org89cc585">
<ol class="org-ol">
<li>政权组织形式概述
资本主义：二元君主立宪、议会君主立宪、总统、议会共和、委员会、半总统半议会
社会主义：人民代表制
实现社会主义民主的基本形式：人民代表大会制度</li>
<li>我国人民代表制度的基本内容
<ol class="org-ol">
<li>人民主权，正当性的来源</li>
<li>全国和地方人大、人民掌握和行使国家权力的组织形式</li>
<li><p>
人大代表由人民选举、受人民监督
</p>
<pre class="example">
谁产生我，我就受谁监督
</pre></li>
<li>各级人大的国家权力机关、其他国家机关都由人大产生</li>
</ol></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org689a0da" class="outline-3">
<h3 id="org689a0da">国家的基本经济制度</h3>
<div class="outline-text-3" id="text-org689a0da">
<p>
自德国魏玛宪法以来，经济制度便成为现代宪法的重要内容之一。
</p>
</div>
<ul class="org-ul">
<li><a id="org3d62f22"></a>社会主义市场经济体制<br />
<div class="outline-text-4" id="text-org3d62f22">
<p>
93 修正案“国家实行社会主义市场经济”
</p>
<ol class="org-ol">
<li>社会主义公有制是我国经济制度的基础
国家财产包括：
<ul class="org-ul">
<li>主要部分“国家挖矿开公司”
<ul class="org-ul">
<li>国有自然资源
<ul class="org-ul">
<li>绝对全民所有：矿藏、水流、海域、城市的土地</li>
<li>可全民可集体：森林、草原、农村和城市郊区的土地</li>
<li><p>
绝对集体所有：农村宅基地、自留地、自留山
</p>
<pre class="example">
所谓以家庭为生产单位的集体经济组织形式。
</pre></li>
</ul></li>
<li>国有企业 
<ul class="org-ul">
<li>93 年以前称国营经济</li>
<li>93 年修正案后称国有经济</li>
</ul></li>
</ul></li>
<li>重要部分：国家机关、事业单位、部队等全民单位的财产</li>
</ul></li>
<li>非公有制经济是社会主义市场经济的重要组成部分。
包括：劳动者个体经济和私营经济，以及外商投资。</li>
</ol>
</div>
</li>
<li><a id="org8fbcb20"></a>国家保护社会主义公共财产和公民合法私有财产<br />
<div class="outline-text-4" id="text-org8fbcb20">
<ol class="org-ol">
<li>公共财产
社会主义的公共财产神圣不可侵犯。</li>
<li>私有财产
公民的合法的私有财产不受侵犯。
非公有制经济财产权同样不可侵犯。</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orge422f65" class="outline-3">
<h3 id="orge422f65">国家的基本文化制度</h3>
<div class="outline-text-3" id="text-orge422f65">
</div>
<ul class="org-ul">
<li><a id="org98ba373"></a>文化制度在各国宪法中的表现<br />
<div class="outline-text-4" id="text-org98ba373">
<ol class="org-ol">
<li>资产阶级宪法，1919 德国魏玛宪法规定了公民的 <i>文化权利</i> ，
还规定了国家的 <i>基本文化政策</i> ，第一次比较全国系统地规定了文化制度</li>
<li>社会主义宪法一般宣布社会主义文化是大众文化。</li>
<li><p>
二战以后，世界各国宪法分为资本主义、社会主义和民族民主主义的文化制度。
</p>
<pre class="example">
民族民主主义：如南美洲。
</pre></li>
</ol>
</div>
</li>
<li><a id="org05ed896"></a>我国宪法关于基本文化制度的规定<br />
<div class="outline-text-4" id="text-org05ed896">
<p>
现行宪法明确规定了国家发展教、科、文、道德教育。
</p>
<ol class="org-ol">
<li>教育事业</li>
<li>科学事业</li>
<li>文学艺术及其他文化事业</li>
<li>公民道德教育</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org056eda9" class="outline-3">
<h3 id="org056eda9">国家的基本社会制度</h3>
<div class="outline-text-3" id="text-org056eda9">
</div>
<ul class="org-ul">
<li><a id="orga11c53e"></a>基本社会制度的概念<br />
<div class="outline-text-4" id="text-orga11c53e">
<ul class="org-ul">
<li>广义：基本政治、经济、文化制度等总和</li>
<li>中义：相对于政治、经济、文化、生态而言的制度体系</li>
<li>狭义：社保</li>
</ul>
</div>
</li>
<li><a id="org06aaaf5"></a>我国现行宪法对基本社会制度的规定<br />
<div class="outline-text-4" id="text-org06aaaf5">
<p>
六方面：
</p>
<ul class="org-ul">
<li>社会保障制度</li>
<li>医疗卫生事业</li>
<li>劳动保障制度</li>
<li>人才培养制度</li>
<li>计划生育制度</li>
<li>社会秩序及安全维护制度</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org9981484" class="outline-3">
<h3 id="org9981484">国家结构形式</h3>
<div class="outline-text-3" id="text-org9981484">
</div>
<ul class="org-ul">
<li><a id="org6761263"></a>我国的国家结构形式<br />
<div class="outline-text-4" id="text-org6761263">
<ol class="org-ol">
<li>现代国家的结构形式：单一制或联邦制。</li>
<li>我国的单一制的国家结构形式
<ol class="org-ol">
<li>一宪：我国只有一套以宪法为基础的法律体系。</li>
<li>一体系：我国只有一套中央国家机关体系。</li>
<li>一籍：中国是一个统一的国际法主体，具有统一的中国国籍</li>
<li>央统地：中央人民政府领导其下的地方行政区域。</li>
</ol></li>
<li>特点：
建立民族区域自治制度解决单一制下民族问题
建立特别行政区制度解决单一制历史遗留问题</li>
</ol>
</div>
</li>
<li><a id="org2091bfc"></a>我国现行的行政区域划分<br />
<div class="outline-text-4" id="text-org2091bfc">
<ol class="org-ol">
<li>行政区划是一种有目的的国家活动、属于国家内政。
必须有宪法和法律以及有关法规的授权。</li>
<li>全国分为省、自治区、直辖市，设一些特别行政区。
省/自治区分为自治州/县/自治县/市
直辖市和较大的市分为区/县
<ul class="org-ul">
<li>自治州分为县/自治县</li>
<li>县/自治县分为乡/民族乡/镇</li>
</ul></li>
<li>三种行政区划：普通行政区划、民族自治地方区划、特别行政区划。</li>
</ol>
</div>
</li>
<li><a id="orgd62feea"></a>行政区域变更的法律程序<br />
<div class="outline-text-4" id="text-orgd62feea">
<ol class="org-ol">
<li>行政区划争议处理由民政部处理。</li>
<li>行政区域变更法律予
<ul class="org-ul">
<li>全国人大：批准省自治区直辖市特别行政区</li>
<li>省级政府：乡民族乡镇</li>
<li>其他县级以上由国务院审批</li>
</ul></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org300a4df" class="outline-3">
<h3 id="org300a4df">国家标志</h3>
<div class="outline-text-3" id="text-org300a4df">
</div>
<ul class="org-ul">
<li><a id="org87ee27e"></a>国家标志<br />
<div class="outline-text-4" id="text-org87ee27e">
<p>
国家象征、代表国家的主权、独立和尊严。
</p>
</div>
</li>
<li><a id="org73529ad"></a>国旗、国歌、国徽和首都<br />
<div class="outline-text-4" id="text-org73529ad">
<ol class="org-ol">
<li>《宪法》第四章明确规定国家标志，并且规定了下位法。
<ul class="org-ul">
<li>每日升挂国旗：两门五委两央两高出入境外哨</li>
<li>工作日升挂国旗</li>
<li>学校除寒暑假和休息日外应当每日升挂国旗。有条件的幼儿园
公共文化体育设施</li>
<li>很多地方应当升挂</li>
</ul></li>
<li>下列场合应当奏唱国歌
<ul class="org-ul">
<li>人大政协开闭幕</li>
<li>宪法宣誓、升国旗、机关重大庆典</li>
<li>国家公祭、重大外交、体育</li>
</ul></li>
<li>应当悬挂国徽
<ul class="org-ul">
<li>各级大人常委会、人民政府、军委、监察委</li>
<li>国务院驻港澳</li>
<li>网站首页</li>
</ul></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org2cd048d" class="outline-3">
<h3 id="org2cd048d">民族区域自治制度</h3>
<div class="outline-text-3" id="text-org2cd048d">
</div>
<ul class="org-ul">
<li><a id="orgf3dab63"></a>民族区域自治制度的概念<br />
<div class="outline-text-4" id="text-orgf3dab63">
<p>
以少数民族聚居区为基础、实行民族自治。
这是同时民族自治且区域自治。
</p>
<pre class="example">
高考加分：少数民族聚居地的少民。
</pre>
</div>
</li>
<li><a id="org1bcd833"></a>民族自治地方的自治机关<br />
<div class="outline-text-4" id="text-org1bcd833">
<ol class="org-ol">
<li><p>
自治地方：自治区、自治州、自治县
</p>
<pre class="example">
民族乡不是民族自治地方。
</pre></li>
<li>自治地方：自治地方的人大和人民政府。
人大常委会、法院等都不是自治机关。</li>
<li>自治地方主席州长县长（政府）由当地民族公民担任。
其人大常委会只需满足主任或副主任的民族限制。</li>
</ol>
</div>
</li>
<li><a id="org3fb5815"></a>民族自治地方的自治权<br />
<div class="outline-text-4" id="text-org3fb5815">
<ol class="org-ol">
<li><p>
民族自治地方有权制定自治条例和单行条例。而不包括人大常委会
</p>
<pre class="example">
涉及民族特点的只定民族自治法规、涉地方特点的只定地方性法规。
</pre></li>
<li>上级国家机关指示不适合民族自治地方情况的，可上报变通执行或停止执行。</li>
<li>民族自治地方的财政是一级财政，由自治机关管理，同时享受上级财政照顾。
预备费可高于一般地区、自行安排使用收入超收与支出结余。
自治州县减税或免税、报省级政府批准。</li>
<li>经国务院批准，可以进行边境贸易。</li>
<li>自治区州可以和国外进行教科文卫体的交流。</li>
<li>组织维护治安的公安部队</li>
<li>使用本民族的语言文字</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org8c33784" class="outline-3">
<h3 id="org8c33784">特别行政区制度</h3>
<div class="outline-text-3" id="text-org8c33784">
<p>
特别行政区内的制度由全国人大以法律规定。
</p>
</div>
<ul class="org-ul">
<li><a id="org072507c"></a>特别行政区的概念和特点<br />
<div class="outline-text-4" id="text-org072507c">
<ol class="org-ol">
<li>概念：地方行政区域单位</li>
<li>特点
<ol class="org-ol">
<li><p>
高度自治权
行政管理权、自治范围内立法、独立司法权、国务院授权对外权限
</p>
<pre class="example">
在非政治领域以“中国香港”“中国澳门”的名义参与会议、建立关系
</pre></li>
<li>保持原有资本主义制度和生活方式50年不变</li>
<li>特区行政机关和立法机关由该地永久性居民依法组成。</li>
<li>特区原有法律除殖民统治性质的法律以外基本不变</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="orgad3fa89"></a>中央与特别行政区的关系<br />
<div class="outline-text-4" id="text-orgad3fa89">
<p>
特区直辖于中央人民政府。
</p>
<ul class="org-ul">
<li>全国人大：制定修改特区基本法</li>
<li><p>
全国人大常委会：解释基本法
</p>
<pre class="example">
2016香港四议员宣誓事件，使得常委会解释基本法第107条
</pre></li>
<li>中央人民政府：管理特别行政区的外交事务、任免特区行政长官</li>
</ul>
</div>
</li>
<li><a id="orgf16ce0c"></a>特别行政区国家机关<br />
<div class="outline-text-4" id="text-orgf16ce0c">
<ol class="org-ol">
<li>特区公职人员就职宣誓（就职的法定条件、必经程序）
<ol class="org-ol">
<li>宣誓主体：行政长官、主要官员、行政会议成员、立法会议员、各级法院法官、
其他司法人员、宣誓拥护基本法，效忠特区、（澳门）效忠中华人民共和国</li>
<li>所作宣誓无效、则丧失就任公职的资格、不得重新安排宣誓</li>
<li>必须在法律规定的监誓人面前进行</li>
</ol></li>
<li>特别行政区行政长官
<ol class="org-ol">
<li>特首：年满40周岁、居住连续满20年、（香港特首）在外国无居留权</li>
<li>特首经选举或协商产生，中央人民政府任命、任期5年，可连任一次</li>
</ol></li>
<li>特区行政机关
<ol class="org-ol">
<li>香港：司局处署，澳门：司局厅处。主要官员由行政长官提名</li>
<li>特区职权</li>
</ol></li>
<li>立法机关：立法会
<ol class="org-ol">
<li><p>
立法权。法律由行政长官签署公友方有法律效力、报全国人大常委会备案。
备案不影响法律生效。
人大常委在征询基本法委员会的意见后可将法律发回，一经发回立即失效。
不同于撤销或修改，且没有溯及力。
</p>
<pre class="example">
立法会有八成中国人
</pre></li>
<li>财政权，财政预算案
<ul class="org-ul">
<li>地方政府，收入全部上交给国家</li>
<li>自治机关，上交大头，留下自治经济的小头，国家转移支付</li>
<li>特区，不上交，只把预算案报备不需报批</li>
</ul></li>
<li>监督权，可弹劾行政长官，报请中央人民政府决定。</li>
</ol></li>
<li>司法机关
<ol class="org-ol">
<li><p>
司法组织系统
香港：终审法院、高等法院、区域法院、裁判署法庭和其他专门法庭
</p>
<pre class="example">
检察机关属于行政机关
因为香港是英美法系
有首席大法官而无院长
</pre>

<p>
澳门：检察院、法院（终审法院、中级法院、初级法院、行政法院）
</p>
<pre class="example">
法院又有行政法院这个行政机关
</pre></li>
<li><p>
特区法官由当地 <i>独立委员会</i> 推荐、行政长官任命
澳门检察官经检察长提名、行政长官任命
香港终审法院法官和高等法院首席法官由在外国无居留权的香港永久性居民担任
任免由行政长官征得立法会同意，报全国人大常委会备案。
</p>
<pre class="example">
因为这些法官都是外国人，英美法系判例法系法官
</pre>

<p>
澳门终审法官的免职由行政长官根据立法会议成员组成的审议委员会建议决定，
任免须报全国人大常委会备案。
</p></li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org56feb5b"></a>特别行政区的法律制度<br />
<div class="outline-text-4" id="text-org56feb5b">
<ol class="org-ol">
<li>特区基本法
<ol class="org-ol">
<li>特区基本法根据我国宪法、由全国人大制定。
反映了包括港澳同胞在内的全国人民的意志和利益。</li>
<li>基本法地位仅低于宪法。</li>
</ol></li>
<li>予以保留的原有法律。</li>
<li>特区制定的法</li>
<li><p>
特区基本法附件三所列举的法律
</p>
<pre class="example">
全国性法律一般不在特区实施，例外是附件三以及国务院发布命令在特区实施的。
</pre>

<ol class="org-ol">
<li>附件三很多</li>
<li><p>
澳门与香港附件三基本相同
</p>
<pre class="example">
澳门有两个法律不同：驻军的特区名称，以及领海声明（香港是港口）
</pre></li>
</ol></li>
</ol>
</div>
</li>
