src/理论法.org
*** 特别行政区维护国家安全的宪制责任（2020）
1. 维护国家安全，香港安全风险
2. 一国两制的一国是实行两制的前提和基础
3. 人大《决定》授权全国人大常委会制定法律。制定为《国安法》
4. 《决定》内容：
   1) 反制境外势力
   2) 国家安全立法
   3) 健全维护国家安全，依法惩治危害国家安全的行为
   4) 行政长官应定期向中央人民政府提交报告
   5) 相关法律列入附件三

** 基层群众自治制度
即村委会和居委会。“组织独立、事务自决”
1. 群众性
2. 自治性，基层群众自治组织不是国家机关，具有自身组织上的独立性。
3. 基层性。
*** 村民会议和村民委员会
1. 村民会议
   - 18周岁以上村民组成
   - 村民过半数或2/3以上户代表参加
   - 审议村委会工作报告
2. 村民委员会
   1) 其设立撤销由乡人民政府提出，经村民会议讨论同意，报县人民政府批准
   2) 组成
      主任、副主任、委员。18岁未剥夺政治权力的村民直接选举产生
   3) 任免
      - 选任
        任何组织个人不得指定委派撤换村委会成员，只能通过村民选举产生
        登记参加选举的过半数投票，选举有效
        候选人获得过半数选票，当选
      - 职务解除
        罢免：村民或村民代表联名要求、过半数投票通过
        连续2次被评议不称职
        丧失行为能力或被判处刑罚
   4) 村务管理
   5) 村民自治章程由村民会议制定和修改
      报乡人民政府备案
   6) 违法行为纠正
      村委会的决定侵害村民合法权益的，申请人民法院予以撤销
      村委会不依法履行义务的，由乡政府责令改正
*** 居民委员会
1. 其设立由不设区的市（县级市）的人民政府决定
2. 主任、副主任、委员。任期5年，可以连任
3. 重大问题必须提请居民会议讨论决定，报市人民政府或其派出机关
** 人大代表选举制度
城乡代表名额分配比例平等。
*** 我国选举制度的基本原则
四原则：普遍性、平等性、直接选举和间接选举并用、秘密投票
1. 普遍性原则
   “中国国籍、年满十八、既没发疯、也没被抓
   如果被抓，判前看检法（决定停止当事人行使）、判后看附加（剥夺政治权力）”
2. 平等性原则
   1) 选民平等享有选举权和被选举权
   2) 选民投票权平等
   3) 每一代表代表的选民人数相同
   4) 代表法律地位平等
   5) 对处于弱势地位的选民给予特殊保护性规定，这不破坏平等性
   既着眼于机会平等，同时重视实质平等。
3. 直接选举和间接选举并用
   省市级人大代表由下一级人大选举，乡县级人大代表由选民直接选举。
4. 秘密投票原则
   秘密填写选票、不标识选民身份，不显露选举意向。
*** 选举的主持机构
1. 直接选举
   乡县级选举委员会由县级人大常委会任命领导，受省市级人大常委会指导。
   选举委员会成员成为代表候选人，应当辞去选举委员会职务。
2. 间接选举
   : 高级人大派发名额到低级人大
   1) 各级常委会主持本级人大代表选举
   2) 县及以上选举上一级人大代表时由该级人大主席团主持。
*** 选举程序
1. 选区划分和选民登记
   1) 直接选举才有选区划分，间接选举称选举单位。
   2) 一次登记，长期有效
      : 登记后长期作为选民
   3) 经选举委员会确认精神病患者不列入选民名单
      : 比如精神病院不能断定取消选民权
   4) 选民名单在选举日20日以前公布
   5) 有意见的在名单公布之日起5日内向选举委员会提出异议
      委员会在3日内作出处理意见
      不服处理的在选举日5日以前起诉
      法院在选举日以前作出判决
2. 政党、人民团体、10人以上的选民或代表可以推荐代表候选人。
   选举上一及人大代表时，候选人 /不限于本级人大代表/ 。
3. 候选人名单
   直接选举，选举日15日以前公布，超过差额比例则预选，正式候选人在7日前公布。
   间接选举，提名候选人的时间不少于2天，如超过差额比例则预选。
4. 投票和当选
   直接选举，“双过半”当选。
   委托投票：选委会同意、书面委托、一人接受委托不超过3人，按委托人意愿投票
   间接选举，全体代表过半数选票。
5. 代表资格审查
   代表资格审查委员会审查当选代表是否符合宪法、法律规定的代表基本条件，
   选举是否符合法符规定程序，是否存在破坏选举的违法行为。
   审查结果向人大常委会或乡级人大主席团报告（乡级没有常委会）
   县级以上人大常委会或乡级人大主席团确认代表资格或确认无效
6. 特区、台湾省全国人大代表
   特区全国人大代表，首先是特区全国人大代表选举会议，
   选举会议名单由全国人大常委会公布，第一次会议由全国人大常委会主持
   台湾省13人全国人大代表，来自台湾省籍同胞。全国人大常委会规定代表产生
*** 人大代表的罢免、辞职和补选
- 人大代表被罢免“谁产生我，谁罢免我”
  + 直接选举：原选区选民联名提出罢免案
  + 间接选举： /选举他的/ 大会主席团或代表或人大常委会主任会议或常委会成员联名
- 人大代表辞职
  + 直接选举：乡级代表向乡级大人，县级代表向县级人大“在哪上班，向谁辞职”
  + 间接选举：向选举他的人大常委会“谁产生我，向谁辞职”
- 人大代表补选
  由原选区或选举单位补选，可以差额选举。
  较少缺额可以用人大常委会补上出缺，否则要临时再开人大。
*** 选举的物质保障和法律保障
1. 各级人大选举经费列入财政预算。由国库统一开支。
   : 国库指政府的储备，不是中央财政。
2. 不得同时担任两个以上无隶属关系的行政区域的人大代表。
   : 2008梁广镇案，同时担任两个市的人大代表。
3. 不得直接或间接接受境外资助。违反的不列入代表候选人名单、除名、当选无效。
* 公民的基本权利与义务
** 公民基本权利与义务概述
*** 公民基本权利与基本义务
   1. 基本权利的主体主要是公民。中国宪法仅规定外国人可以给予受庇护的权利。
   2. 四个特点
      - 公民在国家生活中的宪法地位
      - 公民在社会生活中最主要最基本又不可缺到的权利
      - 具有母体性，派生出具体法律权利
      - 稳定性和排他性，与人的公民资格关系密切
   3. 基本义务（宪法义务）
      公民必须遵守的法律义务，构成法律义务的基础。
*** 基本权利的限制
   1. 定义：确定基本权利的范围，限制基本权利主体和基本权利具体活动形式。
      - 剥夺一部分主体的权利，剥夺罪犯政治权利
      - 停止行使某种基本权利
        : 如检察院停止被抓的人的选举权
      - 限制一些特殊主体，如公务员的政治活动、军人的政治权利。
   2. 目的：我国公民在行使自由和权利时不得损害国家社会集体的利益。
   3. 基本形式
      - 基本权利的内在限制
        * 基本权利本身的限制，由宪法规定基本权利时的界定
        * 具体附加文句的范围限定，如游行示威时不得侵犯他人的权利与自由
      - 宪法和法律对基本权利的限制
        * 通过宪法限制基本权利
        * 通过法律限制基本权利。比如法律的一般保留或个别保留
   4. 紧急状态下公民基本权利的限制
      此时，限制基本权利只能基于维护公共利益和他人的基本权利的目的。
      应当体现合理原则、不超过必要限度。
      : 如反恐怖主义法可以限制公民权利，要求快递开箱检查
*** 我国基本公民权利义务的主要特点
四个特点：广泛性、平等性、现实性、一致性。
1. 广泛性
   - 主体广泛。劳动者、社会主义爱国者、祖国统一爱国者、
     社会主义建设者、伟大复兴爱国者。
     即使被剥夺政治权利，也仍然有公民权利。
   - 范围广泛。政治、经济、文化、教育、人身等。
2. 平等性
   - 享有权利与履行义务一律平等。
     * 公民平等权利与义务
     * 国家机关不得歧视公民
     * 不允许任何宪法和法律规定以外的特权
   - 司法适用法律一律平等。
3. 现实性
   - 内容现实性。确实需要的，能做到的就规定。
   - 既有物质保障，又有法律保障。
4. 一致性
   - 主体是一致的。（行使基本权利不以基本义务的履行为条件）
   - 某些权利和义务是相互结合的。如劳动和受教育。
   - 基本权利和义务相互促进，相辅相成。
        
** 我国公民的基本权利
注意：一些权利赋予的是特定的公民主体
- 劳动权： /有劳动能力/ 的公民
- 休息权：劳动者
- 社会保障权：企事业单位职工和国家机关工作人员
- 物质帮助权：年老疾病或丧失劳动能力的公民
- 财产权、受教育权、文化权利和自由：公民
  社会经济文化教育权利主要是积极受益权、但财产和继承权是消极受益权。
: 积极受益权是公民主动向国家提出请求、消极受益权则不能主动提出请求权利。
: 宪法没有明确规定 /生命权/ 。
: 除私有财产权和继承权规定在总纲中，其他权利都规定在第二章的权利与义务。
*** 平等权
1. 概念：公民依法平等享有权利，不受任何差别对待。
2. 基本内容
   1) 法律面前一律平等
   2) 禁止差别对待
   3) 允许合理差别
      - 法律禁止不合理的差别，允许合理差别。
      - “合理差别”包括：符合人的尊严、公共利益、手段与目的存在合理联系。
3. 特定主义与具体表现
   1) 保障妇女权利，男女同工同酬，培养和选拔妇女干部。
   2) 保障退休人员和军烈属的权利，实行国家机关工作人员退休制度，
      保障残废军人生活、抚恤烈士家属。
      : 退休制度是劳动者休息权的延伸。
   3) 保护婚姻、家庭、母亲、儿童和老人。
   4) 关怀青少年和儿童的成长。
   5) 保护华侨、归侨和侨眷的正当权利。
*** 政治权利和自由
公民依法享有参加国家政治生活的权利和自由。
1. 选举权和被选举权
   政治权利即选举权和被选举权。
   指选民依法选举代议机关代表和被选为代议机关代表的权利。
   我国公民的选举权是普选权。
2. 政治自由
   公民表达自己政治意愿的自由。包括言论、出版、集会、结社、游行、示威。
   1) 言论自由
      在各项政治自由中居于首要地位。表现形式多样，存在法定界限。
   2) 出版自由
      - 公民通过公开出版物表达自己的见解和看法的自由，是言论自由的延伸。
        包括著作自由和出版单位的设立与管理制度。
      - 对出版物的管理有预防制和追惩制，我国实行预防追惩制结合
   3) 结社自由
      - 言论自由的进行步延伸，若干公民集合起来方能实现。
      - 两类公民结社：营利性结社（公司）和非营利性结社，
        后者如政治性结社（政党）和非政治性结社（宗教、慈善、文化艺术团体）
        结社自由即组织政治性团体的自由。
      - 社团成立实行核准登记制度，由民政部和地方人民政府民政部门管理。
        社团不得从事以营利为目的的经营性活动。
   4) 集会游行示威自由
      是言论自由的延伸和具体化，源于公民的请愿权。
      在公共场所，多个公民共同行使、属于集合性权利。
      三者的不同之处在于表达意愿的程度、方式和方法。
*** 宗教信仰自由
定义：公民依据内心的信念，自愿地信仰宗教的自由。
宗教团体坚持自主、自办、自传的“三自”原则。
: 宗教而非邪教
: 信教不可传教
*** 人身自由
特点：公民参加各种社会活动和实际享受其他权利的前提。
- 狭义人身自由：公民的身体不受非法侵犯。
- 广义人身自由：生命权、人格尊严、住宅不受侵犯
  通信自由和通信秘密等权利和自由。

1. 生命权
   1) 生命权是表示人类生存的自然意义上的权利，具有 /自然法/ 的性质。
      生命权是国家与社会的最高价值，生命权的维护是立法的基本出发点。
   2) 基本内容：防御权、享受生命的权利、生命保护请求权、生命权不可处分
   3) 生命权主体只能是自然人，不仅是公民而是人的权利。
2. 人身自由
   公民的肉身不受非法侵犯、不受非法限制、搜查、拘留和逮捕。
   必要时国家可以限制、剥夺特定公民的人身自由。
3. 人格尊严不受侵犯
   公民作为平等的人的资格和权利应受到国家承认和尊重。
   1) 姓名权。公民有权决定使用和改变自己的姓氏名称。
   2) 肖像权。公民有自主制作占有和使用其肖像的权利。
   3) 名誉权。享有适度的名声并维护名声不受侵害。
   4) 荣誉权。禁止非法剥夺公民法人的荣誉称号
   5) 隐私权。个人私事个人信息不为他人知悉，禁止他人干涉。
4. 住宅不受侵犯
   未经法律许可，不得随意进入，搜查或查封、侵占、损毁公民的住宅。
   关系到公民财产权、居住安全、生活安定和人身自由权利。
5. 通信自由和通信秘密
   1) 自由：公民传递消息和信息不受国家非法限制
      秘密：公民通信内容不受隐匿、毁弃、拆阅或窃听。
   2) 宪法保护合法通信自由，危害宪法秩序的行为不属于通信自由。  
