src/理论法.org
*** 社会经济权利
1. 财产权
   1) 公民对其合法财产享有不受非法侵犯的所有权。
      继承权是财产权的延伸。
   2) 财产权本质是实现自由的基本要求。
   3) 宪法规定了对财产的征收和征用，得到合理补偿。
2. 劳动权
   1) 有劳动能力的公民有权从事劳动并取得相应报酬。
   2) 劳动既是权利又是义务。
3. 劳动者的休息权
   劳动者可以休息和休养。
4. 获得物质帮助的权力
   老年人、患疾病公民、丧失劳动能力的公民
*** 文化教育权利
1. 受教育的权利
   1) 受教育既是权利也是义务。
   2) 基本内容
2. 进行科学研究、文学艺术创作和其他文化活动的自由
   国家鼓励帮助公民从事有益于人民的创造性工作。
*** 监督权和获得赔偿权
1. 监督权
   宪法赋予公民监督国家机关及其工作人员的活动的权利。
   对任何公职人员，有提出批评和建议的权利；
   对任何公职人员，有向国家机关提出申诉、控告或检举的权力。
   对公民的申诉、控告或检举，有关国家机关必须查清事实，负责处理。
2. 获得赔偿权
   1) 公民合法权利因国家机关 /违法/ 行使职权而受到侵害的可以要求国家赔偿。
   2) 国家赔偿分为行政赔偿和司法赔偿（冤狱赔偿）
   3) 致人精神损害、造成严重后果的，赔偿义务机关应当支付精神损害 /抚慰金/ 。
      : 不是赔偿金：赔偿要受法定约束。
** 我国公民的基本义务
1. 维护国家统一民族团结
2. 遵守宪法和法律，保守国家秘密，爱护公共财产，
   遵守劳动纪律，遵守公共秩序，尊重社会公德
3. 维护祖国的安全、荣誉和利益
4. 保卫祖国，依法服兵役和参加民兵组织
   1) 依法服兵役义务的主体是中国公民。
   2) 义务兵与志愿兵相结合、民兵与预备役相结合。
   3) 服兵役的条件，例外条件
   4) 不履行义务的，基层人民政府应当强制其履行兵役义务。
5. 依法纳税
   1) 纳税义务人依法向税收部门按一定比例缴纳税款。
      - 无偿性
      - 固定性
      - 强制性
      - 平衡性
   2) 纳税义务既包括自然人，也包括法人。
      外国人在我国拥有财产时也应依法纳税，但是驻华使馆、外交代表、官员等除外。
   3) 原则
      - 纳税平等与公平原则
      - 税收法定原则。
        : 法律保留：这一条是只能用法律规定的。
        双重性：一方面，纳税是国家财政的重要来源；
        另一方面，法定纳税义务防止国家权力侵犯公民财产。
   4) 纳税义务的履行也为纳税人带来相应的权利。
6. 其他基本义务
   劳动、受教育、计划生育、抚养教育未成年子女、赡养扶助父母。
* 国家机构
** 国家机构概述
1. 中央国家机构：全国人大派生以下七个机关：
   - 人大常委会
   - 国家主席
   - 国务院（中央人民政府）
   - 中央军事委员会
   - 国家监察委员会
   - 最高人民法院
   - 最高人民检察院
2. 县级以上地方国家机构
   - 人大：人大常委会
   - 人民政府
   - 监察委员会
   - 人民法院
   - 人民检察院
3. 乡镇级国家机构有人大和政府。
   人大没有常委会、地方没有监察委、法院、检察院。


集体负责制： /全体组成人员/ 集体讨论、少数服从多数。
: 除行政、军事以外的国家机构。
个人负责制： /首长个人/ 决定问题、承担相应责任。
: 国务院及人民政府（行政），中央军委（军事）
** [#A] 全国人大、全国人大常委会与各委员会
提示：
/全国人大/ 分派了非会议时的常务委员会与专门委员会。
而 /常委会/ 又分派了委员长会议、工作机构和办事机构，以及代表资格审查委员会。
工作机构包括：办公厅、港基会与澳基会。
/办公厅/ 又分派了其他工作。
*** 全国人大
1. 性质和地位
   最高国家权力机关、最高国家立法机关，代表人民统一行使最高权力。
2. 组成和任期
   不超过3000名，长期维持在2980名左右。
   /全国人大常委会/ 确定各选举单位代表名额比例的分配。
   遇到不能选举的非常情况，可以推迟选举，
   非常情况结束后一年内必须完成下届全国人大选举。
3. 会议制度和工作程序
   1) 常规会议，每年3月左右举行一次会议，会期10~12天。
   2) 临时会议， /人常/ 认为有必要或 /1/5以上的人大代表/ 提议。
   3) 全国人大会议由全国人大常委会召集。
      每届全国人大一次会议由 /上届/ 全国人大常委会召集，
      第二次起的历次会议均由人大选举的本届全国人大常委会召集。
      : 预备会议、正式会议
      : 预备会议由人常产生本次会议的人大主席团和秘书长
      : 主席团约180人，在台上负责主持会议，代表坐在人民大会堂一层
      : 秘书长负责会议材料分发
   4) 正式会议不同议程，主席团轮流担任大会会议的执行主席。
      常务主席召集并主持主席团会议。
   5) 所有会议须2/3以上代表出席。
   6) 全体会议公开举行。经主席团和各代表团团长会议决定可以举行秘密会议。
   7) 院军组成人员、两高首长列席会议（万人大礼堂二楼右侧）
      其他负责人（惯例）经主席团决定也可以列席会议
4. 全国大人职权：法钱人监定大事
   1) 法：修改和监督宪法；制定修改基本法律
   2) 钱：审批国民经济报告；审批国家预算报告
   3) 人：“国全军副其他定 其他全选举”
      + 根据国家主席的提名决定国务院总理的人选，
        根据国务院总理的提名决定副总理、国务委员、部长、委员会主任等，
        根据中央军委主席的提名决定军委副主席和委员等的人选。
      + 选举常委会、国家主席、副主席、中央军委主席；
      + 全国人大主席团、3个以上代表团、1/10以上代表联名提出罢免案
        主席团提请大会审议、全体代表过半数同意通过。
   4) 监：产生谁，监督谁
      + 人常、政府、法院、检察院向本级人大负责并报告工作
      + 例外：主席监军
        国家主席、监察委员会做专门报告，中央军委主席不报告工作。
   5) 定大事：建省设特、战和其他
*** 全国人大常委会
1. 性质和地位
   可行使国家立法权。
   人常对人大负责并报告工作。人大闭会期间，国务院和两高对人常负责。
2. 组成和任期
   1) 委员长、副委员长若干人、秘书长、委员若干人。必须是全国人大代表。
      还有一些专职委员。
   2) 人常成员不得兼任行政监察审判和检察机关职务。
   3) 委员长、副委员长连任不得超过两届。秘书长和委员无此限制。
3. 会议制度和工作程序
   1) 人常全体会议，每两月一次
   2) 人常委员长会议，由委员长、副委员长、秘书长组成，处理重要的日常工作
   3) 人常通过议案的提案、审议进行工作。
4. 主要职权：法钱人监定大事
   1) 法：释施宪、立修法、释法审规司解备
      - 解释宪法，制定和修改除应当人大制定的法律以外的法律，
        补充和修改人大制定的法律。
      - 解释法律，两央两高专委省常可要求法律解释
      - 撤销行政法规、审查民族自治法规
      - 两高的司法解释应向人常备案
   2) 钱：经社预部分、决算和审计
      - 审批国民经济报告国家预算的部分调整方案
      - 审批国家决算
      - 审议审计工作报告
   3) 人
      - 在全国人大闭会期间决定任免国家机关领导人员
        任免国务院部长、两委两高副职成员、军事法检正职、省级检察长
   4) 监
      监督两央察两院，包括：质问工作、法律实施检查、听取专项工作报告
   5) 定大事：约外衔、赦勋荣、战动紧、暂调用
      : 国家主席宣布、人常决定。
      - 决定批准或废除条约和重要协定、
        决定驻外全权代表任免、规定军人和外交人员的衔级制度
      - 决定特赦，规定和决定授予国家勋章和荣誉称号
      - 在闭会期间决定宣布战争状态
        决定全国总动员、决定进入紧急状态
      - 决定法律的暂停调整适用
5. 国家勋章和国家荣誉称号法
   共和国勋章、国家荣誉称号：委员长会议及国务院军委提议、国家主席授予
   友谊勋章
*** 人大各委员会
1. 常设性委员会
   1) 县级以上各级人大的专门委员会是人大常设的辅助性工作机构。
   2) 任期与人大任期相同。
      人选由人大主席闭在各级人大代表中提名，大会表决。
      人常可以补充任命个别副主任和部分委员。
   3) 人常可以任命一些非人大代表的专家做委员会的顾问。
      : 只有民族委员会可以调查民族问题，
      : 只有宪法和法律委员会可以处理委员会的法律问题。
2. 临时性委员会
   1) 对特定问题的调查委员会，组成人员必须是本级人大代表，没有任期。
   2) 设立
      人大主席团或1/10以上代表书面联名，可向本级人大提议设立。人大决定。
      闭会期间，委员长会议或主任会议、1/5以上常委会成员书面联名，
      可以向常委会会议提议设立。
   3) 可以聘请有关专家参加调查工作。
   4) 进行调查时，有关机关社团企事业组织公民有义务提供必要的材料。
      要求保密材料来源的应当予以保密，可以 /不公布调查情况和材料/ 。
*** 全国和地方各级人大代表
1. 人大代表权利
   1) 出席人大会议。
      每次会议召开前一个月，常委会把开会日期和主要事项通知
   2) 提出质询案。必须是 /人的集合/ 而非会议机构提出质询案
   3) 提出罢免案。
      全国人大主席团、3个以上代表团、1/10以上代表联名提出
      全体代表过半数通过。
   4) 人身受特别保护权
      非经本级人大主席团/人常 /许可/ ，不受逮捕或刑事审判及限制人身自由
      现行犯被拘留，公安机关向人大主席团或人常 /报告/ 。
   5) 参加各项选举和表决
   6) 信息物质等各项保障权
   7) 对各方面工作的建议批评和意见
   8) 言论免责权
      人大代表在人大各种会议上的 /发言和表决/ 不受法律追究。
   9) 其他权利，参观、视察等。
2. 人大代表义务
   1) 守法保密
   2) 按时出席人大会议
   3) 积极履职
   4) 加强学习和调查研究
   5) 与原选举单位和人民群众保持密切联系
   6) 自觉遵守社会公德
   7) 法律规定的其他义务
** 国家主席、国务院和中央军委
*** 中华人民共和国主席
1. 性质和地位
   国家机构，对内对外代表国家
2. 产生和任期
   国家主席、副主席由全国人大选举产生。任期同全国人大任期相同。
   - 有选举权和被选举权的中国公民
   - 年满45周岁
3. 职权
   公布法律、发布命令、宣布任命、外交权、荣典权。
   决定权在全国人大或其常委会。
   主席国事活动中，可以直接授予外国政要、国际友人等“友谊勋章”。
4. 补缺
   国家主席缺位时，副主席继任国家主席；
   副主席缺位时，全国人大补选。
   都缺位时，全国人大补选，全人常委员长暂理国家主席职位，等同于国家主席。
*** 国务院
1. 性质地位组成和任期
   国务院即中央人民政府，是最高国家权力机关的执行机关，最高国家行政机关。
   总理、副总理若干、国务委员若干、秘书长、各部部长、各委员会主任、审计长。
   : 中国人民银行行长属于国务院成员，如副总理朱镕基兼任行长。
   任期与全国人大相同，连任不超过两届。
2. 国务院首长负责制，各部委部长主任负责制。
   国务院全体会议、国务院常务会议。
3. 国务院职权
   1) 制定发布行政法规。
   2) 规定行政措施。
   3) 提出议案。（工作报告）
   4) 领导监督所属部委和地方各级行政机关。
   5) 领导管理国防民政文教经济生态文明。
   6) 行政人员任免奖权。
   7) 全国人大授予的职权，授权立法、进入紧急状态等。
4. 机构调整
   总理提出，全国人大及常委决定
5. 审计机关
   在总理领导下，依照法律规定独立行使审计监督权。
*** 中央军事委员会
1. 性质地位
   军委作为独立的国家机关领导全国的武装力量。
2. 组成、体制、成员任免
   主席、副主席若干人、委员若干人组成。主席负责制。
   全国人大选举或决定产生成员，全人常根据军委主席提名决定军委其他组成人员人选
   军委主席没有任期限制。
** 地方各级人大、人大常委会和地方各级人民政府
