public_html/理论法.html
<li><a id="orgb2618c1"></a>社会经济权利<br />
<div class="outline-text-4" id="text-orgb2618c1">
<ol class="org-ol">
<li>财产权
<ol class="org-ol">
<li>公民对其合法财产享有不受非法侵犯的所有权。
继承权是财产权的延伸。</li>
<li>财产权本质是实现自由的基本要求。</li>
<li>宪法规定了对财产的征收和征用，得到合理补偿。</li>
</ol></li>
<li>劳动权
<ol class="org-ol">
<li>有劳动能力的公民有权从事劳动并取得相应报酬。</li>
<li>劳动既是权利又是义务。</li>
</ol></li>
<li>劳动者的休息权
劳动者可以休息和休养。</li>
<li>获得物质帮助的权力
老年人、患疾病公民、丧失劳动能力的公民</li>
</ol>
</div>
</li>
<li><a id="org7e1efd6"></a>文化教育权利<br />
<div class="outline-text-4" id="text-org7e1efd6">
<ol class="org-ol">
<li>受教育的权利
<ol class="org-ol">
<li>受教育既是权利也是义务。</li>
<li>基本内容</li>
</ol></li>
<li>进行科学研究、文学艺术创作和其他文化活动的自由
国家鼓励帮助公民从事有益于人民的创造性工作。</li>
</ol>
</div>
</li>
<li><a id="org57e5d4e"></a>监督权和获得赔偿权<br />
<div class="outline-text-4" id="text-org57e5d4e">
<ol class="org-ol">
<li>监督权
宪法赋予公民监督国家机关及其工作人员的活动的权利。
对任何公职人员，有提出批评和建议的权利；
对任何公职人员，有向国家机关提出申诉、控告或检举的权力。
对公民的申诉、控告或检举，有关国家机关必须查清事实，负责处理。</li>
<li>获得赔偿权
<ol class="org-ol">
<li>公民合法权利因国家机关 <i>违法</i> 行使职权而受到侵害的可以要求国家赔偿。</li>
<li>国家赔偿分为行政赔偿和司法赔偿（冤狱赔偿）</li>
<li><p>
致人精神损害、造成严重后果的，赔偿义务机关应当支付精神损害 <i>抚慰金</i> 。
</p>
<pre class="example">
不是赔偿金：赔偿要受法定约束。
</pre></li>
</ol></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org4a4c4e8" class="outline-3">
<h3 id="org4a4c4e8">我国公民的基本义务</h3>
<div class="outline-text-3" id="text-org4a4c4e8">
<ol class="org-ol">
<li>维护国家统一民族团结</li>
<li>遵守宪法和法律，保守国家秘密，爱护公共财产，
遵守劳动纪律，遵守公共秩序，尊重社会公德</li>
<li>维护祖国的安全、荣誉和利益</li>
<li>保卫祖国，依法服兵役和参加民兵组织
<ol class="org-ol">
<li>依法服兵役义务的主体是中国公民。</li>
<li>义务兵与志愿兵相结合、民兵与预备役相结合。</li>
<li>服兵役的条件，例外条件</li>
<li>不履行义务的，基层人民政府应当强制其履行兵役义务。</li>
</ol></li>
<li>依法纳税
<ol class="org-ol">
<li>纳税义务人依法向税收部门按一定比例缴纳税款。
<ul class="org-ul">
<li>无偿性</li>
<li>固定性</li>
<li>强制性</li>
<li>平衡性</li>
</ul></li>
<li>纳税义务既包括自然人，也包括法人。
外国人在我国拥有财产时也应依法纳税，但是驻华使馆、外交代表、官员等除外。</li>
<li>原则
<ul class="org-ul">
<li>纳税平等与公平原则</li>
<li><p>
税收法定原则。
</p>
<pre class="example">
法律保留：这一条是只能用法律规定的。
</pre>

<p>
双重性：一方面，纳税是国家财政的重要来源；
另一方面，法定纳税义务防止国家权力侵犯公民财产。
</p></li>
</ul></li>
<li>纳税义务的履行也为纳税人带来相应的权利。</li>
</ol></li>
<li>其他基本义务
劳动、受教育、计划生育、抚养教育未成年子女、赡养扶助父母。</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org75ca0bf" class="outline-2">
<h2 id="org75ca0bf">国家机构</h2>
<div class="outline-text-2" id="text-org75ca0bf">
</div>
<div id="outline-container-org104e855" class="outline-3">
<h3 id="org104e855">国家机构概述</h3>
<div class="outline-text-3" id="text-org104e855">
<ol class="org-ol">
<li>中央国家机构：全国人大派生以下七个机关：
<ul class="org-ul">
<li>人大常委会</li>
<li>国家主席</li>
<li>国务院（中央人民政府）</li>
<li>中央军事委员会</li>
<li>国家监察委员会</li>
<li>最高人民法院</li>
<li>最高人民检察院</li>
</ul></li>
<li>县级以上地方国家机构
<ul class="org-ul">
<li>人大：人大常委会</li>
<li>人民政府</li>
<li>监察委员会</li>
<li>人民法院</li>
<li>人民检察院</li>
</ul></li>
<li>乡镇级国家机构有人大和政府。
人大没有常委会、地方没有监察委、法院、检察院。</li>
</ol>


<p>
集体负责制： <i>全体组成人员</i> 集体讨论、少数服从多数。
</p>
<pre class="example">
除行政、军事以外的国家机构。
</pre>

<p>
个人负责制： <i>首长个人</i> 决定问题、承担相应责任。
</p>
<pre class="example">
国务院及人民政府（行政），中央军委（军事）
</pre>
</div>
</div>
<div id="outline-container-orga346caf" class="outline-3">
<h3 id="orga346caf">全国人大、全国人大常委会与各委员会</h3>
<div class="outline-text-3" id="text-orga346caf">
<p>
提示：
<i>全国人大</i> 分派了非会议时的常务委员会与专门委员会。
而 <i>常委会</i> 又分派了委员长会议、工作机构和办事机构，以及代表资格审查委员会。
工作机构包括：办公厅、港基会与澳基会。
<i>办公厅</i> 又分派了其他工作。
</p>
</div>
<ul class="org-ul">
<li><a id="org13a9343"></a>全国人大<br />
<div class="outline-text-4" id="text-org13a9343">
<ol class="org-ol">
<li>性质和地位
最高国家权力机关、最高国家立法机关，代表人民统一行使最高权力。</li>
<li>组成和任期
不超过3000名，长期维持在2980名左右。
<i>全国人大常委会</i> 确定各选举单位代表名额比例的分配。
遇到不能选举的非常情况，可以推迟选举，
非常情况结束后一年内必须完成下届全国人大选举。</li>
<li>会议制度和工作程序
<ol class="org-ol">
<li>常规会议，每年3月左右举行一次会议，会期10~12天。</li>
<li>临时会议， <i>人常</i> 认为有必要或 <i>1/5以上的人大代表</i> 提议。</li>
<li><p>
全国人大会议由全国人大常委会召集。
每届全国人大一次会议由 <i>上届</i> 全国人大常委会召集，
第二次起的历次会议均由人大选举的本届全国人大常委会召集。
</p>
<pre class="example">
预备会议、正式会议
预备会议由人常产生本次会议的人大主席团和秘书长
主席团约180人，在台上负责主持会议，代表坐在人民大会堂一层
秘书长负责会议材料分发
</pre></li>
<li>正式会议不同议程，主席团轮流担任大会会议的执行主席。
常务主席召集并主持主席团会议。</li>
<li>所有会议须2/3以上代表出席。</li>
<li>全体会议公开举行。经主席团和各代表团团长会议决定可以举行秘密会议。</li>
<li>院军组成人员、两高首长列席会议（万人大礼堂二楼右侧）
其他负责人（惯例）经主席团决定也可以列席会议</li>
</ol></li>
<li>全国大人职权：法钱人监定大事
<ol class="org-ol">
<li>法：修改和监督宪法；制定修改基本法律</li>
<li>钱：审批国民经济报告；审批国家预算报告</li>
<li>人：“国全军副其他定 其他全选举”
<ul class="org-ul">
<li>根据国家主席的提名决定国务院总理的人选，
根据国务院总理的提名决定副总理、国务委员、部长、委员会主任等，
根据中央军委主席的提名决定军委副主席和委员等的人选。</li>
<li>选举常委会、国家主席、副主席、中央军委主席；</li>
<li>全国人大主席团、3个以上代表团、1/10以上代表联名提出罢免案
主席团提请大会审议、全体代表过半数同意通过。</li>
</ul></li>
<li>监：产生谁，监督谁
<ul class="org-ul">
<li>人常、政府、法院、检察院向本级人大负责并报告工作</li>
<li>例外：主席监军
国家主席、监察委员会做专门报告，中央军委主席不报告工作。</li>
</ul></li>
<li>定大事：建省设特、战和其他</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org6dc9182"></a>全国人大常委会<br />
<div class="outline-text-4" id="text-org6dc9182">
<ol class="org-ol">
<li>性质和地位
可行使国家立法权。
人常对人大负责并报告工作。人大闭会期间，国务院和两高对人常负责。</li>
<li>组成和任期
<ol class="org-ol">
<li>委员长、副委员长若干人、秘书长、委员若干人。必须是全国人大代表。
还有一些专职委员。</li>
<li>人常成员不得兼任行政监察审判和检察机关职务。</li>
<li>委员长、副委员长连任不得超过两届。秘书长和委员无此限制。</li>
</ol></li>
<li>会议制度和工作程序
<ol class="org-ol">
<li>人常全体会议，每两月一次</li>
<li>人常委员长会议，由委员长、副委员长、秘书长组成，处理重要的日常工作</li>
<li>人常通过议案的提案、审议进行工作。</li>
</ol></li>
<li>主要职权：法钱人监定大事
<ol class="org-ol">
<li>法：释施宪、立修法、释法审规司解备
<ul class="org-ul">
<li>解释宪法，制定和修改除应当人大制定的法律以外的法律，
补充和修改人大制定的法律。</li>
<li>解释法律，两央两高专委省常可要求法律解释</li>
<li>撤销行政法规、审查民族自治法规</li>
<li>两高的司法解释应向人常备案</li>
</ul></li>
<li>钱：经社预部分、决算和审计
<ul class="org-ul">
<li>审批国民经济报告国家预算的部分调整方案</li>
<li>审批国家决算</li>
<li>审议审计工作报告</li>
</ul></li>
<li>人
<ul class="org-ul">
<li>在全国人大闭会期间决定任免国家机关领导人员
任免国务院部长、两委两高副职成员、军事法检正职、省级检察长</li>
</ul></li>
<li>监
监督两央察两院，包括：质问工作、法律实施检查、听取专项工作报告</li>
<li><p>
定大事：约外衔、赦勋荣、战动紧、暂调用
</p>
<pre class="example">
国家主席宣布、人常决定。
</pre>

<ul class="org-ul">
<li>决定批准或废除条约和重要协定、
决定驻外全权代表任免、规定军人和外交人员的衔级制度</li>
<li>决定特赦，规定和决定授予国家勋章和荣誉称号</li>
<li>在闭会期间决定宣布战争状态
决定全国总动员、决定进入紧急状态</li>
<li>决定法律的暂停调整适用</li>
</ul></li>
</ol></li>
<li>国家勋章和国家荣誉称号法
共和国勋章、国家荣誉称号：委员长会议及国务院军委提议、国家主席授予
友谊勋章</li>
</ol>
</div>
</li>
<li><a id="org2a544da"></a>人大各委员会<br />
<div class="outline-text-4" id="text-org2a544da">
<ol class="org-ol">
<li>常设性委员会
<ol class="org-ol">
<li>县级以上各级人大的专门委员会是人大常设的辅助性工作机构。</li>
<li>任期与人大任期相同。
人选由人大主席闭在各级人大代表中提名，大会表决。
人常可以补充任命个别副主任和部分委员。</li>
<li><p>
人常可以任命一些非人大代表的专家做委员会的顾问。
</p>
<pre class="example">
只有民族委员会可以调查民族问题，
只有宪法和法律委员会可以处理委员会的法律问题。
</pre></li>
</ol></li>
<li>临时性委员会
<ol class="org-ol">
<li>对特定问题的调查委员会，组成人员必须是本级人大代表，没有任期。</li>
<li>设立
人大主席团或1/10以上代表书面联名，可向本级人大提议设立。人大决定。
闭会期间，委员长会议或主任会议、1/5以上常委会成员书面联名，
可以向常委会会议提议设立。</li>
<li>可以聘请有关专家参加调查工作。</li>
<li>进行调查时，有关机关社团企事业组织公民有义务提供必要的材料。
要求保密材料来源的应当予以保密，可以 <i>不公布调查情况和材料</i> 。</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="orga0eb26c"></a>全国和地方各级人大代表<br />
<div class="outline-text-4" id="text-orga0eb26c">
<ol class="org-ol">
<li>人大代表权利
<ol class="org-ol">
<li>出席人大会议。
每次会议召开前一个月，常委会把开会日期和主要事项通知</li>
<li>提出质询案。必须是 <i>人的集合</i> 而非会议机构提出质询案</li>
<li>提出罢免案。
全国人大主席团、3个以上代表团、1/10以上代表联名提出
全体代表过半数通过。</li>
<li>人身受特别保护权
非经本级人大主席团/人常 <i>许可</i> ，不受逮捕或刑事审判及限制人身自由
现行犯被拘留，公安机关向人大主席团或人常 <i>报告</i> 。</li>
<li>参加各项选举和表决</li>
<li>信息物质等各项保障权</li>
<li>对各方面工作的建议批评和意见</li>
<li>言论免责权
人大代表在人大各种会议上的 <i>发言和表决</i> 不受法律追究。</li>
<li>其他权利，参观、视察等。</li>
</ol></li>
<li>人大代表义务
<ol class="org-ol">
<li>守法保密</li>
<li>按时出席人大会议</li>
<li>积极履职</li>
<li>加强学习和调查研究</li>
<li>与原选举单位和人民群众保持密切联系</li>
<li>自觉遵守社会公德</li>
<li>法律规定的其他义务</li>
</ol></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org1d95d31" class="outline-3">
<h3 id="org1d95d31">国家主席、国务院和中央军委</h3>
<div class="outline-text-3" id="text-org1d95d31">
</div>
<ul class="org-ul">
<li><a id="orgb63940a"></a>中华人民共和国主席<br />
<div class="outline-text-4" id="text-orgb63940a">
<ol class="org-ol">
<li>性质和地位
国家机构，对内对外代表国家</li>
<li>产生和任期
国家主席、副主席由全国人大选举产生。任期同全国人大任期相同。
<ul class="org-ul">
<li>有选举权和被选举权的中国公民</li>
<li>年满45周岁</li>
</ul></li>
<li>职权
公布法律、发布命令、宣布任命、外交权、荣典权。
决定权在全国人大或其常委会。
主席国事活动中，可以直接授予外国政要、国际友人等“友谊勋章”。</li>
<li>补缺
国家主席缺位时，副主席继任国家主席；
副主席缺位时，全国人大补选。
都缺位时，全国人大补选，全人常委员长暂理国家主席职位，等同于国家主席。</li>
</ol>
</div>
</li>
<li><a id="org7732527"></a>国务院<br />
<div class="outline-text-4" id="text-org7732527">
<ol class="org-ol">
<li><p>
性质地位组成和任期
国务院即中央人民政府，是最高国家权力机关的执行机关，最高国家行政机关。
总理、副总理若干、国务委员若干、秘书长、各部部长、各委员会主任、审计长。
</p>
<pre class="example">
中国人民银行行长属于国务院成员，如副总理朱镕基兼任行长。
</pre>

<p>
任期与全国人大相同，连任不超过两届。
</p></li>
<li>国务院首长负责制，各部委部长主任负责制。
国务院全体会议、国务院常务会议。</li>
<li>国务院职权
<ol class="org-ol">
<li>制定发布行政法规。</li>
<li>规定行政措施。</li>
<li>提出议案。（工作报告）</li>
<li>领导监督所属部委和地方各级行政机关。</li>
<li>领导管理国防民政文教经济生态文明。</li>
<li>行政人员任免奖权。</li>
<li>全国人大授予的职权，授权立法、进入紧急状态等。</li>
</ol></li>
<li>机构调整
总理提出，全国人大及常委决定</li>
<li>审计机关
在总理领导下，依照法律规定独立行使审计监督权。</li>
</ol>
</div>
</li>
<li><a id="orgd86354a"></a>中央军事委员会<br />
<div class="outline-text-4" id="text-orgd86354a">
<ol class="org-ol">
<li>性质地位
军委作为独立的国家机关领导全国的武装力量。</li>
<li>组成、体制、成员任免
主席、副主席若干人、委员若干人组成。主席负责制。
全国人大选举或决定产生成员，全人常根据军委主席提名决定军委其他组成人员人选
军委主席没有任期限制。</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org46cb4f5" class="outline-3">
<h3 id="org46cb4f5">地方各级人大、人大常委会和地方各级人民政府</h3>
<div class="outline-text-3" id="text-org46cb4f5">
</div>
<ul class="org-ul">
