public_html/理论法.html
<li><a id="org2e632ab"></a>地方各级人大<br />
<div class="outline-text-4" id="text-org2e632ab">
<ol class="org-ol">
<li><p>
性质和地位
在同级国家机关中处于 <i>支配和核心的地位</i> 。
全国人大与地方各级人大之间 <i>没有隶属关系</i> 。
</p>
<pre class="example">
只有立法上的监督关系、工作上的指导关系。
</pre></li>
<li>组成和任期
人民选举的代表组成，任期5年。</li>
<li>会议制度
<ol class="org-ol">
<li>以召开会议的方式工作，每年至少举行一次会议。
1/5 以上代表提议可以临时召集本级人大会议。</li>
<li>县级以上地方人大首先预备会议，选举主席团和秘书长。</li>
<li>乡级人大无预备会议。</li>
<li>地方人大有10名以上代表（乡镇5名以上）可以提出议案。
过半数赞成才能通过。</li>
</ol></li>
<li>主要职权：法钱人监定大事
<ol class="org-ol">
<li>法：制定修改地方性法规</li>
<li>钱：经社执、预算执
县以上地方人大审批经济和社会发展报告，预算和预算执行情况。
乡级人大没有审批报告的权利，但民族乡人大可采取适合民族特点的措施</li>
<li>人
<ul class="org-ul">
<li>选举所有人</li>
<li>罢免：县级以上人大主席团、人常，1/10 以上代表联名提出罢免案。
乡级大人主席团，1/5 以上代表联名提出罢免案。
全体代表过半数同意通过。</li>
</ul></li>
<li>监
<ul class="org-ul">
<li>四报告：人常、政府、两院向本及人大负责并报告工作</li>
<li>一例外：监察委员会不对人大报告，只专项报告人常</li>
</ul></li>
<li>定大事：县级以上人大讨论</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="orgc411db9"></a>地方各级人大常委会<br />
<div class="outline-text-4" id="text-orgc411db9">
<ol class="org-ol">
<li>性质地位组成任期
县级以上地方人大。选举主任、副主任若干、秘书长（县级不设）、委员若干。
常委会组成人员、乡级人大主席、副主席，不得担任政府监察审判检察职务。
任期5年。</li>
<li>会议制度
<ol class="org-ol">
<li>分常委会会议和主任会议。常委会会议由主任召集，2个月举行一次。
主任会议由人常主任、副主任、秘书长组成，处理常委会日常工作。</li>
<li>县级以上设代表资格审查会。
省级人常可以在地区设立工作机构。
县级市人常在街道设立工作机构。</li>
</ol></li>
<li>职权
<ol class="org-ol">
<li>法
市级以上人大可依法制定地方性法规。</li>
<li>钱
审批决算草案；听取本级政府的预算执行财政收支审计工作报告。</li>
<li>人（前两者地方人常有而全国人常无）
<ul class="org-ul">
<li><p>
任免政府个别副职，决定“一府两院”代理正职
</p>
<pre class="example">
免职是人事变动，撤职则是惩罚性
</pre></li>
<li><p>
撤销本级政府由它任命的个别副职
</p>
<pre class="example">
特殊中院和特殊检察分院，比如在直辖市里的分划
从各区的基层法院到上海市高级法院，中间加入几个区的中级法院
此时没有对应的人大与政府，从上一级人常空降下来
</pre></li>
<li>任免政府部门正职</li>
<li>任免监察委两院副职、批准任免检察长</li>
</ul></li>
<li>监
<ul class="org-ul">
<li>监督政府监察两院的工作</li>
</ul></li>
<li>定大事
讨论决定政经教科文卫等工作重大事项</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org3d5b6ee"></a>地方各级人民政府<br />
<div class="outline-text-4" id="text-org3d5b6ee">
<ol class="org-ol">
<li>性质和地位
地方国家权力机关的执行机关。
既从属于本级、又要服从上级。全国政府都接受国务院的领导。</li>
<li>任期和领导体制
任期5年，首长负责制</li>
<li>所属工作部门
县以上地方政府工作部门应报请上一级人民政府批准，本级人常备案。
乡级政府不设工作部门，有一些工作人员。（很容易冗余）
县以上政府设审计机关，对本级人民政府和上一级审计机关负责。</li>
<li>派出机关
<ul class="org-ul">
<li>省级政府经国务院批准设立行政公署作为派出机关。</li>
<li><p>
县级政府经省政府批准设立区公所作为派出机关。
</p>
<pre class="example">
中国城镇化进程下，区公所逐渐势微了。
</pre></li>
<li>县级市政府经上一级政府批准设立街道办事处作为派出机关。</li>
</ul></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org7aa5acb" class="outline-3">
<h3 id="org7aa5acb">监察委、法院与检察院</h3>
<div class="outline-text-3" id="text-org7aa5acb">
<p>
这一部分更多地放在民诉刑诉里学。
</p>
</div>
<ul class="org-ul">
<li><a id="orgb587719"></a>监察委<br />
<div class="outline-text-4" id="text-orgb587719">
<p>
国家监察机关，监察委是监察职能专责机关。
依照法律监察所有行使公权力的公职人员。
</p>
<ol class="org-ol">
<li>组成和任期
《监察法》
<ul class="org-ul">
<li>主任、副主任若干、委员若干</li>
<li>任期5年</li>
<li>国家监委主任任期不超过两届、地方监委主任没有任届限制</li>
</ul></li>
<li>负责制
国家监委对全国人大及人常负责。
地方监委对产生它的国家权力机关和上一级监委负责。</li>
<li>监察委员会领导体制
<ol class="org-ol">
<li>国监委是最高监是最高监察机关。上级领导下级工作。</li>
<li>监察机关之间有争议的，由其共同的上级监察机关确定。</li>
<li>上级事项可以指定下级管辖，下级事项可以指定其他监察机关管辖</li>
<li>下级认为事项重大复杂，可报请上级监察机关管辖</li>
</ol></li>
<li><p>
与其他国家机关的关系
</p>
<pre class="example">
互相配合互相制约
</pre>

<ul class="org-ul">
<li><p>
其他国家机关发现的问题线索，应当移送监察机关
</p>
<pre class="example">
问题线索交给我
</pre></li>
<li><p>
涉嫌严重职务违法犯罪的由监察机关为主调查
</p>
<pre class="example">
两头犯事我为主
</pre></li>
<li><p>
监察机关需要协助的，有关机关单位应根据监察机关要求依法予以协助
</p>
<pre class="example">
我要协助必须给
</pre></li>
<li><p>
监委会享有监督调查处置权限
</p>
<pre class="example">
我有调查处置权
</pre></li>
</ul></li>
<li>对监察委员会的监督
<ul class="org-ul">
<li>本级人大及人常的监督，听取专项工作报告，必要时组织执法检查。
县以上人大代表和人常成员和以质询或询问监察工作中的问题。</li>
<li>监委会依法公开监察工作信息。</li>
<li>被调查人有权向监督机构申诉。</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org6096c3c"></a>人民法院与人民检察院<br />
<div class="outline-text-4" id="text-org6096c3c">
<p>
最高法最高检-省高级两院-中级两院、海事法院-基层两院
中国人民解放军军事两院-五大战区总直属军事两院-区域军事两院
</p>
<ol class="org-ol">
<li><p>
两院性质
审判机关和法律监督机关。
</p>
<pre class="example">
不止是司法机关
</pre></li>
<li>组织体系
<ol class="org-ol">
<li>上下级人民法院是 <i>监督关系</i> 。</li>
<li><p>
上下及人民检察院是领导关系。
</p>
<pre class="example">
带有一些行政色彩，工作有主动性
</pre></li>
</ol></li>
</ol>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb97e590" class="outline-2">
<h2 id="orgb97e590">立法法专题</h2>
<div class="outline-text-2" id="text-orgb97e590">
</div>
<div id="outline-container-org51dee05" class="outline-3">
<h3 id="org51dee05">立法程序、权限与冲突裁决</h3>
<div class="outline-text-3" id="text-org51dee05">
</div>
<ul class="org-ul">
<li><a id="org05dec7b"></a>全国人大及其常委会的立法程序<br />
<div class="outline-text-4" id="text-org05dec7b">
<ol class="org-ol">
<li>立法案的提出和审议
<ol class="org-ol">
<li>全国人大：两团两委两央两高30代表
<ul class="org-ul">
<li>主席团提出的法律案，由全国人大审议</li>
<li>常委会国务院军委两院专委会提出的法律案由主席团决定列入议程</li>
<li><p>
1个代表团或30名以上代表联名提出的法律案
由主席团决定是否列入会议议程，或交由专委会审议。
</p>
<pre class="example">
人的集合，有可能不被列入会议议程
</pre></li>
</ul></li>
<li>全国人常：两委两央两高10人
<ul class="org-ul">
<li>委员长提出的法律案，由常委会审议</li>
<li>常委会国务院军委两院专委会提出的法律案由委员长会议决定列入议程
或交由专委会审议。</li>
<li>常委会10人以上联名提出的法律案，由女员长会议决定是否列入议程</li>
</ul></li>
<li>草案
应当同时提出法律草案文本及其说明，必要的参阅资料。
修改法律的提交修改前后的对照文本。
说明包括制定修改法律的必要性、可行性、对重大分歧意见的协调处理情况
与其他法律相关规定不一致的应当予以说明并提出处理见见
法律委员会认为需要修改或废止其他法律时应提出处理意见。</li>
<li>其他
<ul class="org-ul">
<li>非国家机关的立法案，专委会审议时可邀请提案人列席会议</li>
<li><p>
常委会审议法律案时应当邀请有关全国人大代表列席会议
</p>
<pre class="example">
每年有60名左右全国人大代表列席全国人大常委会会议
</pre></li>
<li>列入常委会会议议程的法律案，由法律委员会统一审议。</li>
<li>列入常委会会议议程的法律案，应当三次常委会会议审议后交付表决。</li>
<li>法律案列入会议议程前，提案人有权撤回。
列入会议议程后，交付表决前，提案人要求撤回应当说明理由。</li>
<li>列入常委会审议的法律案，
搁置审议满2年的由委员长会议向常务委员会报告，终止审议</li>
</ul></li>
</ol></li>
<li>表决
宪法修正案需 2/3 以上多数通过，其他法律案只需过半数。</li>
<li>公布
宪法修正案以全国人大公告的形式，由全国人大主席团公布。
法律案以主席令的形式公布；选举结果及重要议案，由以上两者其一公布。
常委会公报上刊登的法律文本为标准文本。</li>
</ol>
</div>
</li>
<li><a id="org57cd67c"></a>全国人大常委会的我释审查和监督规范性文件的权力<br />
<div class="outline-text-4" id="text-org57cd67c">
<ol class="org-ol">
<li>法律解释
两央两高省常专委可要求解释法律。法律解释同法律具有同等效力。
只有人大可修宪、全国人常可释宪。</li>
<li>法规审查：两央两高省常
审查对象仅包括低于法律的行政法规、地方性法规、自治条例、单行条例。
同宪法或法案相抵触的，可以向全国人常提出进行审查的要求。
有关专委和常委可 <i>主动审查</i> 报送备案的规范性文件。</li>
<li>司法解释（两高）</li>
</ol>
</div>
</li>
<li><a id="org7acd1d6"></a>规范性法律文件的效力位阶及其冲突裁决<br />
<div class="outline-text-4" id="text-org7acd1d6">
<ol class="org-ol">
<li>影响因素
制定主体、适用范围、制定时间。</li>
<li>具体规定
<ul class="org-ul">
<li>宪法至上</li>
<li>法律&gt;法规&gt;规章
<ul class="org-ul">
<li>行政&gt;地方性</li>
<li>省级规章&gt;市级规章</li>
</ul></li>
<li>特别法&gt;一般法，新法&gt;旧法
<ul class="org-ul">
<li>法律的新的一般规定与旧的特别规定不能确定的，由全人常裁决。
行政法规则由国务院裁决。</li>
</ul></li>
<li>执行变通规定</li>
<li>冲突裁决
<ul class="org-ul">
<li>同一机关，制定机关裁决</li>
<li>地方性法规与部门规章冲突，国务院提出意见。
适用地方性法规，就此决定；适用部门规章，提请全人常裁决。</li>
<li>部门规章之间、部门规章与地方规章冲突，国务院裁决。</li>
<li>特区法规与法律冲突，全人常裁决。</li>
</ul></li>
</ul></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orge90493a" class="outline-3">
<h3 id="orge90493a">立法的批准与备案、撤销和改变</h3>
<div class="outline-text-3" id="text-orge90493a">
</div>
<ul class="org-ul">
<li><a id="org540ad9b"></a>立法的批准（事前审查）与备案（事后审查）<br />
<div class="outline-text-4" id="text-org540ad9b">
<ul class="org-ul">
<li>三批准（自治单行条例）
<ul class="org-ul">
<li>自治区自治单行条例-全人常</li>
<li>自治州县的自治单行条例-省人常，报备全人常、国务院</li>
<li>市和自治州的地方性法规-省人常，报备全人常、国务院</li>
</ul></li>
</ul>
<pre class="example">
自治与单行条例改订现行法律，必须先行审查。
</pre>

<ul class="org-ul">
<li>备案：备案往上看，人大不备案；批准者备案，规章国务院。
<ul class="org-ul">
<li>行政法规（国务院）-全人常</li>
<li>省级地方性法规（省人大）-全人常、国务院</li>
<li>行政规章（省政府）
<ul class="org-ul">
<li>部门规章-国务院</li>
<li>省级政府规章-国务院、省人常</li>
<li>市级政府规章-国务院、省人常、省政府、市人常</li>
</ul></li>
</ul></li>
<li>只有行政法规和特区法规以授权制定，报授权决定规定的机关备案。</li>
<li>自治、单行、特区法应当说明变通的情况。</li>
</ul>
</div>
</li>
<li><a id="org65291f5"></a>立法的撤销和改变（纠正方式）<br />
<div class="outline-text-4" id="text-org65291f5">
<ul class="org-ul">
<li>领导关系（人大对常委、政府对下级）：有权撤销、有权改变</li>
<li>监督关系（常委对下级、常委对政府）：有权撤销、无权改变</li>
<li>批准关系（人常批准的自治单行条例）：有权撤销、无权改变</li>
<li>授权关系（全人大授权行政法规与特区法）：有权撤销，必要时撤权，无权改变</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga23331e" class="outline-2">
<h2 id="orga23331e">先秦时期的法律思想与制度</h2>
<div class="outline-text-2" id="text-orga23331e">
</div>
<div id="outline-container-orgd3d9d06" class="outline-3">
<h3 id="orgd3d9d06">西周时期</h3>
<div class="outline-text-3" id="text-orgd3d9d06">
</div>
<ul class="org-ul">
<li><a id="orga33b2df"></a>西周以降的法律思想<br />
<div class="outline-text-4" id="text-orga33b2df">
<ol class="org-ol">
<li>“以德配天、明德慎罰”的法律思想
<ol class="org-ol">
<li><p>
夏商周的神权法思想，以神意使得民众信服于法律。
天罚：奉天罚罪。神判：假借神意作出判决。
</p>
<pre class="example">
神獸：獬廌
</pre></li>
<li>西周提出“以德配天、明德慎罰”。惟德是輔
这是对天命观的修补，也是对神权政治学说的修补。
即以德治维持政权正统性。</li>
<li>“德”：敬天、敬祖、保民。
“实施德教、用刑宽缓”，实施德教是前提和首位。
“德教”即周禮，形成禮治秩序。</li>
<li>“以德配天、明德慎罰”是西周初期的基本政治观和治国方针。
形成了“禮刑结合”的指导思想。</li>
</ol></li>
<li>“出禮入刑”的禮刑关系
<ol class="org-ol">
<li><p>
两种“禮”：抽象的精神原则（亲亲、尊尊），
以及具体的禮儀形式“五禮”：
吉（祭祀）、兇（喪葬）、軍（行軍作戰）、賓（待客）、嘉（冠婚）
周禮已完全具有法的性质（规范性、国家意志性、国家强制性）。
</p>
<pre class="example">
周禮是人为制定的体现国家意志的强制性规范。
</pre></li>
<li><p>
禮刑关系
禮刑是一体之两面。 <i>出禮则入刑；禮不下庶人，刑不上大夫。</i>
“出禮则入刑”：违反了禮，则须受刑罚。
“禮不下庶人”：特权阶层的禮不可为平民所享有。
“刑不上大夫”：受刑时有特权，不公开处刑、不受辱刑。
</p>
<pre class="example">
分封的大夫往往與天子有血緣關系，或是有戰功。
</pre>

<p>
禮与刑的适用是有等级差别的。
</p></li>
</ol></li>
</ol>
</div>
</li>
