public_html/理论法.html
<li><a id="orgb75e7de"></a>西周以降的主要法制内容<br />
<div class="outline-text-4" id="text-orgb75e7de">
<ol class="org-ol">
<li>舊五刑、刑書、刑罰適用原則
<ol class="org-ol">
<li>墨、劓、剕/刖、宮、大闢。皆为残伤肢体的肉刑。</li>
<li>刑书不公之於众。
“先王議事以制，不为刑闢”（不立成文法）
“臨事制刑、不豫設法”“刑不可知，则威不可測”</li>
<li><p>
刑罚适用：眚（过失）、非眚（故意）、惟終（惯犯）、非終（偶犯）
</p>
<pre class="example">
眚原意指眼瞎
</pre></li>
</ol></li>
<li>契约、婚姻、继承法律制度
<ol class="org-ol">
<li>契约
买卖契约称“質劑”，“大市为質，小市为劑”。大宗与小件物。
借贷契约称“傅別”，“傅”把債標和雙方權利義務寫在契券上，
“別”是在簡札中間寫字，一分爲二，雙方各執一半。</li>
<li><p>
婚姻
上以事宗廟、下以利後嗣。
締結原則（實質要件）
</p>
<ul class="org-ul">
<li><p>
一夫一妻制。媵嫁之妾和婢與正妻不同。
</p>
<pre class="example">
媵嫁：陪嫁
</pre></li>
<li>同姓不婚。“男女同姓，其生不蕃”
“娶於異姓，附遠厚別”，加强部族聯系、鞏固家天下與宗法制度。</li>
<li>父母之命，媒妁之言。無此要件則爲“淫奔”。</li>
</ul>
<p>
締結形式（形式要件）：六禮
</p>
<ul class="org-ul">
<li>納采、問名、納吉、納徵、請期、親迎。</li>
</ul>
<p>
婚姻解除及其限制：“七出”“三不去”
</p>
<ul class="org-ul">
<li>法定七種丈夫或公婆可以休棄妻子或兒媳的情形：
不順父母、無子、淫、妒、有惡疾、多言、盜竊。</li>
<li>法院三種不得休棄的情刑：
有所娶無所歸（無娘家可歸）、與更三年喪（爲公婆守孝三年）、
前貧賤後富貴</li>
<li>反映出宗法制度下夫權至上價值觀念。</li>
</ul></li>
<li>繼承：嫡長子繼承制。繼承政治身份、土地、財產。
“立嫡以長不以賢，立子以貴不以長”</li>
</ol></li>
<li>司法訴訟制度
<ol class="org-ol">
<li>周天子是最高裁判者，設大司寇實施法律法令、輔佐行使司法權。
大司寇下設小司寇、處理具體案件。</li>
<li>民事案件稱“訟”，刑事案件稱“獄”
審理民案稱“聽訟”，審理刑案稱“斷獄”</li>
<li>五聽（辭聽、色聽、氣聽、耳聽、目聽）
判斷當事人陳述真僞的方式，“司法心理”</li>
<li>三赦（幼弱、老耄、蠢愚，赦）
三宥（不識、過失、遺忘、減刑）
三刺（訊羣臣、訊羣吏、訊萬民，慎刑）“明德慎罰”思想。</li>
</ol></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgadf511a" class="outline-3">
<h3 id="orgadf511a">春秋战国时期</h3>
<div class="outline-text-3" id="text-orgadf511a">
</div>
<ul class="org-ul">
<li><a id="org91775e9"></a>铸刑书和铸刑鼎<br />
<div class="outline-text-4" id="text-org91775e9">
<p>
成文法，如鄭國執政子產鑄刑書（第一次公布成文法），晉國趙鞅鑄刑鼎。
成文法的公布，否定了“刑不可知，則威不可測”的舊傳統，
明確了“法律公開”這一新興地主階級的立法原則。
</p>
</div>
</li>
<li><a id="org2461c30"></a>李悝《法经》<br />
<div class="outline-text-4" id="text-org2461c30">
<ol class="org-ol">
<li>戰國時期魏國李悝在總結春秋以來各國成文法的基礎上制定了《法經》，
是中國歷史上第一部比較系統的封建成文法典。</li>
<li>共六篇：《盜法》（財產）《賊法》（人身）《網法》《捕法》《雜法》《qkb法》
<ul class="org-ul">
<li>關於犯罪的規定</li>
<li>《盜》《賊》爲首，因爲“王者之政，莫急於盜賊”
《網》《捕》類訴訟法，《雜》是盜賊以外的其他犯罪和刑罰規定，
即“六禁”：淫禁、狡禁、城禁、嬉禁、徒禁、金禁。</li>
<li>《具》是關於定罪量刑從繹從重的規定，相當於刑法典總則。</li>
</ul></li>
<li><p>
《法經》維護封建專制政權，保護地主私有財產，貫徹法家“輕罪重刑”理論。
</p>
<pre class="example">
商鞅以法經爲模板作秦制，而漢承秦制，新添三章，成爲九章書。
</pre></li>
</ol>
</div>
</li>
<li><a id="orgfce89c5"></a>商鞅变法<br />
<div class="outline-text-4" id="text-orgfce89c5">
<p>
商鞅主張用法律手段建立强大封建政權。
</p>
<ol class="org-ol">
<li>改法爲律，擴充法律內容。此後所有法律都是稱律</li>
<li>以變法實現富國强失的終極目的。</li>
<li>行剝奪舊貴族特權之法。廢世卿世祿，軍功授爵；實行郡縣制。</li>
<li>全面貫徹法家“以法治國”“明法重刑”的主張。
<ul class="org-ul">
<li>以法治國，以吏爲師</li>
<li>變法實現富國强兵的終極目的《分戶令》《軍爵律》</li>
<li>輕罪重刑</li>
<li>不赦不宥，皆應受罰</li>
<li>告奸者與斬敵首同賞（外奸內宄）</li>
</ul></li>
<li>實行連坐</li>
</ol>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org70d6cc7" class="outline-2">
<h2 id="org70d6cc7">秦汉至魏晋南北朝时期的法律思想与制度</h2>
<div class="outline-text-2" id="text-org70d6cc7">
</div>
<div id="outline-container-orgc772ef8" class="outline-3">
<h3 id="orgc772ef8">秦汉时期</h3>
<div class="outline-text-3" id="text-orgc772ef8">
</div>
<ul class="org-ul">
<li><a id="org4d33e9f"></a>秦代的罪名與刑罰<br />
<div class="outline-text-4" id="text-org4d33e9f">
<p>
以法爲教、以吏爲師；嚴刑峻法。
</p>
<ol class="org-ol">
<li>罪名
<ul class="org-ul">
<li>危害皇權
謀反；泄密；偶語詩書、以古非今；詛咒、誹謗；妄言妖言；非所宜言；投書</li>
<li>侵犯財產和人身
盜、共盜、羣盜（政治犯罪）
賊殺、傷人、鬥傷、鬥殺</li>
<li>瀆職
見知不舉、不直、縱囚、失刑</li>
<li>妨害管理秩序
違令賣酒；逋事、乏徭</li>
<li>破壞婚姻家庭
夫毆妻、夫通奸、妻私逃；擅殺子、子不孝、子女控告父母、卑幼毆尊長、亂倫</li>
</ul></li>
<li><p>
刑罰：過渡時期
</p>
<ul class="org-ul">
<li>笞刑（亂棍）</li>
</ul>
<p>
“主刑”
</p>
<ul class="org-ul">
<li>徒刑：城旦舂；鬼薪、白粲；隸臣妾；司寇；候</li>
<li>流放刑：遷、謫</li>
<li>肉刑：黥、劓、刖、宮</li>
<li>死刑：棄市、戮、腰斬、車裂、梟首、族刑、具五刑</li>
</ul>
<p>
“附加刑”
</p>
<ul class="org-ul">
<li>羞辱刑：髡（光頭）、耐（地中海）</li>
<li>貲贖刑：貲甲、貲盾；貲戍；貲徭</li>
<li>株連刑：族、收</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org126bd5a"></a>秦代的刑罰適用原則<br />
<div class="outline-text-4" id="text-org126bd5a">
<ol class="org-ol">
<li>刑事責任能力以身高爲標準：六尺五寸</li>
<li>區分故意（端）和過失（不端）</li>
<li>盜竊按贓值分三等：110錢、220錢、660錢</li>
<li>共犯罪、集團犯罪加重處罰</li>
<li>累犯加重</li>
<li>教唆犯罪加重處罰</li>
<li>自首減輕處罰</li>
<li>誣告反坐原則</li>
</ol>
</div>
</li>
<li><a id="orge496b06"></a>漢代文帝、景帝廢肉刑<br />
<div class="outline-text-4" id="text-orge496b06">
<ol class="org-ol">
<li>背景：漢初黃老思想、無爲而治；漢武帝後罷黜百家獨尊儒術</li>
<li><p>
改革過程
淳于緹縈上書、文帝廢肉刑、不恰當地由輕改重“外有輕刑之名，內實殺人”
景帝再改輕，《箠令》規定笞杖尺寸材質刑制、行刑不得換人，肉刑退出
</p>
<pre class="example">
舊五刑：墨劓刖宮大闢，新五刑笞杖徒流死（絞斬）
</pre></li>
</ol>
</div>
</li>
<li><a id="org2b54689"></a>漢代的法律思想<br />
<div class="outline-text-4" id="text-org2b54689">
<ol class="org-ol">
<li>上請與恤刑
<ol class="org-ol">
<li>上請：請示皇帝減免特權人物的刑罰</li>
<li>恤刑：矜老恤幼。老幼孕師和侏儒不戴刑具，不拘捕監禁</li>
</ol></li>
<li>親親得首匿
“父子相隱”中華法系的主要特點
卑幼首匿尊長，不追究刑事責任；尊長首匿卑幼，罪不至死則不負責任</li>
</ol>
</div>
</li>
<li><a id="orgf6b92ac"></a>訴訟制度與漢律儒家化<br />
<div class="outline-text-4" id="text-orgf6b92ac">
<ol class="org-ol">
<li>《春秋》决獄、經義决獄
依據儒家經典著作的精神原則審案。
“春秋之聽獄也，必本其事而原其志；志邪者不待成，首惡者罪特重，本直者其論輕”</li>
<li><p>
秋冬行刑
“天人感應”，春夏不得執行死刑，除大逆不道等“决不待時”者外
死刑犯在秋天霜降後、冬至以前執行，“順天行誅”
唐律“立春後不决死刑”明清律“秋審”
</p>
<pre class="example">
“天人感應”是新儒家融合了陰陽家的說法。
</pre></li>
</ol>
</div>
</li>
<li><a id="org4f76c67"></a>秦漢時期的司法機關<br />
<div class="outline-text-4" id="text-org4f76c67">
<ol class="org-ol">
<li>皇帝掌握最高審判權。
廷尉是中央司法機關的長官，審理皇帝交辦的案件，有權審理各地重大疑難案件。</li>
<li><p>
地方行政兼理司法，郡縣分設郡守、縣令，基層設鄉裏組織
</p>
<pre class="example">
即是中央的郡縣制
</pre></li>
<li><p>
御史制度，秦代開監察制度之先河，設御史大夫，監察御史。
漢代設御史大夫、御史中丞，負責法律監督
漢武帝後設司隸校尉，監督中央百官與京師地方司法官吏
設刺史，專司各地行政與法律監督之職。
</p>
<pre class="example">
南北朝：中央三法司
唐朝：大理寺、刑部、御史臺（成系統的監察系統）
明清：督察院
清末修律：檢察廳、審檢合署
民國：五權憲法、立法司法行政考試監察、五院制
中國：18修憲監察委
</pre></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgd712db2" class="outline-3">
<h3 id="orgd712db2">魏晋南北朝时期</h3>
<div class="outline-text-3" id="text-orgd712db2">
</div>
<ul class="org-ul">
<li><a id="org9e7a812"></a>律學法律思想<br />
<div class="outline-text-4" id="text-org9e7a812">
<p>
即對法律的司法解釋，解釋律令的學問。
</p>
<ol class="org-ol">
<li>律學發展過程
<ul class="org-ul">
<li>兩漢引經注律，律學與政治倫理結合</li>
<li>桓譚、王充批判陰陽讖諱等神學思想、“名教出於自然”，《易》學</li>
<li>律學自倫理政治中脫出</li>
<li>《律注要略》解釋《晉律》中20個名詞，確定犯罪性質，區分犯罪情節</li>
<li>法律吸收律學成果，如《北魏律》</li>
<li>律學成爲解釋之學。杜預：法者、繩墨之斷例，而非窮理盡性之書
官方注釋確立，限制私家常說</li>
<li>律學回到傳統經學訓詁老路</li>
</ul></li>
<li>法律解釋規範化
張斐、杜預對《泰始律》的解釋，科學化規範化法律概念
<ul class="org-ul">
<li>解釋名詞</li>
<li>區分易混</li>
<li>解釋刑名類別</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="orgd818731"></a>法律形式、法典結構和內容上的變化<br />
<div class="outline-text-4" id="text-orgd818731">
<ol class="org-ol">
<li>法律形式變化
律、令、科（變通律令）、比（比照典型判例）、格（補充律）、式相互爲用。</li>
<li>法典體例變化
<ol class="org-ol">
<li>《魏律》，“具律”改爲“刑名”置於律首（先總則後分則）</li>
<li>《晉律》又稱《泰始律》，“刑名”後增加“法例”，律學家作注與律文具有同等效力</li>
<li>《北齊律》將“刑名”與“法例”合爲“名例”總則，分例11篇刑法</li>
</ol></li>
<li>法典內容變化
更廣泛、更直接地把儒家倫理規範上升爲法律規範。
<ul class="org-ul">
<li>八議，對皇朝特權人物犯罪實行減免處罰的决定</li>
<li>官當，以官職爵位折抵徒罪</li>
<li>準五服以制罪。以喪服爲標志，規定親屬之間親疏遠近。
斬衰、齊衰、大功、小功、緦麻
關系越親，尊犯卑輕罪、卑犯尊重罪；
關系越疏，尊犯卑重罪、卑犯尊輕罪；</li>
<li>“重罪十條”，不在八議論贖之限。</li>
<li>刑罰制度改革，規定絞斬死刑，流刑、鞭刑與杖刑、廢除宮刑</li>
<li>死刑復奏制度，奏請皇帝批準執行死刑。
既加强了皇帝對司審判的控制，又體現了皇帝對民衆的體恤。</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="orgebb37d8"></a>司法制度<br />
<div class="outline-text-4" id="text-orgebb37d8">
<ol class="org-ol">
<li>司法機關
北齊設大理寺，尚書臺的三公曹與二千石曹執掌司法審判。</li>
<li>皇帝直接參與司法審判</li>
<li>直訴制</li>
<li>上訴機制</li>
<li>死刑復核制</li>
<li>自上而下的審判監督</li>
</ol>
</div>
</li>
<li><a id="org22fb182"></a>御史臺對司法的監督<br />
<div class="outline-text-4" id="text-org22fb182">
<ol class="org-ol">
<li>御史臺：皇帝直接掌握的獨立監察機關</li>
<li>司隸校尉、御史中丞監察。</li>
</ol>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org9ee41aa" class="outline-2">
<h2 id="org9ee41aa">隋唐宋元时期的法律思想与制度</h2>
<div class="outline-text-2" id="text-org9ee41aa">
</div>
<div id="outline-container-orgd72da19" class="outline-3">
<h3 id="orgd72da19">隋唐时期</h3>
<div class="outline-text-3" id="text-orgd72da19">
</div>
<ul class="org-ul">
<li><a id="org1bc50b9"></a>隋《开皇律》与《唐律疏議》<br />
<div class="outline-text-4" id="text-org1bc50b9">
<ol class="org-ol">
<li>隋文帝《開皇律》的制定與特點
<ul class="org-ul">
<li>制定：《刑書要制》、開皇元年參考北齊制定新律、開皇三年再次修訂</li>
<li>特點
<ol class="org-ol">
<li>定封建五刑（笞杖徒流死），從法典律文上結束了肉刑。</li>
<li>繼承并發展議請制，規定“例減”特權人物非“十惡”則例減一等、
“贖刑”以錢財抵刑罰、襲用“官當”增加區分公罪、私罪的標準。</li>
<li>在北齊律重罪十條上增刪成爲“十惡”，置於首篇“名例律”
唐律十惡：分爲侵犯皇權的犯罪和違反倫理綱常的犯罪。
謀反、謀大逆、謀叛、惡逆、不道、大不敬、不孝、不睦、不義、內亂
犯十惡者不可議請減贖官當等減刑，不許赦免，不適用自首。</li>
</ol></li>
</ul></li>
<li>唐律的發展
唐代 <i>“禮法合一、禮律合一”</i> ，立法技術完善。
<ol class="org-ol">
<li>高祖《武德律》、太宗《貞觀律》參考《開皇律》。</li>
<li>高宗《永徽律》《律疏》30卷。《律疏》以儒家經義對律文進行解釋，
繼承張斐、杜預注，又稱《唐律疏議》。</li>
<li>《律疏》歷史意義：
<ul class="org-ul">
<li>古代立法達到了最高水平</li>
<li>全面體現了中國古代法制的水平、風格和基本特徵</li>
<li>中華法系的代表性法典，最早最完整最具社會影響力。</li>
</ul></li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org0740993"></a>六杀、六赃、保辜<br />
<div class="outline-text-4" id="text-org0740993">
<ol class="org-ol">
<li>六殺
六種殺人罪：謀殺、故殺、鬥殺、誤殺、戲殺、過失殺</li>
<li>六贓
六種非法獲取公私財物的犯罪，按犯罪數額大小處罰。
<ol class="org-ol">
<li>對官員：受財枉法、受財不枉法、受所監臨、</li>
<li>對平民：强盜、竊盜</li>
<li>兩者皆適用：坐贓</li>
</ol></li>
<li><p>
保辜
傷人罪不是立即顯露的傷人行爲設“辜限”。
人死辜限之內以故意殺人論處，辜限之外以故意傷害論處。
</p>
<pre class="example">
法醫學要等到宋朝
</pre></li>
</ol>
</div>
</li>
<li><a id="orge9e23a1"></a>唐律中的刑罚原则<br />
<div class="outline-text-4" id="text-orge9e23a1">
<ol class="org-ol">
<li>區分公罪與私罪
公罪“緣公事致罪而無私曲者”
私罪“不緣公事私自犯者”或“雖緣公事、意涉阿曲”
適用官當時需考慮公罪與私罪。</li>
<li>自首
<ul class="org-ul">
<li>區別自首（未案發自首）和自新（己案發投案）</li>
<li>于人損傷、於物不可備償、十惡、跑渡關及奸、私習天文、不得自首</li>
<li>自首免罪、正贓猶徵如法</li>
<li>自首不實不盡，各依不實不盡之罪罪之。至死者聽減一等。</li>
<li>輕罪已發、能首重罪、免其重罪；
審問它罪能自首餘罪，免其餘罪。</li>
</ul></li>
<li>化外人
諸化外人，同類自相犯者，各依本俗法（屬人主義）
異類相犯者，以法律論（屬地主義）</li>
<li>類推原則
斷罪而無正條，其應出罪者，則舉重以明輕（類比推理）
其應入罪者，則舉輕以明重</li>
</ol>
</div>
</li>
