src/理论法.org
*** 隋唐时期的司法制度
1. 中央三法司和地方司法機關
   - 中央：大理寺、刑部、御史臺
     + 大理寺：中央司法審判機關。
       審理中央百官犯罪及京師徒刑以上犯罪。
     + 刑部：中央司法行政及復核機關。
       復核大理寺判决的徒、流刑以下案件、州縣以上的徒刑案件。
     + 御史臺：中央監察機構。
       監督大理寺、刑部、參與疑難案件的審判。
       下設臺院、殿院和察院。臺院糾彈中央百官，參與大理寺的審判；
       殿院糾察百官違反朝儀的失禮行爲；察院監察地方官員。
     + 三司推事。
       刑部侍郎、御史中丞、大理寺卿審理中央或地方重大案件。
       地方重案派出大理寺評事、刑部員外郎、監察御史爲三司使前往處理。
     + 都堂集議。
       下令中書、門下四品以上及尚書九卿集體討論重大死刑案件。
   - 地方司法機關
     唐代州縣行政兼理司法，設佐史協理。
     鄉官、里正有責任糾舉犯罪，調解處理輕微犯罪與民事案件。
2. 訴訟制度
   - 刑訊
     * 刑訊條件與證據
       必先以情、審察辭理、反復參驗、
       猶未能决、事須拷問題，立案同判，然後拷訊。
       人贓俱獲、拷訊華拒不認罪的，可 /“據狀斷之”/ 。
     * 若拷訊數滿、被拷者仍不承認的，應當反拷告狀之人，查明有無誣告。
     * 禁止對特權人物和老幼廢疾拷訊，只能據“衆證定罪”。
   - 司法官回避
     “鞫獄，官與被鞫人有新屬仇嫌者，皆聽更之。
** 宋元时期
*** 礼律合一思想的发展
1. 宋明理學思想：儒家經典、華嚴宗和禪宗的佛學、太極和陰陽學的道教
   : 佛學：哲學思辯方法
   : 道學：終極目標的追求
2. 宋代科舉取士，重文輕武
   - 中央集權，注重吏治
     “王者禁人爲非，莫先於法令”“防閑考核，纖悉委曲”
   - 義利之辯
     王安石變法以來，思想變爲“利義均重，利義相輔”
     重視功利，朝廷重視賦稅徵納。
   - 以禮律之文爲根本
     程朱理學强調正風俗而防禍亂，必以“禮律之文”爲根本。
   - 法深無善治
     : 法律字眼鑽得深了就沒有好法律了。
     “擇善而取，爲我所用”寬緩一般犯罪刑罰。
*** 宋刑统与编敕
1. 《宋刑統》
   : 繼承後周刑統名號
   第一部刊印頒行的法典，是一部統括性和綜合性的法典。
   《宋刑統》繼承和發展了《唐律疏議》。
2. 敕與編敕
   敕即皇帝詔令的一種，皇帝對特定的人或事做的命令，效力高於律。
   經過中書省“制論”和門下省“封駁”，可成爲“編敕”并有通行全國的效力
   《建隆編敕》，編敕作使得敕的地位大幅提高。
*** 宋代刑罚的变化
1. 折杖法。笞杖徒流刑可折合成杖刑。重罪等不予適用。
   : 輕重不平衡
2. 配役。最嚴酷者爲刺配，即刺面、杖脊、配流之集合。
   : 作爲僅次死刑的刑罰，後來刺配也泛濫了。
3. 凌遲刑。作爲法定死刑。
   : 殺人祭鬼，常用流動人口的商人與讀書人，國家於是制定此刑針對
*** 宋代契约、婚姻与继承
1. 契約立法
   1) 債的發生。
   2) 買賣契約。絕賣、活賣和賒賣。
   3) 租賃契約。對房宅稱租賃借，對人畜車馬稱庸僱。
   4) 租佃契約。該契約明定納稅與納租條件，地主向國家繳納田賦。
   5) 典賣契約。爲宋代特有，即活賣。
   6) 借貸契約。借指使用借貸、貸爲消費借貸。
      不付息借貸稱“負債”，付利息借貸稱“出舉”。
2. 婚姻立法
   1) 結婚。男年十五女年十三以上并聽婚嫁。
      禁止五服以內親屬結婚。官在任不得共部下百姓交婚。
   2) 離婚。“七出”“三不去”，但有變通。維護家族財產不得轉移的固有傳統。
   3) 義絕。夫妻親屬間毆駡殺傷奸，則視爲恩斷義絕。官府審斷强制離婚。
3. 繼承立法
   1) 遺產兄弟均分制，在室女享受部分繼承，承認遺腹子與親生子同等繼承權。
   2) “戶絕”，若夫亡妻在，立繼從妻“立繼”；
      夫妻俱亡，立繼從尊長親屬，“命絕”。
*** 宋代司法制度
1. 刑部負責大理寺詳斷的全國死刑已决案件復核及官員敘復、昭雪等事宜。
   刑部分左右曹，左曹負責死刑案件復核，右曹負責官員案件復核。
2. 臺諫合一：御史臺與諫院合二爲一。皇權沒有監督。
3. 地方州縣行政兼理司法。
   州縣之上設立提點刑獄司，作爲中央在地方各路的司法派是構。
4. 翻異別勘與證據勘驗。
   - 翻異別勘
     犯人否認其重罪口供，案件改由同級另一法官或另一司法機關審理。
     “差官別推”（換法官審理）和移司別推（換司法機關審理）
   - 證據勘驗
     注重證據，重視現場勘驗，有《洗冤集錄》等世界最早的法醫學著作。
*** 元代“四等人”原则
蒙漢異制，蒙古人、色目人、漢人和南人四等。
* 明清时期的法律思想与制度
** 明至清中期
*** 律例与大诰
1. 《大明律》
   体例改为名例、吏户礼兵刑工七篇。
   - 《元典章》六部顺序编律
   - 仿唐律12篇，“名例”殿后
   - 再次将“名例”冠于律首
   - 最终定型七篇格局
2. 《明大诰》
   《尚书·大诰》，“重典治世”，由明太祖亲审案例的汇编加“训导”构成。
   在中国法制史上空前普及。朱元璋死后，大诰逐渐不再有法律效力。
3. 《大清律例》
   康熙、雍正两朝，仿《大明律》修订《大清律》。
   乾隆元年，重新修订《大清律例》，大致同于《大明律》
   颁布后极少修订，仅增其“附例”。
   这是中国历史上最后一部封建成文法典，上承汉唐精神，又有清代政治特色。
4. 清代的例
   条例、则例、事例、成例。
   - 条例：刑事单行法规。
   - 则例：某一行政部门或专门事务的单行法规。
   - 事例：皇帝上谕或批准的政府建议。作为指导原则。
   - 成例：经过整理编订的事例。
   “例”不是案例，而是高度抽象条文化的表达。
   形成“律例”关系：以“律”为宗、“例以辅律”的体例传统。
5. 明清会典
   1) 明会典。
      《大明会典》仿《唐六典》，六部官制为纲，分述各行政机关职掌和事例，
      性质属行政法典。
   2) 清会典。
      仿效《大明会典》，先后修订“五朝会典”，统称《大清会典》。
*** 立法思想与刑罚原则
1. 明刑弼教的立法思想
   《尚来·大禹谟》，与“德主刑辅”有实质差别。
   宋以前“明刑弼教”位“德主刑辅”之后，即是先教后刑；
   宋代朱熹刻意提高刑的地位，将德局限为罚的目的。
   朱元璋借“弼教”之口实，推行重典治国政策。
2. 从重从新，“重其所重、轻其所轻”
   - 刑罚从重从新。“凡律自颁降日为始，若犯在已前者，并依新律拟断”
   - “重其所重”：贼盗钱粮等不分情节，一律重刑，扩大株连。
     “轻其所轻”：典礼及风俗教化犯罪，明律处罚轻于唐律。
     : 薛允升《唐明律合编》
   - 清承明制，扩大和加重“谋反”“谋大逆”等的惩罚。
     所有文字狱按谋反大逆定罪。
*** 罪名与刑罚
- 罪名：“奸党”罪。没有确定内容。
- 刑罚：充军刑（本人终身充军、子孙永远充军）
  廷杖：法外用刑。
*** 明清司法制度
1. 司法机关
   1) 中央司机构：刑部、大理寺、都察院。
      : 明清刑部、大理寺的职能与唐宋相反。
      - 刑部：审理中央百官犯罪、地方重案，死刑交大理寺复核；
        明清刑部下设清吏司分掌各省刑民案件。
      - 大理寺：中央司法复核机关。
        复核死刑案件、平反冤狱。
      - 都察院：中央监察机构。
        仅限会审及审理官吏犯罪案件， /并无监督法律执行的职能。/
        明朝改御史台为都察院；清代都察院负责督察百官风纪，监督刑部、大理寺。
   2) 地方司法机关
      - 明代：省、府、县三级。
        省级设提刑按察使司，判处徒刑以下案件；流刑以上报送中央批准执行。
        府县行政兼理司法，有权审结笞杖案件。
      - 清代：督抚、省按察司、府、县四级。
        + 州县：决定笞、杖刑。
        + 府：复审州县上报的刑事案件，提出拟罪人，上报。
        + 省按察司：复审徒刑以上案件，而军流、死刑案件。
          审供无异者，上报督抚；
          上报案件有疑漏，驳回重审，或改发其他州县府重审。
        + 督抚：批复徒刑案件、复核军流案件、复审死刑案件。
2. 明代管辖原则与厂卫司法
   1) 管辖制度
      - 案件管辖：原告就被告、轻囚就重囚、少囚就多囚、后发就先发
      - 军民分诉分辖制
   2) 厂卫司法：即特务司法。
      - 奉旨行事，厂卫作出判决，三司无权更改。
      - 非法逮捕、行刑，不受法律约束。
3. 会审制度
   1) 明代会审
      - 三司会审。重大疑难案件由刑部大理寺都察院三法司共同会审。
      - 九卿会审。罪犯经二审仍不服判决，
        则由六部尚书、大理寺卿、左都御史、通政使九卿联合审判，报奏皇帝裁决。
      - 朝审。每年霜降之后、三法司会同公侯伯爵，在吏部户部尚书主持下会审重囚。
      - 大审。司礼监主持，大监居中主审。
        这表明九卿抑于太监之下。
   2) 清代会审
      - 秋审，审理全国各地上报的斩监候、绞监候，每年秋8月在天安门金水桥西进行
      - 朝审，复审重案及斩监候、绞监候，每年霜降后10日举行。
      两审程序后分四种情况：
        + 情实：罪名恰当，则执行死刑
        + 缓决：危害不大，减为流三千里，或再押监候办
        + 可矜：有可疑之后，可免予死刑，减为徒流
        + 留养承祀：有亲老丁单，按留养案奏请皇帝裁决。
      - 热审，对发生在京师的笞杖刑案件进行重审，
        于暑热来临时，快速决、放在监笞、杖刑案犯。
        : 热天容易爆发传染病。
** 清末
*** 清末的法律思想
1. 律学：传统律学的延续
   薛允升《唐明律合编》、沈家本《历代刑法考》、程树德《九朝律考》
2. 君主立宪与国体之争。“国体”：国家典章制度。
3. 朝贡体制式微与国际公法确立。
   李鸿章、张之洞等接受国际公法理论，丁韪良《万国公法》
4. 代表人物法律思想
   : 康有为梁启超：改良派
   : 张之洞刘坤一劳乃宣：礼教派（保皇）
   : 沈家本伍庭芳：法理派，与世界法律合流
   - 康有为：设议院开国会定宪法、三权鼎立建立君主立宪制
   - 梁启超：以资产阶级宪政取代传统帝制专制
   - 张之洞刘坤一：“变法奏议三折”
     适应形势实施变法，中体西用，变法不得背离纲常名教
   - 劳乃宣：法律不能违背风俗，坚持家族主义法律观，维护传统儒家纲常礼教
   - 沈家本：采纳近代权力分立学说
   - 伍廷芳：中西法律固不能相同，采各国通行之律，三权分立，司法独立
   - 袁世凯：道德为体、法律为用，宪政思想摇摆不定、前后矛盾
*** “预备立宪”及其相关文件
1. 根本原则：“ 大权统于朝廷、庶政公诸舆论
2. 主要活动
   - 1905 仿行宪政、派五大臣赴日本等国考察、设考查政治馆，后为宪政编查馆
   - 1906 预备立宪上谕
   - 1908 《钦定宪法大纲》
   - 1909 谘议局、资政院
   - 1911 武昌起义后发布《宪法重大信条十九条》
3. 《钦定宪法大纲》
   - 清廷宪政编查馆编订，近代史上第一个宪法性文件。
   - 结构：正文“君上大权”、附录“臣民权利义务”
   - 特点：皇帝专权、人民无权。
   - 实质：给皇权专制制度披上“宪法”的外衣，以法律的刑式确认君主的绝对权力。
4. “十九信条”
   - 资政院起草的宪法性文件
   - 在形式上被迫缩小了皇帝的权力，仍然强调皇权至上
5. 谘议局与资政院
   - 谘议局：“地方咨询机关”
   - 资政院：“中央咨询机构”，皇帝有权谕令资政院停会或解散
*** 清末修律的主要内容
1. 《大清现行刑律》《大清新刑律》
   - 在《大清律例》的基础上的过渡性法典。
     取消了六律总目，对民事性质的条款不再科刑；
     废除了一些残酷的刑罚手段，增加了一些新罪名。
   - 《大清新刑律》，中国历史上第一部近代意义上的专门刑法典。
     依然维护专制制度和封建伦理。
2. 《大清商律草案》《大清民律草案》
   - 清末商事立法。
     + 第一阶段，主要由商部负责，《商人通例》《公司律》定名《钦定大清商律》
     + 第二阶段由修订法律馆主持，《大清商律草案》。
   - 《大清民律草案》“中学为体，西学为用”。
   - 诉讼法律与法院编制法。
     《大清刑事诉讼律草案》《大清民事诉讼律草案》
     《大理院编制法》《各级审判厅试办章程》《法院编制法》
*** 清末司法体制的变化
1. 司法机构改革与四级三审制
   1) 改刑部为法部，掌司法行政；改大理寺为大理院，为最高审判机关。
      检审合署，大理院和各级审判厅内设检察厅。
   2) 实行四级三审制，规定刑事案件公诉制度、证据、保释制度。
2. 治外法权及其机构
   - 领事裁判权，五口通商章程与虎门条约确立。
     管辖按被告主义原则。
   - 观审。一国领事官有权观审该国人为原告的案件。
3. 会审公廨，又称会审公堂。
   凡涉及外国人之间、中国人与外国人之间、租界内纯属中国人之间的诉讼，
   均由外国领事观审并操纵判决。
