public_html/理论法.html
<li><a id="orgb967287"></a>隋唐时期的司法制度<br />
<div class="outline-text-4" id="text-orgb967287">
<ol class="org-ol">
<li>中央三法司和地方司法機關
<ul class="org-ul">
<li>中央：大理寺、刑部、御史臺
<ul class="org-ul">
<li>大理寺：中央司法審判機關。
審理中央百官犯罪及京師徒刑以上犯罪。</li>
<li>刑部：中央司法行政及復核機關。
復核大理寺判决的徒、流刑以下案件、州縣以上的徒刑案件。</li>
<li>御史臺：中央監察機構。
監督大理寺、刑部、參與疑難案件的審判。
下設臺院、殿院和察院。臺院糾彈中央百官，參與大理寺的審判；
殿院糾察百官違反朝儀的失禮行爲；察院監察地方官員。</li>
<li>三司推事。
刑部侍郎、御史中丞、大理寺卿審理中央或地方重大案件。
地方重案派出大理寺評事、刑部員外郎、監察御史爲三司使前往處理。</li>
<li>都堂集議。
下令中書、門下四品以上及尚書九卿集體討論重大死刑案件。</li>
</ul></li>
<li>地方司法機關
唐代州縣行政兼理司法，設佐史協理。
鄉官、里正有責任糾舉犯罪，調解處理輕微犯罪與民事案件。</li>
</ul></li>
<li>訴訟制度
<ul class="org-ul">
<li>刑訊
<ul class="org-ul">
<li>刑訊條件與證據
必先以情、審察辭理、反復參驗、
猶未能决、事須拷問題，立案同判，然後拷訊。
人贓俱獲、拷訊華拒不認罪的，可 <i>“據狀斷之”</i> 。</li>
<li>若拷訊數滿、被拷者仍不承認的，應當反拷告狀之人，查明有無誣告。</li>
<li>禁止對特權人物和老幼廢疾拷訊，只能據“衆證定罪”。</li>
</ul></li>
<li>司法官回避
“鞫獄，官與被鞫人有新屬仇嫌者，皆聽更之。</li>
</ul></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org39da1ed" class="outline-3">
<h3 id="org39da1ed">宋元时期</h3>
<div class="outline-text-3" id="text-org39da1ed">
</div>
<ul class="org-ul">
<li><a id="orga91ab1a"></a>礼律合一思想的发展<br />
<div class="outline-text-4" id="text-orga91ab1a">
<ol class="org-ol">
<li><p>
宋明理學思想：儒家經典、華嚴宗和禪宗的佛學、太極和陰陽學的道教
</p>
<pre class="example">
佛學：哲學思辯方法
道學：終極目標的追求
</pre></li>
<li>宋代科舉取士，重文輕武
<ul class="org-ul">
<li>中央集權，注重吏治
“王者禁人爲非，莫先於法令”“防閑考核，纖悉委曲”</li>
<li>義利之辯
王安石變法以來，思想變爲“利義均重，利義相輔”
重視功利，朝廷重視賦稅徵納。</li>
<li>以禮律之文爲根本
程朱理學强調正風俗而防禍亂，必以“禮律之文”爲根本。</li>
<li><p>
法深無善治
</p>
<pre class="example">
法律字眼鑽得深了就沒有好法律了。
</pre>

<p>
“擇善而取，爲我所用”寬緩一般犯罪刑罰。
</p></li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org548efce"></a>宋刑统与编敕<br />
<div class="outline-text-4" id="text-org548efce">
<ol class="org-ol">
<li><p>
《宋刑統》
</p>
<pre class="example">
繼承後周刑統名號
</pre>

<p>
第一部刊印頒行的法典，是一部統括性和綜合性的法典。
《宋刑統》繼承和發展了《唐律疏議》。
</p></li>
<li>敕與編敕
敕即皇帝詔令的一種，皇帝對特定的人或事做的命令，效力高於律。
經過中書省“制論”和門下省“封駁”，可成爲“編敕”并有通行全國的效力
《建隆編敕》，編敕作使得敕的地位大幅提高。</li>
</ol>
</div>
</li>
<li><a id="orgafb4cf4"></a>宋代刑罚的变化<br />
<div class="outline-text-4" id="text-orgafb4cf4">
<ol class="org-ol">
<li><p>
折杖法。笞杖徒流刑可折合成杖刑。重罪等不予適用。
</p>
<pre class="example">
輕重不平衡
</pre></li>
<li><p>
配役。最嚴酷者爲刺配，即刺面、杖脊、配流之集合。
</p>
<pre class="example">
作爲僅次死刑的刑罰，後來刺配也泛濫了。
</pre></li>
<li><p>
凌遲刑。作爲法定死刑。
</p>
<pre class="example">
殺人祭鬼，常用流動人口的商人與讀書人，國家於是制定此刑針對
</pre></li>
</ol>
</div>
</li>
<li><a id="orge2f867e"></a>宋代契约、婚姻与继承<br />
<div class="outline-text-4" id="text-orge2f867e">
<ol class="org-ol">
<li>契約立法
<ol class="org-ol">
<li>債的發生。</li>
<li>買賣契約。絕賣、活賣和賒賣。</li>
<li>租賃契約。對房宅稱租賃借，對人畜車馬稱庸僱。</li>
<li>租佃契約。該契約明定納稅與納租條件，地主向國家繳納田賦。</li>
<li>典賣契約。爲宋代特有，即活賣。</li>
<li>借貸契約。借指使用借貸、貸爲消費借貸。
不付息借貸稱“負債”，付利息借貸稱“出舉”。</li>
</ol></li>
<li>婚姻立法
<ol class="org-ol">
<li>結婚。男年十五女年十三以上并聽婚嫁。
禁止五服以內親屬結婚。官在任不得共部下百姓交婚。</li>
<li>離婚。“七出”“三不去”，但有變通。維護家族財產不得轉移的固有傳統。</li>
<li>義絕。夫妻親屬間毆駡殺傷奸，則視爲恩斷義絕。官府審斷强制離婚。</li>
</ol></li>
<li>繼承立法
<ol class="org-ol">
<li>遺產兄弟均分制，在室女享受部分繼承，承認遺腹子與親生子同等繼承權。</li>
<li>“戶絕”，若夫亡妻在，立繼從妻“立繼”；
夫妻俱亡，立繼從尊長親屬，“命絕”。</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="orgd11737d"></a>宋代司法制度<br />
<div class="outline-text-4" id="text-orgd11737d">
<ol class="org-ol">
<li>刑部負責大理寺詳斷的全國死刑已决案件復核及官員敘復、昭雪等事宜。
刑部分左右曹，左曹負責死刑案件復核，右曹負責官員案件復核。</li>
<li>臺諫合一：御史臺與諫院合二爲一。皇權沒有監督。</li>
<li>地方州縣行政兼理司法。
州縣之上設立提點刑獄司，作爲中央在地方各路的司法派是構。</li>
<li>翻異別勘與證據勘驗。
<ul class="org-ul">
<li>翻異別勘
犯人否認其重罪口供，案件改由同級另一法官或另一司法機關審理。
“差官別推”（換法官審理）和移司別推（換司法機關審理）</li>
<li>證據勘驗
注重證據，重視現場勘驗，有《洗冤集錄》等世界最早的法醫學著作。</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="orgf9e3538"></a>元代“四等人”原则<br />
<div class="outline-text-4" id="text-orgf9e3538">
<p>
蒙漢異制，蒙古人、色目人、漢人和南人四等。
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org8421c8b" class="outline-2">
<h2 id="org8421c8b">明清时期的法律思想与制度</h2>
<div class="outline-text-2" id="text-org8421c8b">
</div>
<div id="outline-container-org9af4631" class="outline-3">
<h3 id="org9af4631">明至清中期</h3>
<div class="outline-text-3" id="text-org9af4631">
</div>
<ul class="org-ul">
<li><a id="orgb17b86e"></a>律例与大诰<br />
<div class="outline-text-4" id="text-orgb17b86e">
<ol class="org-ol">
<li>《大明律》
体例改为名例、吏户礼兵刑工七篇。
<ul class="org-ul">
<li>《元典章》六部顺序编律</li>
<li>仿唐律12篇，“名例”殿后</li>
<li>再次将“名例”冠于律首</li>
<li>最终定型七篇格局</li>
</ul></li>
<li>《明大诰》
《尚书·大诰》，“重典治世”，由明太祖亲审案例的汇编加“训导”构成。
在中国法制史上空前普及。朱元璋死后，大诰逐渐不再有法律效力。</li>
<li>《大清律例》
康熙、雍正两朝，仿《大明律》修订《大清律》。
乾隆元年，重新修订《大清律例》，大致同于《大明律》
颁布后极少修订，仅增其“附例”。
这是中国历史上最后一部封建成文法典，上承汉唐精神，又有清代政治特色。</li>
<li><p>
清代的例
条例、则例、事例、成例。
</p>
<ul class="org-ul">
<li>条例：刑事单行法规。</li>
<li>则例：某一行政部门或专门事务的单行法规。</li>
<li>事例：皇帝上谕或批准的政府建议。作为指导原则。</li>
<li>成例：经过整理编订的事例。</li>
</ul>
<p>
“例”不是案例，而是高度抽象条文化的表达。
形成“律例”关系：以“律”为宗、“例以辅律”的体例传统。
</p></li>
<li>明清会典
<ol class="org-ol">
<li>明会典。
《大明会典》仿《唐六典》，六部官制为纲，分述各行政机关职掌和事例，
性质属行政法典。</li>
<li>清会典。
仿效《大明会典》，先后修订“五朝会典”，统称《大清会典》。</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org0927709"></a>立法思想与刑罚原则<br />
<div class="outline-text-4" id="text-org0927709">
<ol class="org-ol">
<li>明刑弼教的立法思想
《尚来·大禹谟》，与“德主刑辅”有实质差别。
宋以前“明刑弼教”位“德主刑辅”之后，即是先教后刑；
宋代朱熹刻意提高刑的地位，将德局限为罚的目的。
朱元璋借“弼教”之口实，推行重典治国政策。</li>
<li>从重从新，“重其所重、轻其所轻”
<ul class="org-ul">
<li>刑罚从重从新。“凡律自颁降日为始，若犯在已前者，并依新律拟断”</li>
<li><p>
“重其所重”：贼盗钱粮等不分情节，一律重刑，扩大株连。
“轻其所轻”：典礼及风俗教化犯罪，明律处罚轻于唐律。
</p>
<pre class="example">
薛允升《唐明律合编》
</pre></li>
<li>清承明制，扩大和加重“谋反”“谋大逆”等的惩罚。
所有文字狱按谋反大逆定罪。</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org3b030d6"></a>罪名与刑罚<br />
<div class="outline-text-4" id="text-org3b030d6">
<ul class="org-ul">
<li>罪名：“奸党”罪。没有确定内容。</li>
<li>刑罚：充军刑（本人终身充军、子孙永远充军）
廷杖：法外用刑。</li>
</ul>
</div>
</li>
<li><a id="org0290576"></a>明清司法制度<br />
<div class="outline-text-4" id="text-org0290576">
<ol class="org-ol">
<li>司法机关
<ol class="org-ol">
<li><p>
中央司机构：刑部、大理寺、都察院。
</p>
<pre class="example">
明清刑部、大理寺的职能与唐宋相反。
</pre>

<ul class="org-ul">
<li>刑部：审理中央百官犯罪、地方重案，死刑交大理寺复核；
明清刑部下设清吏司分掌各省刑民案件。</li>
<li>大理寺：中央司法复核机关。
复核死刑案件、平反冤狱。</li>
<li>都察院：中央监察机构。
仅限会审及审理官吏犯罪案件， <i>并无监督法律执行的职能。</i>
明朝改御史台为都察院；清代都察院负责督察百官风纪，监督刑部、大理寺。</li>
</ul></li>
<li>地方司法机关
<ul class="org-ul">
<li>明代：省、府、县三级。
省级设提刑按察使司，判处徒刑以下案件；流刑以上报送中央批准执行。
府县行政兼理司法，有权审结笞杖案件。</li>
<li>清代：督抚、省按察司、府、县四级。
<ul class="org-ul">
<li>州县：决定笞、杖刑。</li>
<li>府：复审州县上报的刑事案件，提出拟罪人，上报。</li>
<li>省按察司：复审徒刑以上案件，而军流、死刑案件。
审供无异者，上报督抚；
上报案件有疑漏，驳回重审，或改发其他州县府重审。</li>
<li>督抚：批复徒刑案件、复核军流案件、复审死刑案件。</li>
</ul></li>
</ul></li>
</ol></li>
<li>明代管辖原则与厂卫司法
<ol class="org-ol">
<li>管辖制度
<ul class="org-ul">
<li>案件管辖：原告就被告、轻囚就重囚、少囚就多囚、后发就先发</li>
<li>军民分诉分辖制</li>
</ul></li>
<li>厂卫司法：即特务司法。
<ul class="org-ul">
<li>奉旨行事，厂卫作出判决，三司无权更改。</li>
<li>非法逮捕、行刑，不受法律约束。</li>
</ul></li>
</ol></li>
<li>会审制度
<ol class="org-ol">
<li>明代会审
<ul class="org-ul">
<li>三司会审。重大疑难案件由刑部大理寺都察院三法司共同会审。</li>
<li>九卿会审。罪犯经二审仍不服判决，
则由六部尚书、大理寺卿、左都御史、通政使九卿联合审判，报奏皇帝裁决。</li>
<li>朝审。每年霜降之后、三法司会同公侯伯爵，在吏部户部尚书主持下会审重囚。</li>
<li>大审。司礼监主持，大监居中主审。
这表明九卿抑于太监之下。</li>
</ul></li>
<li><p>
清代会审
</p>
<ul class="org-ul">
<li>秋审，审理全国各地上报的斩监候、绞监候，每年秋8月在天安门金水桥西进行</li>
<li>朝审，复审重案及斩监候、绞监候，每年霜降后10日举行。</li>
</ul>
<p>
两审程序后分四种情况：
</p>
<ul class="org-ul">
<li>情实：罪名恰当，则执行死刑</li>
<li>缓决：危害不大，减为流三千里，或再押监候办</li>
<li>可矜：有可疑之后，可免予死刑，减为徒流</li>
<li>留养承祀：有亲老丁单，按留养案奏请皇帝裁决。</li>
</ul>
<ul class="org-ul">
<li><p>
热审，对发生在京师的笞杖刑案件进行重审，
于暑热来临时，快速决、放在监笞、杖刑案犯。
</p>
<pre class="example">
热天容易爆发传染病。
</pre></li>
</ul></li>
</ol></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgd2809ae" class="outline-3">
<h3 id="orgd2809ae">清末</h3>
<div class="outline-text-3" id="text-orgd2809ae">
</div>
<ul class="org-ul">
<li><a id="orgc0e2959"></a>清末的法律思想<br />
<div class="outline-text-4" id="text-orgc0e2959">
<ol class="org-ol">
<li>律学：传统律学的延续
薛允升《唐明律合编》、沈家本《历代刑法考》、程树德《九朝律考》</li>
<li>君主立宪与国体之争。“国体”：国家典章制度。</li>
<li>朝贡体制式微与国际公法确立。
李鸿章、张之洞等接受国际公法理论，丁韪良《万国公法》</li>
<li><p>
代表人物法律思想
</p>
<pre class="example">
康有为梁启超：改良派
张之洞刘坤一劳乃宣：礼教派（保皇）
沈家本伍庭芳：法理派，与世界法律合流
</pre>

<ul class="org-ul">
<li>康有为：设议院开国会定宪法、三权鼎立建立君主立宪制</li>
<li>梁启超：以资产阶级宪政取代传统帝制专制</li>
<li>张之洞刘坤一：“变法奏议三折”
适应形势实施变法，中体西用，变法不得背离纲常名教</li>
<li>劳乃宣：法律不能违背风俗，坚持家族主义法律观，维护传统儒家纲常礼教</li>
<li>沈家本：采纳近代权力分立学说</li>
<li>伍廷芳：中西法律固不能相同，采各国通行之律，三权分立，司法独立</li>
<li>袁世凯：道德为体、法律为用，宪政思想摇摆不定、前后矛盾</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="orgd3b2495"></a>“预备立宪”及其相关文件<br />
<div class="outline-text-4" id="text-orgd3b2495">
<ol class="org-ol">
<li>根本原则：“ 大权统于朝廷、庶政公诸舆论</li>
<li>主要活动
<ul class="org-ul">
<li>1905 仿行宪政、派五大臣赴日本等国考察、设考查政治馆，后为宪政编查馆</li>
<li>1906 预备立宪上谕</li>
<li>1908 《钦定宪法大纲》</li>
<li>1909 谘议局、资政院</li>
<li>1911 武昌起义后发布《宪法重大信条十九条》</li>
</ul></li>
<li>《钦定宪法大纲》
<ul class="org-ul">
<li>清廷宪政编查馆编订，近代史上第一个宪法性文件。</li>
<li>结构：正文“君上大权”、附录“臣民权利义务”</li>
<li>特点：皇帝专权、人民无权。</li>
<li>实质：给皇权专制制度披上“宪法”的外衣，以法律的刑式确认君主的绝对权力。</li>
</ul></li>
<li>“十九信条”
<ul class="org-ul">
<li>资政院起草的宪法性文件</li>
<li>在形式上被迫缩小了皇帝的权力，仍然强调皇权至上</li>
</ul></li>
<li>谘议局与资政院
<ul class="org-ul">
<li>谘议局：“地方咨询机关”</li>
<li>资政院：“中央咨询机构”，皇帝有权谕令资政院停会或解散</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org0ac4062"></a>清末修律的主要内容<br />
<div class="outline-text-4" id="text-org0ac4062">
<ol class="org-ol">
<li>《大清现行刑律》《大清新刑律》
<ul class="org-ul">
<li>在《大清律例》的基础上的过渡性法典。
取消了六律总目，对民事性质的条款不再科刑；
废除了一些残酷的刑罚手段，增加了一些新罪名。</li>
<li>《大清新刑律》，中国历史上第一部近代意义上的专门刑法典。
依然维护专制制度和封建伦理。</li>
</ul></li>
<li>《大清商律草案》《大清民律草案》
<ul class="org-ul">
<li>清末商事立法。
<ul class="org-ul">
<li>第一阶段，主要由商部负责，《商人通例》《公司律》定名《钦定大清商律》</li>
<li>第二阶段由修订法律馆主持，《大清商律草案》。</li>
</ul></li>
<li>《大清民律草案》“中学为体，西学为用”。</li>
<li>诉讼法律与法院编制法。
《大清刑事诉讼律草案》《大清民事诉讼律草案》
《大理院编制法》《各级审判厅试办章程》《法院编制法》</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="orgba9e7ad"></a>清末司法体制的变化<br />
<div class="outline-text-4" id="text-orgba9e7ad">
<ol class="org-ol">
<li>司法机构改革与四级三审制
<ol class="org-ol">
<li>改刑部为法部，掌司法行政；改大理寺为大理院，为最高审判机关。
检审合署，大理院和各级审判厅内设检察厅。</li>
<li>实行四级三审制，规定刑事案件公诉制度、证据、保释制度。</li>
</ol></li>
<li>治外法权及其机构
<ul class="org-ul">
<li>领事裁判权，五口通商章程与虎门条约确立。
管辖按被告主义原则。</li>
<li>观审。一国领事官有权观审该国人为原告的案件。</li>
</ul></li>
<li>会审公廨，又称会审公堂。
凡涉及外国人之间、中国人与外国人之间、租界内纯属中国人之间的诉讼，
均由外国领事观审并操纵判决。</li>
</ol>
</div>
</li>
