public_html/理论法.html
<li><a id="org837fdf0"></a>清末变法修律的主要特点与影响<br />
<div class="outline-text-4" id="text-org837fdf0">
<ol class="org-ol">
<li>主要特点
<ol class="org-ol">
<li>清末修律仿效外国资本主义法律刑式、固守中国封建法制传统。</li>
<li>内容：封建专制主义传统与西方资本主义法学最新成果的奇怪混合；</li>
<li>法典编纂形式：改变了传统的诸法合体形式，形成了近代法律体系的雏形。</li>
<li>没有反映人民的要求和愿望，不具有真正的民主因素。</li>
</ol></li>
<li>主要影响
<ul class="org-ul">
<li>中华法系开始解体，“依伦理而轻重其刑”的特点受到极大冲击；</li>
<li>为中国法律现代化奠定了基础；</li>
<li>一定程度上引进和传播了西方近现代的法律学说和法律制度</li>
<li>在客观上有助于推动中国资本主义经济发展、教育制度近代化</li>
</ul></li>
</ol>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org84c8349" class="outline-2">
<h2 id="org84c8349">中华民国时期的法律思想与制度</h2>
<div class="outline-text-2" id="text-org84c8349">
</div>
<div id="outline-container-org8742685" class="outline-3">
<h3 id="org8742685">民国初期、南京临时政府</h3>
<div class="outline-text-3" id="text-org8742685">
</div>
<ul class="org-ul">
<li><a id="org5416c06"></a>民国初期<br />
<div class="outline-text-4" id="text-org5416c06">
<ol class="org-ol">
<li>孙中山的法律思想
<ul class="org-ul">
<li>三民主义：民族主义、民权主义和民生主义。
旧三民主义只保护资产阶段利益。</li>
<li>五权宪法
在行政权、司法权、立法权之外又加上监察权、考试权。</li>
</ul></li>
<li>章太炎与宋教仁的法律思想
<ul class="org-ul">
<li>章太炎：推崇民主共和，坚决反对君主专制；国家至上
权力分立，法律保护下层民众的利益，强调法治</li>
<li>宋教仁：议会政治、民主的立宪政体
内阁责任制</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org4a5ef1e"></a>南京临时政府<br />
<div class="outline-text-4" id="text-org4a5ef1e">
<ol class="org-ol">
<li>《修订中华民国临时政府组织大纲》与《中华民国临时约法》的制定
<ul class="org-ul">
<li>《修订中华民国临时政府组织大纲》
中华民国第一部全国性的临时宪法文件。
<ul class="org-ul">
<li>采用总统制共和政体</li>
<li>三权分立原则</li>
<li>一院制议会政治体制，参议院是国家立法机关。
孙中山被选为南京临时政府第一任临时大总统。</li>
</ul></li>
<li>《中华民国临时约法》
具有临时宪法的性质，效力同等于宪法。最初的资产阶级宪法性文件。
<ul class="org-ul">
<li>总统制改为责任内阁制</li>
<li>扩大参议院的权力</li>
<li>规定特别修改程序，议员提议、出席、赞成</li>
</ul></li>
</ul></li>
<li>其他法令的主要内容和特点
<ul class="org-ul">
<li>解除贱民身份、禁止买卖人口；提高女权；废特权陋习</li>
<li>禁烟禁赌；劝禁缠足；剪辫易服</li>
<li>整饬吏治、任人唯贤</li>
</ul></li>
<li>南京临时政府的司法制鹿
<ul class="org-ul">
<li>建立新型司法机关
<ul class="org-ul">
<li>中央设“临时中央裁判所”作为全国最高审判机关
地方称“审判厅”，分省府县三级，四级三审</li>
<li>审检合署</li>
<li>法官独立审判，不受上级干涉</li>
<li>司法人员必须经法官考试合格后方能录用</li>
<li>法官在任中不得减俸pdym职</li>
</ul></li>
<li>改革审判制度（废除刑讯体罚）
<ul class="org-ul">
<li>提倡人道，注重民生</li>
<li>任何案件一概不准刑讯</li>
<li>中央司法部随时派员巡视各地、严惩“不肖官吏”</li>
</ul></li>
<li>采用律师制度</li>
</ul></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org696aa11" class="outline-3">
<h3 id="org696aa11">北京政府和南京国民政府</h3>
<div class="outline-text-3" id="text-org696aa11">
</div>
<ul class="org-ul">
<li><a id="orgb6c8c73"></a>北京政府（北洋政府）<br />
<div class="outline-text-4" id="text-orgb6c8c73">
<ol class="org-ol">
<li>立法概况
<ol class="org-ol">
<li>制宪活动
<ul class="org-ul">
<li>“天坛宪草”，《中华民国宪法（草案）》，北洋政府第一部宪法草案。
限制总统权力，但没有公布。</li>
<li>“袁记约法”，《中华民国约法》，军阀专制全面确立的标志。
<ul class="org-ul">
<li>彻底否定了《中华民国临时约法》的民主共和制度</li>
<li>用总统独裁否定了责任内阁制</li>
<li>用有名无实的立法院取消了国会制</li>
<li>为限制否定《中华民国临时约法》规定的人民基本权利提供了宪法根据</li>
</ul></li>
<li>“贿选宪法”，《中华民国宪法》
中国近代史上首部正式颁行的宪法</li>
</ul></li>
<li>其他立法：沿用前清法律</li>
</ol></li>
<li>北京政府法律的主要内容与特点
沿用前清旧律的刑法原则；严刑镇压内乱罪；维护地主官僚买办利益</li>
<li><p>
司法制度
司法机关体系庞杂，法院分为普通法院、兼理司法法院、特别法院和 <i>平政院</i> 。
</p>
<ul class="org-ul">
<li>普通法院
<ul class="org-ul">
<li>大理院：最高审判机关</li>
<li>高等审判厅</li>
<li>地方审判厅</li>
<li>初等审判厅</li>
</ul></li>
<li>兼理司法法院：未设普通法院的各县所设兼理司法机关。</li>
<li>特别法院：军事审判机关和地方特别审判机关（少民与特别区域）</li>
<li>平政院：主管行政诉讼。</li>
</ul>
<p>
诉讼审判的主要特点
</p>
<ol class="org-ol">
<li><i>运用判例和解释</i></li>
<li>四级三审制</li>
<li>县知事兼理司法</li>
<li><i>军事审判取代普通审判</i> ，军法会审重于其他审判</li>
<li>北京政府 <i>承认领事裁判权</i> 。</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org16b7d7f"></a>南京国民政府<br />
<div class="outline-text-4" id="text-org16b7d7f">
<ol class="org-ol">
<li>立法概况
<ul class="org-ul">
<li>指导思想：三民主义，“以党治国”。法典编制采取资产阶级国家法律体系</li>
<li>以立法院为立法机关，一党专政、蒋氏独裁</li>
<li>法律体系：制定法、判例、解释例、党规党法、蒋氏手谕。</li>
<li>立法特点
继受法与固有法的混合；立法权限受制于国民党中央；与司法实践脱节</li>
</ul></li>
<li>六法全书
<ul class="org-ul">
<li>宪法
《训政纲领》《训政时期约法》《中华民国宪法草案》《中华民国宪法》
不完全责任内阁、实质的总统制。</li>
<li>民法
<ul class="org-ul">
<li>承认习惯和法理可作为判案依据</li>
<li>保护传统婚姻家庭关系，结婚采用仪式制而非登记制</li>
</ul></li>
<li>刑法
<ul class="org-ul">
<li>1928《中华民国刑法》，首部以“刑法”相称的刑法典</li>
<li>1935新刑法，增设保安处分专章</li>
</ul></li>
<li>商法
民商合一，《公司法》《保险法》《银行法》等作为民法特别法</li>
<li>民诉：《民事诉讼法》及单行诉讼法规等</li>
<li>刑诉：《刑事诉讼法》</li>
</ul></li>
<li>司法制度
<ul class="org-ul">
<li>司法机关体系：司法院、普通法院、特别法庭</li>
<li>审判制度：一告九不理、自由心证、不干涉主义</li>
<li>律师公证制度</li>
</ul></li>
</ol>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org08170dd" class="outline-2">
<h2 id="org08170dd"><span class="done _">✘</span> 中国特色社会主义法治建设基本原理</h2>
</div>
<div id="outline-container-orge94d12b" class="outline-2">
<h2 id="orge94d12b"><span class="done _">✘</span> 法治工作的基本格局</h2>
</div>
<div id="outline-container-orgfbed650" class="outline-2">
<h2 id="orgfbed650"><span class="done _">✘</span> 法治工作的重要保障</h2>
</div>
<div id="outline-container-org6ca9bd3" class="outline-2">
<h2 id="org6ca9bd3">司法制度和法律职业道德概述</h2>
<div class="outline-text-2" id="text-org6ca9bd3">
</div>
<div id="outline-container-orgd2ac6de" class="outline-3">
<h3 id="orgd2ac6de">中国特色社会主义司法制度概述</h3>
<div class="outline-text-3" id="text-orgd2ac6de">
</div>
<ul class="org-ul">
<li><a id="org79b4854"></a>司法的概念和特征<br />
<div class="outline-text-4" id="text-org79b4854">
<p>
国家 <i>司法机关</i> 根据法定职权和法定程序，具体应用法律处理案件的专门活动。
</p>
<ol class="org-ol">
<li><p>
司法的概念
法学分属于政治学，而司法又属于法学。
</p>
<ul class="org-ul">
<li>乔治·劳森：政府职权的三重划分</li>
<li><p>
洛克：分权理论，孟德斯鸠：司法独立，以权制权。
司法与立法、行政相对，而法院是司法机关。
</p>
<pre class="example">
现代国家的建立基础是分权与卢梭的人民主权。
</pre></li>
</ul>
<p>
我国古代行政与司法不分，诉讼审判体现出专制。
新中国建立后实行“议行合一”的人民代表大会制度。
</p></li>
<li>司法的特征
<ol class="org-ol">
<li>独立性，司法机关只服从于法律</li>
<li><p>
被动性，“不告不理”
</p>
<pre class="example">
人民检察院虽然是司法（法律监督）机关，但是有“双重属性”
既监督法律活动，如行政机关、公安局、法院、狱政机关
但又是有提起公诉的权利的行政机关。
</pre></li>
<li>交涉性，离不开多方利益主体的诉讼参与</li>
<li>程序性，处理案件必须依据相应的程序法规定</li>
<li>普遍性，形式上个别事件获得普遍性，
实质上司法解决其他机关所不能解决的 <i>一切纠纷</i> 。</li>
<li>终极性，解决纠纷、处理冲突的最后环节。</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org2e30a38"></a>司法功能<br />
<div class="outline-text-4" id="text-org2e30a38">
<ol class="org-ol">
<li>应然功能与实然功能
<ul class="org-ul">
<li>应然功能：司法功能的应然期待</li>
<li>实然功能：司法实际上发挥什么样的功能</li>
</ul></li>
<li>直接功能与间接功能
<i>解决纠纷</i> 是直接功能，人权保障、调整社会关系等都是间接功能。
<ol class="org-ol">
<li>解决纠纷，是司法制度的普遍特征，其他功能得以发挥的先决条件。</li>
<li>调整社会关系</li>
<li>人权保障</li>
<li>解释、补充法律</li>
<li>形成公共政策、秩序维持、文化支持</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="orgbc5f580"></a>中国特色社会主义司法制度<br />
<div class="outline-text-4" id="text-orgbc5f580">
<p>
司法制度是关于司法功能、司法机构、司法组织、
司法程序、司法机制等方面规范的总称。
大多数西方国家、司法制度仅指审判制度。我国司法制度指审判和检察制度。
司法机关：审判机关和检察机关
司法组织：律师组织、公证组织
</p>
<pre class="example">
律师不代表国家公权力，不称机关而称组织。
以前律师和公证处是国家机关，可以“配枪”
在律师走向市场化之后，就与国家机关脱离了。
</pre>


<ol class="org-ol">
<li>司法规范体系</li>
<li>司法组织体系</li>
<li>司法制度体系
侦查、检察、审判、监狱、律师、公证
人民调解、人民陪审、死刑复核、审判监督、司法解释、案例指导</li>
<li>司法人员管理体系
司法人员指侦查、检察、审判、监管职责的工作人员和辅助人员。</li>
</ol>
</div>
</li>
<li><a id="org723afc0"></a>司法公正<br />
<div class="outline-text-4" id="text-org723afc0">
<p>
公正是人们所追求的崇高理想、价值和目标，也是法治的灵魂和核心。
</p>
<ol class="org-ol">
<li>传统中国的司法公正
晋代刘颂严格区分了君臣在司法公正方面各自的职责。</li>
<li>近代西方的司法公正
正义是法律制度应当具备的优良品质。
实体正义：案件事实真想的发现和对实体法的正确适用
程序正义：程序的正当性和合理性
程序公正具有独立价值。</li>
<li>司法公正的具体体现：中参公平合廉政
<ul class="org-ul">
<li>合法性：每一具体环节和步骤都要按照规定的权限和程序进行</li>
<li><p>
中立性：法官跟当事人的司法距离保持同等、态度超然
利益无涉、不存其偏、情感自控、避免前鉴
</p>
<pre class="example">
庭审形式转实质化，不能在开庭前就形成了判断
</pre></li>
<li>公开性：诉讼程序的每一阶段和步骤都应当让当事人和社会公众看得见
《决定》提出司法公开要求</li>
<li>平等性：当事人权利平等、受保护平等</li>
<li>参与性：诉讼参与人应当有充分的机会富有意义地参与诉讼的过程
有效地影响和作用于裁判结果的形成。</li>
<li>正确性：事实要调查清楚、案件定性准确，处理适当</li>
<li><p>
廉洁性：严禁 <i>司法掮客、利益输送</i> ，
严禁司法人员与当事人律师特殊关系人中介组织有以下行为：
</p>
<ul class="org-ul">
<li>泄露司法机关办案工作秘密</li>
<li>为当事人推荐介绍诉讼代理人、律师，为律师拉案源</li>
<li>接受请客送礼或其他利益</li>
<li>向人借款、租借房屋、借用交通工具、通讯工具、其他物品</li>
<li>徇私舞弊、与中介组织和人员恶意串通、弄虚作假</li>
<li>其他不正当接触交往行为</li>
</ul>
<p>
司法人员应当在工作场所、工作时间接待四类人。
在非工作时间或非工作场所接触的，在3日内向本单位纪检监察部门报告。
</p>
<pre class="example">
“司法人员”：两高三部人员，最高法最高检公安部国安部司法部
“特殊关系人”：当事人父母配偶子女同胞兄弟姊妹
</pre></li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org2acad97"></a>司法效率<br />
<div class="outline-text-4" id="text-org2acad97">
<p>
在审限时间之间完成案件。
没有效率就谈不上公正，不公正则效率也无从说起。
迟来的正义，就不再是正义。
公正优先，兼顾效率。
</p>
</div>
</li>
<li><a id="org9b05262"></a>审判独立与检察独立<br />
<div class="outline-text-4" id="text-org9b05262">
<p>
审判独立与检察独立是现代法治国家普遍承认的一项基本法律准则。
司法独立的法官可以自由依法裁决。
</p>

<p>
司法独立原则由孟德斯鸠提出三权分立。
</p>
<ul class="org-ul">
<li>权力专属：司法权归司法机关，其他机关不得司法。</li>
<li>司法机关独立行使职权，不受干涉。</li>
<li>正确行使权利。</li>
</ul>
</div>
</li>
<li><a id="org3bcc1f8"></a>司法改革<br /></li>
</ul>
</div>
<div id="outline-container-orgf54615a" class="outline-3">
<h3 id="orgf54615a">法律职业道德概述</h3>
<div class="outline-text-3" id="text-orgf54615a">
</div>
<ul class="org-ul">
<li><a id="org8c9e498"></a>法律职业的概念和特征<br />
<div class="outline-text-4" id="text-org8c9e498">
<ol class="org-ol">
<li>法律职业共同体：审检律公、法顾仲裁，三类公务员，
立法工作者、其他行政执法人员、法学教育研究工作者。
核心人员：法官、检察官、律师、法学家</li>
<li>初任法律职业、应当通过国家统一法律职业资格考试。
法官、检察官和三类公务员还要遵守公务员法。</li>
<li>法律职业具有政治性、法律性、行业性和专业性。</li>
</ol>
</div>
</li>
<li><a id="org16d8103"></a>法律职业道德的概念和特征<br />
<div class="outline-text-4" id="text-org16d8103">
<ol class="org-ol">
<li>法律职业道德：法律职业人员应当遵循的道德规范。
心理意识、行为准则、行为规范的总和。</li>
<li>四个特征
<ul class="org-ul">
<li>职业性：只在职业活动中实行</li>
<li>实践性：只有实践中体现道德</li>
<li>正式性：用正式文件写明道德</li>
<li>更高性：约束更强</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="orgf5f3a64"></a>法律职业道德的基本原则<br />
<div class="outline-text-4" id="text-orgf5f3a64">
<p>
政治正确保密配合尽职清廉
配合：应与权力机关、上级部门，公检法分工负责互相配合互相制约。
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgafa0bbd" class="outline-2">
<h2 id="orgafa0bbd">审判制度和法官职业道德</h2>
<div class="outline-text-2" id="text-orgafa0bbd">
</div>
<div id="outline-container-org1c56353" class="outline-3">
<h3 id="org1c56353">审判制度概述</h3>
<div class="outline-text-3" id="text-org1c56353">
<p>
审判制度指国家审判机关运用法律，处理诉讼案件和非诉事件的制度。
包括审判机关、审判组织、审级制度、审判方式。
</p>
<ol class="org-ol">
<li>两审终审制度</li>
<li>审判公开制度</li>
<li>人民陪审员制度</li>
<li>审判监督制度/再审制度，纠错</li>
</ol>
</div>
<ul class="org-ul">
<li><a id="org6807cce"></a>我国审判制度的特征<br />
<div class="outline-text-4" id="text-org6807cce">
<ol class="org-ol">
<li>政治性、人民性</li>
<li>统一性、单一性
<ul class="org-ul">
<li>只有一套法院系统，不设独立行政法院。
对比美国会有联邦和州二元制的司法制度。</li>
<li>人民法院独立行使审判权，不是合议庭或法官。</li>
</ul></li>
<li>民族性、特殊性</li>
</ol>
</div>
</li>
<li><a id="org01fc003"></a>审判制度的基本原则<br />
<div class="outline-text-4" id="text-org01fc003">
<p>
五个：
</p>
<ul class="org-ul">
<li>司法公正</li>
<li>审判独立：人民法院独立审判</li>
<li>不告不理：我不告不能理，告什么理什么，告什么我做主</li>
<li>直接言词：法官亲自参加，用言词形式质证辩论</li>
<li>及时审判：法庭应当集中审理，不中断审理。
<ul class="org-ul">
<li>法院开庭审理，应当在不更换审判人员的条件下连续进行。</li>
<li>每起案件自始至终应由同一法庭进行审判</li>
<li>法庭成员不得更换</li>
</ul></li>
</ul>
</div>
</li>
