src/理论法.org
*** 审判机关
地方各级人民法院、专门人民法院、最高人民法院
*** 法官
法官包括院长、副院长、审判委员会委员、庭长、副庭长和审判员。
法院人员包括法官、审判辅助人员（法官助理）和司法行政人员。
: 司法行政人员：办公室、政工科、政策研究室等人员
: 法官助理在法官指导下负责审查案件材料、草拟法律文书等。
**** 法官的条件和任免
   - 一般条件
     + 中国国籍，拥护宪法、正常履行职责的身体条件
     + 全日制法学学历（本硕博）
     + 从事法律工作满5年
     + 通过法考
   - 禁止条件：开除、吊销、除名、犯罪，其他情形
   - 限制条件：当上法官则不能兼任其他专职活动
     : 比如人大代表是一个兼职工作，但人大常委会成员则是全职。
   - 任免程序：本级人大选举法院院长，
     本级人大决定任免法院其他成员，
     特殊中院由上一级人大空降任免。
   - 法官免职情形：出丧请免职被调、考核不过长吃药，退休辞职被拿掉
     + 丧：丧失中国国籍
     + 调：调出所任人民法院
     + 长吃药：因健康原因长期不能任职
   - 法官遴选
     + 院长：应当具有法学专业知识和法律职业经历
       副院长等应具备法官条件。
       : 院长不需要通过法考，因为是人大选举产生的
       : 更多时候院长委派其他人工作，院长提出意见
     + 初任法官由高院统一招录，一般到基层人民法院任职。
       逐级遴选，最高法和省高法从下两级人民法院遴选。
       受遴选法官应担任一定年限，具有遴选职位相关的工作经历。
       违法任命的，任命机关应当撤销任命；
       上级发现下级任命违法的，应当 /建议/ 提请任命机关撤销。
   - 法官回避
     + 有夫妻关系、直系血亲、三代以内旁系血亲以及近姻亲关系的
       只允许同时担任同一法院不同法庭的庭长副庭长审判员。
       上下相邻两级人民法院只禁职正副职。
     + 任职回避：配偶、父母、子女，
       在法官任区人民法院辖区之内不能开律所。
     + 法官离任两年不得担任诉讼代理人辩护人，不得到原任职法院。
       作为监护人或近亲属的除外。
       被开除的法官再不得担任，作为监护人或近亲属的除外。
**** 法官职责权利与义务
1. 职责：依法审判案件
2. 权利
   - 履行法官职责应当具有的职权和工作条件
   - 不被调离免职降职辞退处分
   - 职业保障和福利待遇
   - 提出申诉或控告
3. 义务
   - 依法保障当事人和其他诉讼参与人的诉讼权利
   - 保守国家秘密、审判工作秘密、商业秘密和个人隐私
   - 以案释法、增强全民法治观念
**** 法官的考核、培训、奖励和惩戒
1. 考核
   5到9人的法官考评委员会，主任由院长担任。
   考核结果可用于调级、调薪、奖惩、免职、降职、辞退的依据。
2. 统一职前培训，培训情况作为法官任职、等级晋升的依据之一。
3. 奖励：只要是显著突出的工作都予以奖励。
4. 处分
   - 法定情节处分
   - 最高法和省高院的惩戒委。从专业角度评判是否违反审判职责。
   - 组成：半数以上自己人（法官）
   - 有异议可以向惩戒委提出。
**** 法官的职业保障
职业保障、工资保险福利保障、人身和财产保障。
法官权利与义务适用于法官法。
** 法官职业道德
*** 法官职业道德的特征
主体特定、内容全面、约束广泛。
*** 法官职业道德的内容
1. 忠诚司法事业，不得罢工
2. 保证司法公正，维护审判独立、确保结果公平公正，
   实体公正和程序公止并重、提高司法效率、公开审判、
   遵守回避保持中立（不得歧视），尊重其他法官（不过问不干预案件）
3. 确保司法廉洁，利益不论大小均应拒绝。
   不得从事或参与营利性经营活动，不得提供实质性的咨询意见
   不得以其身份谋取特殊利益，教育督促家庭成员不利用职权获利
4. 坚持司法为民，司法便民，不得随意打断或制止当事人和参与人发言
5. 维护司法形象，发表文章接受采访时不得针对具体案件和当事人进行评论

*** 法官职业责任
造成不良影响的警告记过或记大过
情节较重的降级撤职
情节严重的开除
* 检察制度和检察官职业道德
** 检察制度概述
检察官代表国家向法院提起诉讼，维护法律事实。
三种类型检察制度：英美法系、大陆法系、社会主义国家。
*** 检察制度的特征
1. 检察机关与行政机关、监察机关、审判机关平行。
2. 检察机关是国家的法律监督机关。
3. 检察一体原则。检察长领导本院检察工作，重大事项由检察长决定，
   上级领导院领导下一级的工作。 
*** 检察制度与基本原则
- 检察院设置法定原则
- 检察院独立行使原则
- 司法公正原则
- 司法责任原则
- 接受人民群众监督原则
- 对诉讼活动实行法法律监督原则
- 检察权统一行使原则/检察一体化原则
  检察官与检察机关构成统一整体。
*** 检察官
与法官规定相同。
- 条件和任免
  违法任命检察官可以要求撤销。（领导关系）
  回避情况只允许不同业务部门的检察员。
- 职责义务和权利
- 考核培训奖励和惩戒
- 职业保障
** 检察官职业道德
忠诚、为民、担当、公正、廉洁。
公正：独立履职、理性履职、履职回避、重视证据、遵循程序、保障人权，
尊重律师和法官、遵守纪律、提高效率

: 廉洁：法官和检察官能炒股吗？
: 答：可以，不收黑钱，信源正当。
* 律师制度和律师职业道德
** 律师制度
*** 律师
依法取得律师执业证书、接受委托或者𢩽定，为当事人提供法律服务的执业人员。
社会律师、公司律师、公职律师、军队律师。

- 专业性
- 服务性
- 受托性（不受托就不服务）

律师执业资格条件：
1) 拥护宪法、通过法考、实习1年、品行良好
2) 特殊条件：从事专业15年，高等职称搞科研，考核合格
3) 禁止条件：无行为能力的，受刑事处罚的（过失犯罪除外），被吊销执业证书的
4) 限制条件：公务员不能兼职律师，律师可以兼任人常（不能接案）
   只能在一个律师事务所执业。


申请律师执业证书的程序
1) 律师资格与律师执业相分离，有资格不一定需要执业
2) 向市政府或直辖市的区政府司法部门申请


律师权利与义务
- 律师被停止执业处罚期间不能变更执业机构
- 律师受调查期间不得注销执业证书
- 应加入律协
- 不能私自收费
- 不能以提供法律服务的便利牟取当事人争议的利益
- 不能为双方担任代理人，法定情形除外

*** 律师制度，律师收费制度
“两结合”司法局和律协相结合

1. 统一收费：律所统一接受委托，统一收费
2. 收费类别：办案费和律师费
   办案费实办实销，客观发生
   律师费较主观，属于服务费
3. 收费方式：政府指导或市场调节
   政府指导项目：
   刑案工伤劳报，三养两金双保，公益群诉，国家赔，省级两厅指导
   “两厅”：省物价厅、省司法厅
4. 市场调节：风险代理收费，涉及财产关系的民事案件
   最高收费不超过收费合同的三成。
   以下禁止风险代理收费：
   婚姻继承工伤劳报，三养两金双保，（严禁）行刑国赔群诉
** 律师事务所
1. 律所是律师的执业机构，也是市场中介组织。
   律所不得从事法律服务以外的经营活动。
2. 律所的设立：名称、住所、章程，一定的律师和资产，设立人三年没停业
   个人律所，合伙律所，国资律所
** 法律援助制度
1. 国家来援助经济困难或特殊案件的当事人。
2. 特征：
   - 援助无偿，不收钱
   - 主体特定，政府提供法援，
     具体实施包括律师、机构工作人员，基层工作者，社会团体等。
   - 统一实施。统一受理、统一审查、统一指派、统一监督
3. 形式丰富。刑事或民事辩护、法律咨询（无须审查经济状况）

法律援助对象及其范围
1. 刑事案件：知障一二级、共犯没有辩护人，检方来抗诉，影响很重大
   指定援助：盲聋哑半疯傻 无期死刑未长大 强制医疗外国人 经济困难或其他
2. 民事行政案件：两金三养两保 国赔勇为劳报


法律援助终止和救济
救济程序：法律性质纠正申诉控告找检察院，对法援有异议找司法局
** 律师职业道德与执业行为规范
忠诚为民 法治正义 诚信敬业

律师业务推广：社会活动、推广广告
- 广告不能损宁律师形象
- 不得艺术夸张
- 不能让人产生不合理的期望

律师与委托人关系
- 谨慎诚实客观告知法律风险
- 有权选择相应方案
- 承办业务及时通报进度
- 禁止虚假承诺。律师的辩护代理意见未被采纳不属于虚假承诺
- 禁止非法牟取委托人利益
- 应进行利益冲突审查

* 公证制度和公证员职业道德
** 公证制度概述
公证：对真实性、合法性予以证明，赋予法律效力。与私证相对。
管理制度“两结合”：公证协会、司法局
1. 公证是一种特殊的证明活动：主体特殊、内容和对象特定
   对象：没有争议的民事法律行为，有法律意义的事实和文书
   公证可以作为证据，除非有相反证据足以推翻。
2. 公证是非诉的司法活动。


公证机构与公证员
1. 公证机构不以营利为目的，（还是要收服务费）
   任法独立行使公证职能、承担民事责任。
   - 设立：所在地司法行政机关组建，报省级司法行政机关审批
   - 条件：有名称、场所、公证员、资金
   - 冠名：市或辖区，加字号：“四川省成都市 /律政/ 公证处”
     县及公证处没有字号。
2. 公证员，特殊条件：法律服务满10年公务员
   禁止条件：故意犯罪或职务过失犯罪受刑事处罚的
   任免：上报省司法厅审核同意，报请国务院司法部同意


公证程序
1. 申请：可以向住所地、经常居住地、行为地、事实发生地四个地提出。
   涉及不动产的，只能向不动产所在地提出。
   2个以上当事人可以共同去申办。
   申请2个以上公证处，由最先受理申请的公证机构办理。
2. 公证代理：除遗嘱、生存收养必须本人申办
   港澳台地区当事人，在居住地公办机构或司法部指定机构做证明。
** 公证员职业道德
公信力：不仅适用于执业公证员，也适用于辅助人员，其他工作人员。
忠于法律，尽职履责，爱岗敬业，规范服务，
加强修养，提高素质，廉洁自律，尊重同行。
* 其他法律职业人员职业道德
** 法律顾问职业道德
狭义法顾：律师
广义法顾：包括律师和其他法律服务专业人员
以法顾素质，从“法律咨询者”变为“法治守护者”。
惩戒处分、行政法律责任、民事法律责任、刑事法律责任。

** 仲裁员职业道德
法律类仲裁员。除此之外是劳动争议、农村土地承包的仲裁员。
仲裁委员会选任：公道正派。
职业道德：独立公正， /主动披露/ 与当事人或代理人的某种关系。

职业责任：《仲裁法》没有规定 /民事责任/ 。坐牢但不赔钱
** 行政机关中从事行政处罚决定审核、行政议、行政裁决的公务员职业道德
三类特殊的公务员。

双重主体资格：有 /编制/ 、有资质（行政执法权）。

基本要求：《公务员法》
特定要求：合法、公正、透明、高效
职业责任：行政责任与刑事责任，人身纪律财产刑事
