public_html/理论法.html
<li><a id="org5e4b1e8"></a>审判机关<br />
<div class="outline-text-4" id="text-org5e4b1e8">
<p>
地方各级人民法院、专门人民法院、最高人民法院
</p>
</div>
</li>
<li><a id="org3eef4ba"></a>法官<br />
<div class="outline-text-4" id="text-org3eef4ba">
<p>
法官包括院长、副院长、审判委员会委员、庭长、副庭长和审判员。
法院人员包括法官、审判辅助人员（法官助理）和司法行政人员。
</p>
<pre class="example">
司法行政人员：办公室、政工科、政策研究室等人员
法官助理在法官指导下负责审查案件材料、草拟法律文书等。
</pre>
</div>
<ul class="org-ul">
<li><a id="orgbe82b90"></a>法官的条件和任免<br />
<div class="outline-text-5" id="text-orgbe82b90">
<ul class="org-ul">
<li>一般条件
<ul class="org-ul">
<li>中国国籍，拥护宪法、正常履行职责的身体条件</li>
<li>全日制法学学历（本硕博）</li>
<li>从事法律工作满5年</li>
<li>通过法考</li>
</ul></li>
<li>禁止条件：开除、吊销、除名、犯罪，其他情形</li>
<li><p>
限制条件：当上法官则不能兼任其他专职活动
</p>
<pre class="example">
比如人大代表是一个兼职工作，但人大常委会成员则是全职。
</pre></li>
<li>任免程序：本级人大选举法院院长，
本级人大决定任免法院其他成员，
特殊中院由上一级人大空降任免。</li>
<li>法官免职情形：出丧请免职被调、考核不过长吃药，退休辞职被拿掉
<ul class="org-ul">
<li>丧：丧失中国国籍</li>
<li>调：调出所任人民法院</li>
<li>长吃药：因健康原因长期不能任职</li>
</ul></li>
<li>法官遴选
<ul class="org-ul">
<li><p>
院长：应当具有法学专业知识和法律职业经历
副院长等应具备法官条件。
</p>
<pre class="example">
院长不需要通过法考，因为是人大选举产生的
更多时候院长委派其他人工作，院长提出意见
</pre></li>
<li>初任法官由高院统一招录，一般到基层人民法院任职。
逐级遴选，最高法和省高法从下两级人民法院遴选。
受遴选法官应担任一定年限，具有遴选职位相关的工作经历。
违法任命的，任命机关应当撤销任命；
上级发现下级任命违法的，应当 <i>建议</i> 提请任命机关撤销。</li>
</ul></li>
<li>法官回避
<ul class="org-ul">
<li>有夫妻关系、直系血亲、三代以内旁系血亲以及近姻亲关系的
只允许同时担任同一法院不同法庭的庭长副庭长审判员。
上下相邻两级人民法院只禁职正副职。</li>
<li>任职回避：配偶、父母、子女，
在法官任区人民法院辖区之内不能开律所。</li>
<li>法官离任两年不得担任诉讼代理人辩护人，不得到原任职法院。
作为监护人或近亲属的除外。
被开除的法官再不得担任，作为监护人或近亲属的除外。</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="orgfa26cf9"></a>法官职责权利与义务<br />
<div class="outline-text-5" id="text-orgfa26cf9">
<ol class="org-ol">
<li>职责：依法审判案件</li>
<li>权利
<ul class="org-ul">
<li>履行法官职责应当具有的职权和工作条件</li>
<li>不被调离免职降职辞退处分</li>
<li>职业保障和福利待遇</li>
<li>提出申诉或控告</li>
</ul></li>
<li>义务
<ul class="org-ul">
<li>依法保障当事人和其他诉讼参与人的诉讼权利</li>
<li>保守国家秘密、审判工作秘密、商业秘密和个人隐私</li>
<li>以案释法、增强全民法治观念</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="orge6161b3"></a>法官的考核、培训、奖励和惩戒<br />
<div class="outline-text-5" id="text-orge6161b3">
<ol class="org-ol">
<li>考核
5到9人的法官考评委员会，主任由院长担任。
考核结果可用于调级、调薪、奖惩、免职、降职、辞退的依据。</li>
<li>统一职前培训，培训情况作为法官任职、等级晋升的依据之一。</li>
<li>奖励：只要是显著突出的工作都予以奖励。</li>
<li>处分
<ul class="org-ul">
<li>法定情节处分</li>
<li>最高法和省高院的惩戒委。从专业角度评判是否违反审判职责。</li>
<li>组成：半数以上自己人（法官）</li>
<li>有异议可以向惩戒委提出。</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org9fa013f"></a>法官的职业保障<br />
<div class="outline-text-5" id="text-org9fa013f">
<p>
职业保障、工资保险福利保障、人身和财产保障。
法官权利与义务适用于法官法。
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orgca896aa" class="outline-3">
<h3 id="orgca896aa">法官职业道德</h3>
<div class="outline-text-3" id="text-orgca896aa">
</div>
<ul class="org-ul">
<li><a id="org5176eb5"></a>法官职业道德的特征<br />
<div class="outline-text-4" id="text-org5176eb5">
<p>
主体特定、内容全面、约束广泛。
</p>
</div>
</li>
<li><a id="org6d1cdd1"></a>法官职业道德的内容<br />
<div class="outline-text-4" id="text-org6d1cdd1">
<ol class="org-ol">
<li>忠诚司法事业，不得罢工</li>
<li>保证司法公正，维护审判独立、确保结果公平公正，
实体公正和程序公止并重、提高司法效率、公开审判、
遵守回避保持中立（不得歧视），尊重其他法官（不过问不干预案件）</li>
<li>确保司法廉洁，利益不论大小均应拒绝。
不得从事或参与营利性经营活动，不得提供实质性的咨询意见
不得以其身份谋取特殊利益，教育督促家庭成员不利用职权获利</li>
<li>坚持司法为民，司法便民，不得随意打断或制止当事人和参与人发言</li>
<li>维护司法形象，发表文章接受采访时不得针对具体案件和当事人进行评论</li>
</ol>
</div>
</li>
<li><a id="org4efdd30"></a>法官职业责任<br />
<div class="outline-text-4" id="text-org4efdd30">
<p>
造成不良影响的警告记过或记大过
情节较重的降级撤职
情节严重的开除
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7669812" class="outline-2">
<h2 id="org7669812">检察制度和检察官职业道德</h2>
<div class="outline-text-2" id="text-org7669812">
</div>
<div id="outline-container-org9785ab8" class="outline-3">
<h3 id="org9785ab8">检察制度概述</h3>
<div class="outline-text-3" id="text-org9785ab8">
<p>
检察官代表国家向法院提起诉讼，维护法律事实。
三种类型检察制度：英美法系、大陆法系、社会主义国家。
</p>
</div>
<ul class="org-ul">
<li><a id="orgac8080b"></a>检察制度的特征<br />
<div class="outline-text-4" id="text-orgac8080b">
<ol class="org-ol">
<li>检察机关与行政机关、监察机关、审判机关平行。</li>
<li>检察机关是国家的法律监督机关。</li>
<li>检察一体原则。检察长领导本院检察工作，重大事项由检察长决定，
上级领导院领导下一级的工作。</li>
</ol>
</div>
</li>
<li><a id="org656206e"></a>检察制度与基本原则<br />
<div class="outline-text-4" id="text-org656206e">
<ul class="org-ul">
<li>检察院设置法定原则</li>
<li>检察院独立行使原则</li>
<li>司法公正原则</li>
<li>司法责任原则</li>
<li>接受人民群众监督原则</li>
<li>对诉讼活动实行法法律监督原则</li>
<li>检察权统一行使原则/检察一体化原则
检察官与检察机关构成统一整体。</li>
</ul>
</div>
</li>
<li><a id="org141c0a9"></a>检察官<br />
<div class="outline-text-4" id="text-org141c0a9">
<p>
与法官规定相同。
</p>
<ul class="org-ul">
<li>条件和任免
违法任命检察官可以要求撤销。（领导关系）
回避情况只允许不同业务部门的检察员。</li>
<li>职责义务和权利</li>
<li>考核培训奖励和惩戒</li>
<li>职业保障</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org910219c" class="outline-3">
<h3 id="org910219c">检察官职业道德</h3>
<div class="outline-text-3" id="text-org910219c">
<p>
忠诚、为民、担当、公正、廉洁。
公正：独立履职、理性履职、履职回避、重视证据、遵循程序、保障人权，
尊重律师和法官、遵守纪律、提高效率
</p>

<pre class="example">
廉洁：法官和检察官能炒股吗？
答：可以，不收黑钱，信源正当。
</pre>
</div>
</div>
</div>
<div id="outline-container-org3db64b9" class="outline-2">
<h2 id="org3db64b9">律师制度和律师职业道德</h2>
<div class="outline-text-2" id="text-org3db64b9">
</div>
<div id="outline-container-org1a4868a" class="outline-3">
<h3 id="org1a4868a">律师制度</h3>
<div class="outline-text-3" id="text-org1a4868a">
</div>
<ul class="org-ul">
<li><a id="orgb6863ed"></a>律师<br />
<div class="outline-text-4" id="text-orgb6863ed">
<p>
依法取得律师执业证书、接受委托或者𢩽定，为当事人提供法律服务的执业人员。
社会律师、公司律师、公职律师、军队律师。
</p>

<ul class="org-ul">
<li>专业性</li>
<li>服务性</li>
<li>受托性（不受托就不服务）</li>
</ul>

<p>
律师执业资格条件：
</p>
<ol class="org-ol">
<li>拥护宪法、通过法考、实习1年、品行良好</li>
<li>特殊条件：从事专业15年，高等职称搞科研，考核合格</li>
<li>禁止条件：无行为能力的，受刑事处罚的（过失犯罪除外），被吊销执业证书的</li>
<li>限制条件：公务员不能兼职律师，律师可以兼任人常（不能接案）
只能在一个律师事务所执业。</li>
</ol>


<p>
申请律师执业证书的程序
</p>
<ol class="org-ol">
<li>律师资格与律师执业相分离，有资格不一定需要执业</li>
<li>向市政府或直辖市的区政府司法部门申请</li>
</ol>


<p>
律师权利与义务
</p>
<ul class="org-ul">
<li>律师被停止执业处罚期间不能变更执业机构</li>
<li>律师受调查期间不得注销执业证书</li>
<li>应加入律协</li>
<li>不能私自收费</li>
<li>不能以提供法律服务的便利牟取当事人争议的利益</li>
<li>不能为双方担任代理人，法定情形除外</li>
</ul>
</div>
</li>
<li><a id="org036b877"></a>律师制度，律师收费制度<br />
<div class="outline-text-4" id="text-org036b877">
<p>
“两结合”司法局和律协相结合
</p>

<ol class="org-ol">
<li>统一收费：律所统一接受委托，统一收费</li>
<li>收费类别：办案费和律师费
办案费实办实销，客观发生
律师费较主观，属于服务费</li>
<li>收费方式：政府指导或市场调节
政府指导项目：
刑案工伤劳报，三养两金双保，公益群诉，国家赔，省级两厅指导
“两厅”：省物价厅、省司法厅</li>
<li>市场调节：风险代理收费，涉及财产关系的民事案件
最高收费不超过收费合同的三成。
以下禁止风险代理收费：
婚姻继承工伤劳报，三养两金双保，（严禁）行刑国赔群诉</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org5e7f219" class="outline-3">
<h3 id="org5e7f219">律师事务所</h3>
<div class="outline-text-3" id="text-org5e7f219">
<ol class="org-ol">
<li>律所是律师的执业机构，也是市场中介组织。
律所不得从事法律服务以外的经营活动。</li>
<li>律所的设立：名称、住所、章程，一定的律师和资产，设立人三年没停业
个人律所，合伙律所，国资律所</li>
</ol>
</div>
</div>
<div id="outline-container-org429f988" class="outline-3">
<h3 id="org429f988">法律援助制度</h3>
<div class="outline-text-3" id="text-org429f988">
<ol class="org-ol">
<li>国家来援助经济困难或特殊案件的当事人。</li>
<li>特征：
<ul class="org-ul">
<li>援助无偿，不收钱</li>
<li>主体特定，政府提供法援，
具体实施包括律师、机构工作人员，基层工作者，社会团体等。</li>
<li>统一实施。统一受理、统一审查、统一指派、统一监督</li>
</ul></li>
<li>形式丰富。刑事或民事辩护、法律咨询（无须审查经济状况）</li>
</ol>

<p>
法律援助对象及其范围
</p>
<ol class="org-ol">
<li>刑事案件：知障一二级、共犯没有辩护人，检方来抗诉，影响很重大
指定援助：盲聋哑半疯傻 无期死刑未长大 强制医疗外国人 经济困难或其他</li>
<li>民事行政案件：两金三养两保 国赔勇为劳报</li>
</ol>


<p>
法律援助终止和救济
救济程序：法律性质纠正申诉控告找检察院，对法援有异议找司法局
</p>
</div>
</div>
<div id="outline-container-orgea4fd6d" class="outline-3">
<h3 id="orgea4fd6d">律师职业道德与执业行为规范</h3>
<div class="outline-text-3" id="text-orgea4fd6d">
<p>
忠诚为民 法治正义 诚信敬业
</p>

<p>
律师业务推广：社会活动、推广广告
</p>
<ul class="org-ul">
<li>广告不能损宁律师形象</li>
<li>不得艺术夸张</li>
<li>不能让人产生不合理的期望</li>
</ul>

<p>
律师与委托人关系
</p>
<ul class="org-ul">
<li>谨慎诚实客观告知法律风险</li>
<li>有权选择相应方案</li>
<li>承办业务及时通报进度</li>
<li>禁止虚假承诺。律师的辩护代理意见未被采纳不属于虚假承诺</li>
<li>禁止非法牟取委托人利益</li>
<li>应进行利益冲突审查</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga441a8d" class="outline-2">
<h2 id="orga441a8d">公证制度和公证员职业道德</h2>
<div class="outline-text-2" id="text-orga441a8d">
</div>
<div id="outline-container-org103d07d" class="outline-3">
<h3 id="org103d07d">公证制度概述</h3>
<div class="outline-text-3" id="text-org103d07d">
<p>
公证：对真实性、合法性予以证明，赋予法律效力。与私证相对。
管理制度“两结合”：公证协会、司法局
</p>
<ol class="org-ol">
<li>公证是一种特殊的证明活动：主体特殊、内容和对象特定
对象：没有争议的民事法律行为，有法律意义的事实和文书
公证可以作为证据，除非有相反证据足以推翻。</li>
<li>公证是非诉的司法活动。</li>
</ol>


<p>
公证机构与公证员
</p>
<ol class="org-ol">
<li>公证机构不以营利为目的，（还是要收服务费）
任法独立行使公证职能、承担民事责任。
<ul class="org-ul">
<li>设立：所在地司法行政机关组建，报省级司法行政机关审批</li>
<li>条件：有名称、场所、公证员、资金</li>
<li>冠名：市或辖区，加字号：“四川省成都市 <i>律政</i> 公证处”
县及公证处没有字号。</li>
</ul></li>
<li>公证员，特殊条件：法律服务满10年公务员
禁止条件：故意犯罪或职务过失犯罪受刑事处罚的
任免：上报省司法厅审核同意，报请国务院司法部同意</li>
</ol>


<p>
公证程序
</p>
<ol class="org-ol">
<li>申请：可以向住所地、经常居住地、行为地、事实发生地四个地提出。
涉及不动产的，只能向不动产所在地提出。
2个以上当事人可以共同去申办。
申请2个以上公证处，由最先受理申请的公证机构办理。</li>
<li>公证代理：除遗嘱、生存收养必须本人申办
港澳台地区当事人，在居住地公办机构或司法部指定机构做证明。</li>
</ol>
</div>
</div>
<div id="outline-container-orgce95e0c" class="outline-3">
<h3 id="orgce95e0c">公证员职业道德</h3>
<div class="outline-text-3" id="text-orgce95e0c">
<p>
公信力：不仅适用于执业公证员，也适用于辅助人员，其他工作人员。
忠于法律，尽职履责，爱岗敬业，规范服务，
加强修养，提高素质，廉洁自律，尊重同行。
</p>
</div>
</div>
</div>
<div id="outline-container-orga49e470" class="outline-2">
<h2 id="orga49e470">其他法律职业人员职业道德</h2>
<div class="outline-text-2" id="text-orga49e470">
</div>
<div id="outline-container-org9fd899a" class="outline-3">
<h3 id="org9fd899a">法律顾问职业道德</h3>
<div class="outline-text-3" id="text-org9fd899a">
<p>
狭义法顾：律师
广义法顾：包括律师和其他法律服务专业人员
以法顾素质，从“法律咨询者”变为“法治守护者”。
惩戒处分、行政法律责任、民事法律责任、刑事法律责任。
</p>
</div>
</div>
<div id="outline-container-org06ee0ec" class="outline-3">
<h3 id="org06ee0ec">仲裁员职业道德</h3>
<div class="outline-text-3" id="text-org06ee0ec">
<p>
法律类仲裁员。除此之外是劳动争议、农村土地承包的仲裁员。
仲裁委员会选任：公道正派。
职业道德：独立公正， <i>主动披露</i> 与当事人或代理人的某种关系。
</p>

<p>
职业责任：《仲裁法》没有规定 <i>民事责任</i> 。坐牢但不赔钱
</p>
</div>
</div>
<div id="outline-container-org160b8de" class="outline-3">
<h3 id="org160b8de">行政机关中从事行政处罚决定审核、行政议、行政裁决的公务员职业道德</h3>
<div class="outline-text-3" id="text-org160b8de">
<p>
三类特殊的公务员。
</p>

<p>
双重主体资格：有 <i>编制</i> 、有资质（行政执法权）。
</p>

<p>
基本要求：《公务员法》
特定要求：合法、公正、透明、高效
职业责任：行政责任与刑事责任，人身纪律财产刑事
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

<p class="author">Author: <a href="mailto:pilrymage@gmail.com">Pilrymage</a></p>
<p class="date">Date: 2025-01-25 Sat 13:11</p>
<p class="license">License: <a href="https://www.creativecommons.org/licenses/by-nc/4.0/deed.zh-hans">CC BY-NC 4.0</a></p>
<!--<script src="https://utteranc.es/client.js" repo="Spike-Leung/taxodium" issue-term="pathname" theme="github-light" crossorigin="anonymous" async></script>-->
</div>
</body>
</html>
